[
    {
        "url": "https://saharareporters.com/2023/09/05/nigeria-labour-congress-locks-government-offices-abuja-oyo-anambra-other-states-amid",
        "summary": "The Nigeria Labour Congres (NLC) has commenced the two-day nationwide warning strike against the President Bola Tinubu-led Federal Government’s failure to address the effects of fuel subsidy removal and devaluation of naira.\nMeanwhile, the NLC locked the government offices in Enugu, Ebonyi, Anambra, Abuja, Oyo States as the strike commenced on Tuesday.\nSince then, federal government has been negotiating with the Labour Unions on how to address and cushion the effects of the removal and attendant consequences.\nSeveral meetings between the Presidency and the unions on palliatives for Nigerians suffering hardship in the wake of the petrol subsidy removal proved abortive.\nStating this while featuring on Channels TV programme on August 18, 2023, the NLC President explained that if the N5 billion should be divided with Nigeria's population, it would not amount to N1,500 per person."
    },
    {
        "url": "https://saharareporters.com/2023/08/21/governor-soludo-announces-n12000-monthly-stipend-each-civil-servant-rice-300000",
        "summary": "Governor Charles Soludo of Anambra State has announced an interim response to cushion the effects of the recent fuel subsidy removal and attendant current economic hardship on the people of the state.\n59,000 persons) for the period September 2023 to December 2023 a monthly flat non-taxable cash award of N12,000.\n“Basic Education (primary school to JSS3) remains tuition free for all public schools.\n“Henceforth, we will provide free antenatal services and free delivery services to pregnant mothers in State primary health centres and general hospitals.\nThis is in addition to renovation/modernization of hundreds of primary schools and secondary schools."
    },
    {
        "url": "https://saharareporters.com/2023/05/31/breaking-tinubu-government-meet-nigeria-labour-congress-today-over-fuel-subsidy-removal",
        "summary": "The Nigeria Labour Congress will meet with representatives of the Nigerian Government over the removal of fuel subsidy.\nJoe Ajaero, the NLC President disclosed this on Wednesday while featuring on a Channels TV programme.\nBola Tinubu, Nigeria’s newly inaugurated President on Monday in his inaugural speech said there would be no more fuel subsidy.\nThe statement reads, “We at the Nigeria Labour are outraged by the pronouncement of President Bola Tinubu removing 'fuel subsidy' without due consultations with critical stakeholders or without putting in place palliative measures to cushion the harsh effects of the 'subsidy removal'.\n“By his insensitive decision, President Tinubu on his inauguration day brought tears and sorrow to millions of Nigerians instead of hope."
    },
    {
        "url": "https://saharareporters.com/2023/06/02/breaking-nigerian-labour-congress-declares-nationwide-strike-wednesday-over-fuel-subsidy",
        "summary": "The Nigeria Labour Congess (NLC) has declared a nationwide strike from next Wednesday.\nThis comes amid fuel shortages across the country occasioned by President Bola Tinubu’s inaugural speech in which he declared that “fuel subsidy is gone”.\nSaharaReporters had reported on Wednesday that the meeting between the federal government and the Nigerian Labour Congress (NLC) over fuel subsidy removal ended without a consensus.\nThe Organised Labour was represented by the NLC National President, Joe Ajaero; and the President of the Trade Union Congress of Nigeria (TUC), Festus Osifo.\nIt had been reported that President Tinubu announced during his inaugural speech on Monday at the Eagle Square, Abuja that there would be no more fuel subsidy."
    },
    {
        "url": "https://saharareporters.com/2023/07/20/ruling-apc-governors-lament-hardship-caused-tinubus-fuel-subsidy-removal",
        "summary": "Nigerian governors elected on the platform of the ruling All Progressive Congress (APC) have lamented that Nigerians are suffering acute hardship orchestrated by the removal of fuel subsidy by President Bola Tinubu and their party’s government.\nGovernor Uzodimma admitted that although the removal of fuel subsidy would result in increased federal allocation to states, the subnational governments would ensure they support the federal government to ameliorate the pains of the masses.\n“The current hardship occasioned by the price increase is being addressed.\n“We understand the concerns of Nigerians regarding the removal of fuel subsidy, and we are working diligently to ensure that the impact on the people is minimised.\nThe governors assured that the welfare of Nigerians remains their top priority and that every effort would be made to ensure that the impact of the subsidy removal is managed in a way that benefits all Nigerians."
    },
    {
        "url": "https://saharareporters.com/2023/07/26/it-becomes-tinubus-turn-suffer-skc-ogbonnia",
        "summary": "Said differently, as it was once Tinubu’s turn to become president, now is ultimately his turn to lead by example and suffer like the ordinary Nigerians.\nEven the very armchair economists who dominated every media space professing the subsidy removal have suddenly disappeared.\nSadly, the Asiwaju—a dogged opponent of the subsidy removal during the “clueless” Jonathan era—is suddenly grandstanding as the messiah.\nThe joy of childbirth is the relief that comes after the pain.”The relief so far is N500 billion as palliative for the fuel subsidy removal.\nLike a caring mother, it has become Tinubu’s turn to suffer like the ordinary Nigerians."
    },
    {
        "url": "https://saharareporters.com/2023/06/23/new-villa-occupants-are-suffocating-poor-oluwaseyi-oyetunbi",
        "summary": "The emergence of President Tinubu has dashed the hope of many Nigerian citizens, not so many believe in his capacity largely because of his poor health and shady track record.\nIt doesn’t look like much is expected from the Tinubu presidency, but Nigeria is comatose, needs amazing creativity to rise again.\nHe meant it when he said nothing will change about his policy on subsidy removal no matter how long the masses protest.\nBefore Nigerians could figure out how to acclimatize with the surge in fuel price, affecting prices of every commodity, Sen. Ahmed Tinubu had signed the mischievous student loan.\nPresident Ahmed Tinubu has insisted on removing fuel subsidy, he is also taking a step to withdraw funding education."
    },
    {
        "url": "https://saharareporters.com/2023/05/31/breaking-fuel-subsidy-nigerian-workers-nlc-meeting-president-tinubus-delegation-ends",
        "summary": "The meeting between the President Bola Tinubu-led federal government and the Nigerian Labour Congress (NLC) over fuel subsidy removal has ended without a consensus.\nRepresentatives of the Federal Government included Dele Alake, the spokesperson for Tinubu; and the Group Chief Executive Officer of the Nigerian National Petroleum Company (NNPC) Limited, Mele Kyari.\nThe Organised Labour was represented by the NLC National President, Joe Ajaero; and the President of the Trade Union Congress of Nigeria (TUC), Festus Osifo.\nAfter several hours of meeting with the Federal Government, the NLC demanded that the Federal Government return to the status quo by reversing the price of fuel before resuming negotiations with the NLC.\nIt had been reported that President Tinubu announced during his inaugural speech on Monday at the Eagle Square, Abuja that there would be no more fuel subsidy."
    },
    {
        "url": "https://saharareporters.com/2023/09/02/many-nigerians-wont-get-one-cup-rice-president-tinubus-so-called-palliatives-nigeria",
        "summary": "The Nigeria Labour Congress (NLC) has picked holes in the President Bola Tinubu's fuel subsidy removal palliatives, noting that many Nigerians will not get even one cup of rice.\nEach state was given N5 billion to purchase food items especially rice and foodstuffs to distribute to most vulnerable residents.\nDissatisfied on the method of sharing of the palliatives which many Nigerians have accused the ruling All Progressives Congress (APC), of only sharing the food palliatives to members, the Labour Union declared a two-day nationwide strike.\nThe NLC President Joe Ajaero who declared the warning strike action, regretted that the distribution of food palliatives is inadequate to combat the effects of the fuel subsidy removal.\nNow, is that the palliative?”Describing the palliatives as “mere tokenism,\" the NLC President stated that the palliatives being shared to some Nigerians cannot cushion the impacts of the subsidy removal policy."
    },
    {
        "url": "https://saharareporters.com/2023/06/03/my-government-wouldnt-have-announced-fuel-subsidy-removal-without-palliatives-tinubu-did",
        "summary": "The presidential candidate of the Peoples Democratic Party (PDP), Atiku Abubakar, has faulted President Bola Tinubu’s approach to fuel subsidy removal without provision for palliative measures.\nFormer President Muhammadu Buhari in 2022 maintained the determination to remove fuel subsidy, hence, there was no provision for fuel subsidy in the 2023 appropriation bill.\nChannels TV quoted Atiku as saying that “Between 1999 and 2007, the PDP government initiated the petroleum subsidy removal and I chaired the committee.\nWe achieved subsidy removal in two phases but only after providing palliatives to those most affected by the subsidy removal,” the former Vice President said.\nThat is what we would have done and not just announced subsidy removal without discussion with the affected sectors of the economy."
    },
    {
        "url": "https://saharareporters.com/2023/06/01/subsidy-removal-president-tinubu-will-fix-one-nigerias-refineries-december-says-national",
        "summary": "Mele Kyari, the Group Managing Director of the Nigerian National Petroleum Company Limited (NNPCL), has said that President Bola Tinubu’s government has concluded arrangements to fix one of the country’s refineries and put it into an optimal level of operation by December.\nThe announcement of fuel subsidy removal has triggered over 100 percent hikes in fuel pump prices across the country, even at fuel stations managed by NNPCL.\nKyari said, “There was subsidy in 2022 but in 2023, not a single naira was provided for the purpose.\n“For any company, when you have negative N2.8 trillion, there is no company in the whole of Africa that will lend to you.\nIf we continue, we will run into defaults and the defaults of NNPC is the default of Nigeria."
    },
    {
        "url": "https://saharareporters.com/2023/06/22/fuel-subsidy-removal-bank-considers-palliatives-salary-increment-staff",
        "summary": "In response to the current economic realities which have witnessed recent spikes in fuel, electricity, and other prices, Nigeria’s largest microfinance bank, LAPO Microfinance Bank Limited with over 7,000 staff has announced a 25% and 12.5% increment in the salaries for junior and senior staff respectively across the country.\nIn 2021 - 2022, over 900 staff were promoted to different ranks across the institution and our annual LAPO Staff Meritorious and Long Service Awards platform underscore our unwavering commitment to recognising and rewarding distinguished and loyal staff.\nWe shall continue to prioritise staff welfare among other things and are committed to implementing our strategies accordingly.\nLAPO Microfinance Bank Limited was ranked in 2021 by StatiSense, as the 5th largest employer of labour in Nigeria with over seven thousand staff.\nLAPO Microfinance Bank remains committed to its over 30 years mandate of socio-economic empowerment of members of low-income households and owners of micro small and medium enterprises."
    },
    {
        "url": "https://saharareporters.com/2023/07/17/lives-nigerians-hands-government-evans-ufeli-esq",
        "summary": "This approach is an afterthought from the lack of planning before the sudden removal of subsidy.\nThe government cannot sustain that policy just like it could not sustain the policy of subsidising the cost of petrol.\nThe subsidy removal has cost us incalculable damage.\nI am indifferent about the subsidy removal as much as I am drawn to the consequences of that action, which the government never considered.\nEvans Ufeli Esq is a Lagos based lawyer and principal partner at Rabbi Solicitors."
    },
    {
        "url": "https://saharareporters.com/2023/07/20/price-control-quite-laughable-adeola-soetan",
        "summary": "I ask, Price Control of what?\nNo economy grows in a state of \"not sure what the market price will be the next moment\".\nOnly a few big businesses have shock absorbers for such disorderliness caused by \"subsidy\" removal.\nSo they didn't give a thought to the after-effects of the subsidy removal they supported.\nTheir U-turn may be for a lack of ideological understanding of the 2012 protest against \"subsidy removal\"."
    },
    {
        "url": "https://saharareporters.com/2023/04/07/northern-youths-vow-stop-nigerian-governments-fuel-subsidy-removal-plan",
        "summary": "Northern youths under the aegis of the Northern Youth Council of Nigeria (NYCN) have vowed to stop the fuel subsidy removal by President Muhammadu Buhari-led Nigerian government.\nThe Northern youths, while threatening to resist the proposed fuel subsidy removal by all means, expressed concern over the potential impact of fuel subsidy removal on “already struggling economy and the Nigerian people.”The group called on other youth organisations in the country to join in the fight to protect the interests of Nigerians.\nThe NYCN President, Alhaji Isa Abubakar, in a statement in Kaduna on Thursday, reportedly expressed fears that any palliative measures put in place to cushion the effect of the subsidy removal would be looted by corrupt individuals, as it happened with the COVID-19 intervention funds.\nBut the Northern youth group called on the Nigerian government to review its decision to remove the subsidy.\nIt added that the government should rather focus on implementing policies that would create jobs and stimulate economic growth in the country."
    },
    {
        "url": "https://saharareporters.com/2023/08/29/president-tinubus-fuel-subsidy-palliatives-being-shared-lawmaker-only-apc-members-kwara",
        "summary": "Aishat Tundun Alanamu representing them at the Kwara State House of Assembly for ignoring them during the distribution of fuel subsidy removal palliatives.\nTundun is only trying to represent and serve APC members; no one can tell.\n“Let me make it broader, In my compound — Olobi Compound — we are more than a hundred, and the number of registered APC members amongst us isn't up to twenty.\n“Hajia Tundun does not need anyone to tell her that our constituency shall never be a bargain for APC members alone.\nAishat Tundun Alanamu for a response to this claim were futile."
    },
    {
        "url": "https://saharareporters.com/2023/07/25/nigerian-governors-forum-said-nothing-specific-concrete-about-palliatives-fuel-subsidy",
        "summary": "The Trade Union Congress has described as “empty policy laced with lies”, the President Bola Tinubu-led Nigerian government’s directive to state governors to draw plans on the palliatives to mitigate the impact of the recent petrol price increase.\nTUC President, Festus Osifo, at a press briefing in Abuja on Monday said this, noting that the congress did not trust the process.\n“If you listen to the Nigerians Governors Forum, they invited us for meetings and we made our case known to them.\nThey said each state should go back and look at what they can do, that’s not how to lead.\nIt’s of no essence.”He urged the president to address the insecurity in Plateau and other parts of the country."
    },
    {
        "url": "https://saharareporters.com/2023/07/18/tinubu-orders-review-n8000-conditional-cash-transfer-programme-12-million-poor-nigerian",
        "summary": "President Bola Tinubu has ordered the review of the N8,000 conditional cash transfer programme for 12 million poor households in Nigeria.\nTinubu’s administration had proposed to disburse N8,000 monthly each to 12 million poor households for six months as part of measures to cushion the effects of fuel subsidy removal on Nigerians.\n“Immediate release of fertilisers and grains to approximately 50 million farmers and households respectively in all the 36 states and the FCT.\n“President Bola Tinubu has promised to always prioritize the wellbeing of Nigerians and he is irrevocably committed to the vow.\n“I wish to assure Nigerians that President Tinubu will continue to be a listening leader whose ears will not be dull to the views expressed by the citizenry."
    },
    {
        "url": "https://saharareporters.com/2023/08/09/exclusive-nigerian-senators-upset-senate-president-akpabio-exposing-them-collecting",
        "summary": "Nigerian senators are angry with the Senate President, Godswill Akpabio after exposing that they received bribe money from ministerial screening in a video that went viral on Wednesday, SaharaReporters has learnt.\n“Senators are upset with Senate President Akpabio for exposing the bribe money they get for ministerial screening.\n“He never disclosed to the senators the source of the N2 million each sent to their accounts.\nThen the following morning, senators received only N2 million each in their accounts while the senate president pocketed hundreds of millions of naira.\n“What a shame and highest treachery and blackmail by the Senate President."
    },
    {
        "url": "https://saharareporters.com/2023/08/23/tinubu-government-distributes-few-cups-garri-nigerians-fuel-subsidy-palliatives-lagos",
        "summary": "Human rights and pro-democracy group, Take-It-Back Movement (TIB), has tackled the President Bola Tinubu-led Nigerian government over the distribution of “few cups of Garri” as palliative for removal of petrol subsidy removal in Lagos State.\nThe group wrote: “Distributing few cups of garri as subsidy palliatives to Nigerians is not only unfortunate, it is a direct insult on the sensibilities of the Nigerian people.\n“How do few cups of garri address the problem of increased cost of transportation?\nHow does this mitigate the issue of increasing poverty, and unprecedented hardship occasioned by subsidy removal?\nHow does few cups of garri address the problem of increased cost of transportation?"
    },
    {
        "url": "https://saharareporters.com/2023/08/02/niger-state-deputy-governor-joins-nlc-protest-says-planned-palliatives-not-adequate",
        "summary": "The deputy governor of Niger State, Yakubu Garba joined the Nigeria Labour Congress protesters from the Labour House to the state House of Assembly on Wednesday.\nGarba, who was the immediate past NLC chairman in the state said the upward review of salaries of workers across all levels would cushion the effects of the fuel subsidy removal on citizens.\nHe said the state government was working in collaboration with the state House of Assembly to provide opportunities that would cushion the effects of the fuel subsidy removal on citizens of the state.\nAlso speaking, the State NLC Chairman, Idris Lafene said the labour union would not back out of its demands.\nHe said part of its demands from the state government was the payment of N60,000 palliative to all workers across all levels in the state."
    },
    {
        "url": "https://saharareporters.com/2023/08/24/tinubu-government-yet-release-n5billion-fuel-subsidy-palliatives-osun-state-governor",
        "summary": "The Governor Ademola Adeleke-led administration has said that the Osun State government has not received the N5billion the federal government pledged to make available to the state to cushion the effect of subsidy removal.\nHowever, the state inaugurated committee for the distribution of food palliatives that confirmed receiving 3,000 bags of 50kg rice said it was still expecting the N5bn federal government pledged to make available.\nSpeaking for the governor, the Commissioner for Information, Kolapo Alimi on Wednesday said once the state receives the remaining bags of rice from the federal government, it will start its distribution.\nHe said: “As at today, we have received 3000 bags of rice and we are still expecting 14,320 bags.\nOnce we receive the money, our governor is always transparent; he will equally address the state on it."
    },
    {
        "url": "https://saharareporters.com/2023/08/29/adamawa-state-government-spends-n16billion-10-shuttle-buses-n5billion-subsidy",
        "summary": "The state government said it had, however, procured N1.4 billion worth of grains in order to crash the prices of foodstuff by 50 per cent in the state.\nOn August 17, the federal government announced a N5 billion palliative for each state of the federation, including the federal capital territory (FCT), to cushion the impact of the removal of the petrol subsidy.\nBabagana Zulum, governor of Borno State, had made the announcement in Abuja while briefing State House correspondents at the end of a National Economic Council (NEC) meeting.\nThe state government has on its own procured 50 trucks to complement the federal government's gesture.\n\"To ensure the sustainability of the programme, the state government will crash the cost of the items by 50 percent."
    },
    {
        "url": "https://saharareporters.com/2023/07/31/subsidy-removal-you-cant-continue-punish-nigerians-because-corrupt-tendencies-few",
        "summary": "President Bola Tinubu in May announced the removal of subsidy on premium motor spirit otherwise known as petrol.\nHe said, \"Our growing economic crisis became exacerbated with the recent withdrawal of petrol subsidy by the Federal Government.\n“Government has not ceased to inundate citizens with its fabled palliative measures to cushion the effects of the subsidy removal.\nSo, I ask: Why waste resources on palliative measures, instead of attacking the problems frontally?\n“We have severally been told that some people have been enriching themselves from our commonwealth through petrol subsidy."
    },
    {
        "url": "https://saharareporters.com/2023/08/09/nigerian-tweeps-lambast-senate-president-akpabio-national-assembly-members-over-holiday",
        "summary": "Nigerians on X, formerly known as Twitter, have lambasted Nigerian Senate President, Godswill Akpabio and members of the National Assembly over the money sent to them to use for their holidays.\nY'all wanna enjoy holiday while the country is bleeding right?\nY'all wanna enjoy holiday while the country is bleeding right?\n🤦‍♂️🙆‍♂️ — HBO  (@CallMeHabeeb) August 9, 2023Another user, @da_gentlePrince said, “This what we deserve as there are no plans to move forward.\nThere4, Even If It's Just A Pretending Excuses, These Were Among Top Reasons Reveals By Military In Overthrowing Civilian Government.”"
    },
    {
        "url": "https://saharareporters.com/2023/04/06/fuel-subsidy-removal-buhari-government-secures-over-n300billion-world-bank-provide",
        "summary": "The Nigerian government has secured $800 million, equivalent to N368,288,000,000 from the World Bank under the National Social Investment Programme as part of palliative measures to mitigate the negative effects of the planned removal of the petroleum subsidy by June 2023.\n“We’re on course, we’re having different stakeholder engagements, we’ve secured some funding from the World Bank.\nNgige, while reacting to a question on the issue, said, “The subsidy palliatives will be left to the incoming government to implement.\nAgba expressed hope that the committee working with state governors would reach a consensus on the issue soon but added that there is no timetable for Osinbajo's committee to conclude the discussion, which he said is ongoing.\n“They will just have to ensure that everyone is carried along, that is both the federal and sub-national governments.”"
    },
    {
        "url": "https://saharareporters.com/2023/07/16/tinubus-proposed-n8000-palliative-another-avenue-enrich-corrupt-people-power-civil",
        "summary": "The United Action Front of Civil Society has described President Bola Tinubu’s plan to hand out N8,000 to 12 million households for six months as erroneous and a poorly conceived ploy to hoodwink the masses.\nThis is contained in a statement issued by Olawale Okunniyi (Veteran Che), Head of the National Coordinating Centre of the group on Sunday.\nThe civil society said there are indeed enough reasons to conclude that the N8,000 monthly handout to a mere fraction of the poverty-stifled masses would end up as another avenue for the corrupt enrichment of a few people in power as previously witnessed.\n\"The United Action Front of Civil Society expresses deep concerns over the deceitful palliative pill of Bola Tinubu-led administration of the All Progressives Congress (APC), following its arbitrary and inexcusable hike of the price of premium motor spirit (PMS).\n\"The leadership of organised platform of the Nigerian civil society unequivocally decries as another grand deceit; the N8,000 monthly handouts proposed by government for the yet to be disclosed (or otherwise covertly selected) 12 million poor and vulnerable households."
    },
    {
        "url": "https://saharareporters.com/2023/02/06/n-power-beneficiaries-grumble-over-non-payment-four-months-allowances-others-attack",
        "summary": "Beneficiaries of the N-Power batch C2 have attacked President Muhammadu Buhari’s government over the non-payment of their allowances for four months.\n“Please tell President Buhari and Sadiya Umar Farouq to pay N-Power stream 2 their four months stipends.\nAnother beneficiary said, “The N-Power Program emerged in 2016 shortly after President Muhammadu Buhari took over power.\nIn June 2021, SaharaReporters reported that 14,000 beneficiaries of the N-Power programme were owed for five months.\nN-Power is a youth empowerment scheme sponsored by the Nigerian government under the Social Investment Programme (SIP)."
    },
    {
        "url": "https://saharareporters.com/2023/06/07/we-can-see-poverty-faces-nigerians-president-tinubu-tells-state-governors-address",
        "summary": "President Bola Ahmed Tinubu has called on the governors to collaborate with the Federal Government to tackle the menace of poverty in the country.\nPresident Tinubu said good governance would safeguard the future of democracy.\nWe must work for our people,” President Tinubu told the governors, while assuring them that he would maintain an open-door policy.\nTinubu said the education sector must be improved as part of efforts to reduce poverty and penury:“How do we address the unacceptable level of poverty?\nThe governors, who took turns to speak, expressed happiness with the president’s subsidy-removal decision, all-inclusive leadership and statesmanship."
    },
    {
        "url": "https://saharareporters.com/2023/08/21/heda-wants-efcc-other-anti-corruption-bodies-monitor-how-nigerian-states-utilise",
        "summary": "The Human and Environmental Development Agenda (HEDA) has called for transparent implementation strategies and monitoring of the palliatives approved by President Bola Tinubu administration to be provided to citizens through state governments.\nAlso, state governors are to procure 100,000 bags of rice, 40,000 bags of maize, and fertilizers.\nIt was learnt that 52 per cent of the funds were given to the state governments as grants with 48 per cent as loans.\nHowever, HEDA in a statement stressed the importance of transparent implementation frameworks and robust strategies to ensure accountability and effective utilization of these funds.\nHEDA’s Chairman, Olanrewaju Suraju urged all state governments to put forth detailed implementation strategies that demonstrate their commitment to the responsible allocation of resources."
    },
    {
        "url": "https://saharareporters.com/2023/08/02/distribute-n110billion-kept-lawmakers-exotic-cars-360-federal-constituencies-alleviate",
        "summary": "Human rights lawyer, Femi Falana, SAN, has stated that the N110billion being proposed for exotic cars and pallaitives for National Assemblies should be distributed to the country’s 360 federal constituencies.\n“Former Senate President, Dr. Ahmad Lawan defended the renovation fund, stating that the National Assembly building had not been renovated for 20 years.\nAccording to him, when the 9th National Assembly resumed, it was discovered that some parts of the property had become dilapidated.\n“We have confirmed that the N37 billion face-lift of the complex has not been completed.\n“Therefore, the total sum of N110 billion should be distributed to the 360 federal constituencies in the country."
    },
    {
        "url": "https://saharareporters.com/2023/09/05/nationwide-strike-nigerian-labour-union-nlc-shuts-down-government-offices-banks-kano",
        "summary": "The Nigeria Labour Congress, NLC, Kano State chapter on Tuesday joined the two-day warning strike to protest over the removal of fuel subsidy by the Bola Tinubu-led Nigerian government.\nIt was learnt that the early as 5am on Tuesday morning, the labour union shut down government offices and other facilities in the state.\nThe Union State Vice Chairman, Ado Riruwai who led the enforcement exercise, confirmed this to newsmen, Vanguard reports.\nHe further said that they were proceeding to the airport to ensure no flight took off from the airport.\nRecall that the NLC had given notice to embark on the two-day warning strike to protest the excruciating mass suffering and impoverishment experienced around the country, occasioned by the fuel subsidy removal."
    },
    {
        "url": "https://saharareporters.com/2023/08/02/breaking-protesters-pull-down-national-assembly-gate-abuja-force-their-way-premises",
        "summary": "Members of the organised labour who are currently protesting in Abuja have forcefully pulled down the main gate of National Assembly to gain entry into the complex.\nArmed policemen stationed at the entrance had locked the gate to prevent the protesters from gaining access into the building.\nBut after an altercation between the protesters and security agents, the protesters pulled down the main gate of the complex.\nThe protesters are currently heading to the second gate of the building and have vowed to also pull it down.\nFrom Unity Fountain, the protesters headed to the National Assembly gate."
    },
    {
        "url": "https://saharareporters.com/2023/09/06/nigerian-secret-police-dss-arrests-government-officials-reselling-palliatives-market",
        "summary": "Operatives of the Department of State Services (DSS) have arrested some officials of State Emergency Management Agency diverting palliatives meant for the citizens to cushion the effects of fuel subsidy removal.\nSome of the suspects were arrested on Tuesday at a popular market in Lafia, Nasarawa State capital where the items were being resold.\nThey included officials of the Nasarawa State Emergency Management Agency (NASEMA) and their accomplices.\n“The Department of State Services (DSS) has received reports from some State Governments relating to diversion or sale of palliatives meant for their citizens.\nThere has been recent looting of warehouses suspected to be housing the Nigerian government's palliatives."
    },
    {
        "url": "https://saharareporters.com/2023/06/16/former-lawmaker-kazaure-names-buharis-nephew-sabiu-emefiele-bawa-malami-others-tinubu",
        "summary": "A former member of the House of Representatives, Gudaji Kazaure, has identified 12 people for President Bola Tinubu and his government to investigate in order to “recover Nigeria’s stolen money”.\nKazaure added that if Tinubu’s administration is truly determined to recover all stolen funds, there are certain people that must be prosecuted.\nThere are people in his government and there are people that assisted him who are part of this mess.\nWe have to arrest and investigate Central Bank Governor (Godwin Emefiele) who is now under investigation.\nThey opened a secret account, sending money to the government and they also send some to the private account.”“Let Mr President bring back my committee."
    },
    {
        "url": "https://saharareporters.com/2023/08/02/unionists-residents-troop-out-protest-abuja-over-tinubus-anti-people-policies",
        "summary": "Members of the Nigerian Labour Congress (NLC), Trade Union Congress (TUC) and other aggrieved Nigerians on Wednesday trooped to the streets of Abuja, the nation’s capital to protest against the hardship caused by the removal of fuel subsidy by President Bola Tinubu’s administration.\nThe protest kicked off from the popular Unity Fountain with members of organized labour displaying placards and banners.\nThe protesters expressed dissatisfaction with the hikes in fuel prices and the failure of the Tinubu administration to reverse “unfriendly policies targeted against the poor”.\nSome of the inscriptions on their placards read: #BringBackOurRefineries; #LetThePoorBreathe; and #ALUTACONTINUA.\nFrom Unity Fountain, the protesters headed to the National Assembly gate."
    },
    {
        "url": "https://saharareporters.com/2023/08/02/hundreds-enugu-workers-join-nigeria-labour-unions-nationwide-protest-over-low-minimum",
        "summary": "The workers who trooped out en masse converged on the NLC House in the New Market area of the state capital, Enugu, where they took off after about a 30-minute-long prayer to seek God's intervention.\nThe protesters decried the hardship the fuel subsidy removal had plunged the country into in a space of 60 days.\nSo if you minus the transportation what remains in the salary,\" the prayer leader lamented.\nAfter the prayer session, the protesters left for the Government House with placards with various inscriptions while chanting solidarity songs.\nMeanwhile, the police and other security agencies are on the ground to ensure that miscreants do not take advantage of the protest to unleash mayhem on the state."
    },
    {
        "url": "https://saharareporters.com/2023/08/09/senate-president-akpabio-tells-senators-money-has-been-sent-their-accounts-enjoy-holiday",
        "summary": "Senate President Godswill Akpabio has confirmed that undisclosed amounts of money have been sent to members of the upper legislative chamber to use to enjoy their holidays.\nAkpabio made the revelation in a video which went viral on Wednesday morning while addressing his colleagues before the adjournment of a motion moved by one of the senators.\nIn the viral video, Akpabio said, “In order to enable all of us to enjoy our holidays, a token has been sent to our various accounts by the clerk of the national assembly.”But when his statement sparked a rowdy moment on the floor of the Senate, he rephrased the statement and said, “I withdraw that statement.\n“In order to allow you to enjoy your holiday, the senate president has sent prayers to your mailboxes to assist you to go on a safe journey and return.”This comes amid rising inflation and astronomical rise in prices of food in markets which have subjected Nigerians to deeper poverty, especially since the removal of fuel subsidy by President Bola Tinubu-led government.\nAt least 107 units of the 2023 Toyota Land Cruiser model and 358 units of the 2023 Toyota Prado model would be procured for federal lawmakers."
    },
    {
        "url": "https://saharareporters.com/2023/06/30/tinubu-copying-peter-obis-planned-policies-programmes-says-prof-nwaokobia-labour-party",
        "summary": "The Convener of Country First Movement, Prof Chris Nwokobia has accused President Bola Tinubu’s administration of copying all the policies planned by Peter Obi to run his administration since his inauguration in May.\nNwokobia, who was a member of the Labour Party/Obi-Datti Presidential Campaign Council for the 2023 election, opined that Peter Obi would have done better than Tinubu if given the chance to lead Nigeria due to his expertise in economics and politics.\nHe said, “All we have seen in the life span, one month of this administration is copycatting the policy programmes of Peter Gregory Obi.\nClearly, Peter Gregory Obi would have done better.\nHe continued: “Regarding the pace of Mr President, I totally disagree with those who say he is moving so fast."
    },
    {
        "url": "https://saharareporters.com/2023/07/17/closer-look-approved-budget-palliative-support-nasir-aminu",
        "summary": "The government plan to distribute N8,000 to 12 million poor households over six months as palliative support will benefit an estimated 64.88 million individuals out of 132.93 million poor people.\nThey will receive ₦5 billion, ₦4.4 billion, ₦4.1 billion, ₦3.9 billion, and ₦3.4 billion, respectively.\nFCT, Abia, Edo, Ondo, and Borno are the five states receiving the lowest palliative funds.\nDue to their low number of poor households, they will receive ₦888 million, ₦912 million, ₦1.05 billion, ₦1.13 billion, and ₦1.5 billion, respectively.\nData reveals a hurdle in fair fund distribution because individuals without bank accounts outnumber poor households."
    },
    {
        "url": "https://saharareporters.com/2023/07/13/tinubu-seeks-senate-approval-800million-world-bank-loan-earlier-requested-buhari-says-12",
        "summary": "President Bola Tinubu has written to the Senate to seek approval for $800 million loan to finance the National Social Safety Network Programme.\nThe request was contained in a letter read by Senate President Godswill Akpabio on the floor of the Senate on Thursday.\nSaharaReporters had reported that former President Muhammadu Buhari had sought the approval of the 9th Senate in May to borrow the fund from the World Bank.\nBut Tinubu in his letter read during plenary on Thursday, urged the lawmakers to consider the loan request.\nI expect that the House will speedily consider the request,” Tinubu's letter read in part."
    },
    {
        "url": "https://saharareporters.com/2023/06/05/what-exactly-wrong-our-own-subsidies-agba-jalingo",
        "summary": "The US still pay Export subsidies, Agriculture subsidies, Housing subsidies, Healthcare subsidies and Oil subsidies.\nThe Environmental and Energy Study Institute found that the US government alone spends $20 billion every year on direct fossil fuel subsidies.\n£2.4billion was spent on the Sustainable Farming Incentive, with £1.65billion in direct subsidies awarded to farmers in 2021/22.\nIn 2019, Germany alone spent approximately €5.4billion, on fossil fuel subsidies.\nAnd in 2021, EU member States, collectively spent approximately €4billion on fossil fuel subsidies and approximately €3.5billion on same in 2020."
    },
    {
        "url": "https://saharareporters.com/2023/08/13/exclusive-how-senate-president-akpabio-house-reps-speaker-abass-two-others-padded",
        "summary": "One of the sources said, “In the amended supplementary budget that the Senate and House of Reps passed weeks ago, Senate President, Deputy Senate President, Speaker and Deputy Speaker each has not less than N9 billion padded and inserted into the budget for personal and selfish interests.\nThe N500 billion will be taken from the N819 billion Supplementary Appropriation Act.\nThese include the supply of tricycles (Keke Napep) to the underprivileged in Oyo, Ogun and Lagos states -N150 million; supply of tricycles (Keke Napep) to the underprivileged in Kogi and Kwara states -N100 million; supply of tricycles (Keke Napep) to the underprivileged in Katsina and Kebbi states – N100 million; supply of 1 unit of Lexus 600 VIP 2023 Model Y – N250 million; supply of 1 unit of Lexus L600 VIP 2023 Model Y – N250 million; supply of 1 unit of Lexus 600 VIP 2023 Model X – N250 million and model T – N250 million.\n“Akpabio and Adeola Yayi inserted over N200 billion into Tinubu’s palliative budget.\nThey padded in more than N200 billion in the amended 2022 supplementary budget,” one of the sources in the Senate had told SaharaReporters."
    },
    {
        "url": "https://saharareporters.com/2023/02/01/nigerian-first-lady-aisha-buhari-reposts-governor-el-rufais-interview-saying-certain",
        "summary": "Nigeria’s First Lady, Aisha Buhari, has reposted Governor Nasir El-Rufai’s interview with Channels TV where he said that some persons in Aso Villa (Presidential Villa) are working against the presidential candidate of the ruling All Progressives Congress (APC), Bola Tinubu.\nAisha Buhari reposted the interview that the Kaduna State governor had on Channels TV’s Sunrise Daily programme on Wednesday morning on her Instagram page with the hashtag, “# longlivefederalrepublicofniger ia (Long live Federal Republic of Nigeria).\nSaharaReporters earlier reported that Governor El-Rufai alleged that some persons (elements) within the State House are working against Tinubu, the presidential candidate of the ruling party ahead of the February election.\nEl-Rufai did not reveal the identities of the persons involved but said they were aggrieved that Tinubu defeated their candidate in the APC presidential primary election.\nHe also alleged that the protracted fuel scarcity and the naira redesign by the Buhari government were targeted at him."
    },
    {
        "url": "https://saharareporters.com/2023/02/01/some-persons-aso-rock-are-working-against-tinubu-trying-make-apc-lose-forthcoming",
        "summary": "Governor Nasir El-Rufai of Kaduna State has alleged that in the forthcoming general elections, some persons (elements) within the Aso Rock are working against the presidential candidate of the ruling All Progressives Congress (APC), Bola Tinubu.\n“They are trying to get us to lose the election, and they are hiding behind the president’s desire to do what he thinks is right.\nBecause how can you have a capital budget of N200billion for federal roads and then spend N2trillion on petroleum subsidy?\n“The second example I will give is this currency redesign.\nPeople are blaming the Governor of the Central Bank for the currency redesign, but No."
    },
    {
        "url": "https://saharareporters.com/2023/08/14/i-thought-tinubu-understood-economics-ive-realised-hes-just-bookkeeper-pdp-chieftain",
        "summary": "Pearse who spoke while featuring on a Channels TV programme, on Monday, said Nigerians desire to know the actual landing cost of Premium Motor Spirit (PMS) popularly known as petrol.\nHow do we get the price of oil to the point where it is affordable and will not destroy the economy?\nEvidently, he (President Tinubu) doesn't know it and he is not listening to advice because what is going on now is a disaster.\"\n“When you go to the NNPCL, you find out that the landing cost is so low to the price that is given.\nSaharaReporters had reported that President Tinubu in his inaugural address on May 29, 2023, declared that fuel subsidy is gone."
    },
    {
        "url": "https://saharareporters.com/2023/07/14/exclusive-senate-president-akpabio-others-pad-president-tinubus-palliative-budget-over",
        "summary": "Senate President Godswill Akpabio and some of his colleagues have used the amendment of the 2022 Supplementary Appropriation Act as an opportunity to pad the budget by over N200 billion.\nBudget padding is making the budget larger than the original estimates by inflating the value of items or introducing new items into the budget.\nThe N500 billion will be taken from the N819 billion Supplementary Appropriation Act.\n“Akpabio and Adeola Yayi inserted over N200 billion into Tinubu’s palliative budget.\nThey padded in more than N200 billion in the amended 2022 supplementary budget,” one of the sources in the Senate told SaharaReporters."
    },
    {
        "url": "https://saharareporters.com/2023/08/28/breaking-bayelsa-residents-invade-warehouse-housing-palliatives-amid-hardship-nigeria",
        "summary": "Some residents broke into a warehouse where palliatives were kept by the Bayelsa State government in Yenagoa on Sunday.\nThe subsidy removal moved up the prices of petrol from around N190 to about N620 per litre and this has adversely affected the prices of goods and services.\nSaharaReporters learnt that some of the food items have expired.\nFor instance, at least four persons were reportedly killed when angry residents stormed a warehouse located along the Murtala Muhammed Way, close to Kpata market in October 2020.\nSimilarly, during the pandemic, angry youths in Osun stormed a warehouse in Ede town, where COVID-19 palliatives were allegedly stored and carted away food items."
    },
    {
        "url": "https://saharareporters.com/2023/07/01/nigerians-lament-scarcity-tomatoes-pepper-across-markets-sellers-blame-fuel-prices",
        "summary": "There is anxiety in markets across the country as Nigerians have decried the worsening scarcity of tomatoes and peppers, with consumers and sellers adducing different reasons for the scarcity.\nWhile traders lament low patronage, consumers lament the scarcity and high prices.\nA trader, Abdullahi Musa, who sells tomatoes and pepper in baskets in the market, said, “It is not our fault that tomatoes are expensive now.\n“The rainy season has caused us great losses as harvested tomatoes and pepper perish once they come in contact with water.\nA crate of tomatoes sold for N24,000 as against the initial N7,000, while a paint bucket size had risen to N4,500 from N1,000."
    },
    {
        "url": "https://saharareporters.com/2023/08/02/protest-under-buhari-was-taboo-northern-nigeria-kano-residents-out-under-tinubu-says",
        "summary": "A former lawmaker representing Kaduna Central Senatorial District, Shehu Sani has slammed protesters in northern Nigeria over the fuel subsidy removal and alleged anti-poor policies of President Bola Tinubu-led federal government.\nSenator Sani who took to his Twitter handle to discuss the protest in Kano State, recalled how protests in the north under President Muhammadu Buhari regime was perceived as a taboo because he was seen as \"our own\".\nReacting in a tweet posted on his Twitter handle, Senator Sani, a critic of the former president, wrote: \"Under Buhari, protest was a taboo in the North because “he is our own”.\n\"Subsidy and EndSARS protest was violently countered by sponsored Thugs.\nNow I saw protesters with placards in Kano.\""
    },
    {
        "url": "https://saharareporters.com/2023/08/02/president-tinubus-palliative-fraud-we-must-not-allow-it-edo-governor-obaseki-backs",
        "summary": "The Edo State Governor, Godwin Obaseki, has asked the organised labour – the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC) – to reject the palliatives being proposed by President Bola Tinubu-led Nigerian government.\nWe must stop this palliative fraud of the federal government.\nI want to call on the labour.\nThe protesters who expressed displeasure with the hardship and cost of living inflicted on Nigerians by Tinubu's administration, called on the federal government to as a matter of urgency and importance reverse the subsidy removal and address the lingering hardship and suffering of Nigerians.\nThe protesters also called on President Tinubu to introduce new policies with a human face and shun policies that will continue to make the rich richer and the poor poorer."
    },
    {
        "url": "https://saharareporters.com/2023/07/29/socialist-movement-dsm-backs-nigeria-labour-congress-nationwide-strike-against-president",
        "summary": "Pro-democracy group, the Democratic Socialist Movement (DSM) has expressed support for the Nigeria Labour Congress (NLC) on the declared nationwide industrial action against President Bola Tinubu’s anti-poor and anti-worker policies.\nAlmost two months, President Bola Tinubu, had on his May 29 inaugural address, declared that “fuel subsidy is gone”.\nThe NLC president argues that the imminent industrial action is to reduce the impact the government’s policies have had on the people at large.\nIt warned organised labour against yielding to government blackmail and suspending industrial action, while calling for mass mobilisation to ensure that the desired effect of the strike was achieved.\nThe negotiation was meant to keep labour busy while they continue to impose their neoliberal policies without a challenge!"
    },
    {
        "url": "https://saharareporters.com/2023/06/15/president-tinubu-inaugurates-national-economic-council",
        "summary": "Nigerian President, Bola Tinubu on Thursday inaugurated the National Economic Council.\nRecall that in order to mitigate the impact of subsidy removal on Nigerians, President Tinubu directed NEC to begin the process of providing palliatives.\nTinubu during his inaugural speech on May 29 at the Eagle Square in Abuja announced the removal of subsidy payment on petrol.\nDue to this announcement, Nigerian National Petroleum Company Limited adjusted the pump price to reflect the current international price.\nThe president has therefore saddled the newly inaugurated NEC with the responsibility of ensuring the management of the economic crisis rocking the most populous African nation."
    },
    {
        "url": "https://saharareporters.com/2023/08/29/wake-reality-nigeria-poor-country-governor-soludo-tells-nigerians",
        "summary": "The Anambra State Governor, Chukwuma Soludo, has said that it is high time Nigerians and their leaders woke up to the reality that Nigeria is a poor country.\nSoludo, who commended President Tinubu for the fuel subsidy removal described the move as necessary, saying it has the potential to re-engineer the nation’s economy.\n“It’s high time the country woke up to the reality that it is a poor country and began to live within its means.\n“Starting from those in leadership, there was a need to begin to live and demonstrate to the people that Nigeria is a poor country.\n“The reality of the subsidy removal affected everybody, not just civil servants."
    },
    {
        "url": "https://saharareporters.com/2023/06/01/breaking-protest-rocks-edo-state-activities-disrupted-over-outrageous-prices-petrol",
        "summary": "Economic and social activities are reportedly paralysed in Benin City, Edo State capital as hundreds of residents on Thursday morning stormed the streets of the ancient city, protesting the Federal Government’s removal of fuel subsidy.\nThe placards carrying protesters who are marching through major streets have called on the federal government to immediately reverse the pump price to N210 till July 2023.\nThey insisted that if petrol subsidy should be removed, the government should fix the four Nigerian refineries to start refining petrol for domestic consumption.\nSome of the he placards read: \"We can't buy petrol at N520 but N210\".\nAccording to the released price list, the new pump price for premium motor spirit (PMS), ranges from N488 in Lagos State to N557 per litre in Yobe and Borno states, while it is N537 in Abuja and Enugu N520."
    },
    {
        "url": "https://saharareporters.com/2023/06/15/governor-oborevwori-probe-pension-board-delta-warns-council-chairpersons-against",
        "summary": "Delta State Governor, Sheriff Oborevwori has revealed that plans had been concluded to audit the state pension board so as to know the persons who are due for such monies.\nOborevwori on Wednesday stated that he will not fold his arms and watch pension funds being misappropriated.\nHe warned chairmen of the 25 local government areas in the state against any act of corruption and reckless spending of resources.\nIt is our hope that with the removal of the fuel subsidy, more monies will be accrued to the local governments and states.\nIn this regard, we shall be collaborating with the Local Government Pension Bureau, to see how the lingering pension issues will be resolved,\" he added."
    },
    {
        "url": "https://saharareporters.com/2023/02/01/buhari-government-not-officially-aware-anyone-working-against-tinubu-information",
        "summary": "Nigerian Government has said it is not aware of any persons in the Presidential Villa working against the ambition of the ruling All Progressives Congress candidate in the February presidential election, Bola Tinubu.\nKaduna Governor, Nasir El-Rufai had said some saboteurs in Aso Villa were working against Tinubu because their candidate did not win the party presidential primaries.\nHowever, Mohammed said President Muhammadu Buhari was committed to ensuring free and fair general elections, saying the government does not know officially if anyone in the Presidential Villa is working against Tinubu.\n“If there’s anybody who is working against any candidate, we don’t know officially,” the information minister said.\nPeople are blaming the Governor of the Central Bank for the currency redesign, but No."
    },
    {
        "url": "https://saharareporters.com/2023/07/30/goodbye-subsidies-gari-ponmo-iru-ogiri-beef-goat-meat-chicken-and-turkey-bayo-oluwasanmi",
        "summary": "For the past 62 years of Nigeria as an independent country, the government has been generous and kind enough to subsidize gari, ponmo, iru, ogiri, beef, goat meat, dog meat, chicken, fish, turkey, pepper, and palm oil.\nIf there's one type of person you don't want to trust, it's a grifter: someone who cheats others out of money.\nAs a government of the people, by the people, and for the people, we must listen to Nigerians.\nFrom today all subsidies real and imagined, spiritual and physical, political and economic, necessary and unnecessary, practical and essential on gari, ponmo, iru, ogiri, beef, goat meat, dog meat, chicken, fish, turkey, yam, pepper, onion, and palm oil have been removed for good.\nIf they could survive the Buhari-Emefiele manufactured cash crunch, definitely they’ll survive without subsidies."
    },
    {
        "url": "https://saharareporters.com/2023/05/02/gani-fawehinmi-organisation-demands-n100000-new-minimum-wage-nigerian-workers",
        "summary": "The Gani Fawehinmi Memorial Organisation (Gafamorg) has called on the Nigerian government to the review the terrible conditions of the Nigerian workers and increase its minimum wage from current meagre N30,000 to N100,000.\nGafamorg made the demand in a goodwill massage to Nigerian workers during the event of International Workers Day celebration on Monday, while felicitating with workers for the immense contributions of their labour and service towards the economic engineering, growth and progress of Nigeria.\nThe organisation demanded, \"the immediate review of the minimum wage from the paltry sum of N30,000 and increase to a better living minimum wage of N100,000 with matching increases to the rates of inflation.\n\"A call for a probe of the payment of oil subsidy to corrupt beneficiaries under the past governments and the present one.\n\"No to removal of fuel subsidy but an end to corruption."
    },
    {
        "url": "https://saharareporters.com/2023/08/04/nigerian-students-body-nans-asks-universities-reverse-alarming-school-fees-mobilises",
        "summary": "The National Association of Nigerian Students (NANS), has called on the authorities of affected universities to reverse immediately all increments in school fees, while urging institutions considering such option to shelve it.\nThe umbrella body of Nigerian students warned that any university that failed to comply with the directive of the Federal Government on the fee increment should be ready for nationwide confrontation from Nigerian students.\nNANS gave the warning in a statement issued on Friday, which was signed by its National Public Relations Officer, Giwa Yisa Temitope.\n\"Needless to say, the recent removal of subsidy on fuel has brought untold hardship on our parents.\nSimilar meetings are being held with the management of other tertiary institutions including Obafemi Awolowo University, University of Benin, and University of Ibadan, among others.”"
    },
    {
        "url": "https://saharareporters.com/2023/07/22/tinubu-lazy-leader-just-other-presidents-him-resist-suffering-aac-tells-nigerians",
        "summary": "The African Action Congress (AAC) has called on Nigerians to rise and resist the suffering meted out to them by President Bola Tinubu's government for no justifiable or special reasons.\nOni said, “Nigerians are not suffering for any special reasons or courses but for our consistent rule by terrible leaders.\n“Tinubu like Buhari is just an old terrible analog thinking entitled tyrant who is from the South.\n“Except Nigerians resist, they will continue to suffer.\n“Nigerians rise up and fight.”"
    },
    {
        "url": "https://saharareporters.com/2023/05/26/our-starting-point-may-not-be-rosy-neither-tinubu-nor-i-have-doctorate-degree-vice",
        "summary": "The Vice President-elect, Kashim Shettima, has said that the incoming administration led by Bola Tinubu might not have a rosy starting point.\nShettima made this assertion in the address he delivered on Friday at the 2023 Presidential Inauguration Public Lecture at the National Mosque, Abuja.\nHe said; “The starting point might not be rosy, let me be very honest with you.\nBut rest assured that in the fullness of time, Nigerians will come to pay glowing tributes to Bola Tinubu.\nNeither Kashim Shettima nor Asiwaju Bola Ahmed Tinubu holds any Ph.D. degree."
    },
    {
        "url": "https://saharareporters.com/2023/09/05/kayode-fayemi-ekiti-failure-and-june-12-double-agent-cannot-discredit-history-2012",
        "summary": "The protests were engineered nationwide by the Joint Action Front (JAF) and the United Action For Democracy (UAD).\nWhile it was the Joint Action Front (JAF) that kicked off the initiative of an Occupy Nigeria convergence at Ojota, through celebrities; the Occupy Nigeria Movement took it over.\nAt the last elections, many celebrities who didn't even appear more than once or twice at the EndSARS protests are supporting Labour Party of Peter Obi.\nMass protests like Anti-SAP, June 12 Revolts, Occupy Nigeria, EndSARS were led and mobilized for by Leftists and Revolutionaries.\nFayemi cannot write the history of Occupy Nigeria of 2012."
    },
    {
        "url": "https://saharareporters.com/2023/05/26/pms-price-goes-tinubu-goes-down-omole-ibukun",
        "summary": "I have been hearing about this fuel subsidy and fuel price increment since I was born.\nThis price increment policy is what our 'economists' have always hidden under the fuel subsidy removal policy.\nThe only solution to this is to demonstrate the power of protest that Tinubu is already afraid of.\nThe solution to our fuel subsidy troubles does not lie in the pockets of billionaires but in our collective effort to build a better society.\nLet us use that superpower that Tinubu did not know to send back an equal message of threat - PMS PRICE GOES UP, TINUBU GOES DOWN!"
    },
    {
        "url": "https://saharareporters.com/2023/06/18/tinubu-strategic-moves-or-shooting-hip-dr-malcolm-fabiyi",
        "summary": "Between signing bills, Mr. Tinubu made time to authorize the suspension of Godwin Emefiele the CBN governor and Rasheed Baw, the EFCC Chairman.\nA more apt assessment should be that Mr. Tinubu is enjoying good will from the Nigerian people.\nThe 2012 fuel subsidy removal protests which incidentally then opposition politician Tinubu supported was organized primarily by a coalition of civil society organizations.\nSuch loose, less centralized, issues-based movements are the best way to neutralize the paralyzing effects of dealing with wheeler dealer presidents like Mr. Tinubu.\nA word of caution to Mr. Tinubu and his praise singers: quiet streets do not always mean people are happy."
    },
    {
        "url": "https://saharareporters.com/2023/08/02/workers-traders-youths-protest-delta-imo-condemn-tinubu-governments-policies",
        "summary": "The protest led to gridlock on major roads and streets in Asaba.\nThe protesters also called on President Tinubu to introduce new policies with a human face and shun policies that will continue to make the rich richer and the poor poorer.\nSaharaReporters observed that the police and other security agencies were fully on the ground to maintain law and order.\nSimilarly, protesters marched to the Government House in Owerri, the Imo State capital with placards showing their displeasure with the situation in the country.\nAda Echebime, the NLC chairperson in the state, urged the government to reverse the removal of fuel subsidy."
    },
    {
        "url": "https://saharareporters.com/2023/08/02/tinubus-speech-hope-or-hoax-dr-nasiru-aminu",
        "summary": "Tinubu announced a change of plans for the approved N500 billion to be given to 12 million poor households in the country.\nHowever, this leaves the poor shortchanged if you recall that the 12 million poor households were expected to get N48,000 in six months.\nOne does not need to be a rocket scientist to know who benefits from fuel subsidy.\nIf you want to know those who directly or indirectly benefit from the fuel subsidy policy, you should look at those suffering in the country now.\nNonetheless, as done by some public speakers, there is nothing wrong with being optimistic about Tinubu's speech."
    },
    {
        "url": "https://saharareporters.com/2023/05/25/dangote-refinery-does-seriki-integrity-have-shame-all-adeola-soetan",
        "summary": "What will be going on in the mind of Seriki Integrity, if he has shame, as he inaugurates the Dangote refinery today after his own failed promises to repair old & build new refineries?\nMr Buhari called for a reduction in the prices of petroleum products amidst efforts by the Goodluck Jonathan government to deregulate prices and end subsidy payments.\n“The countless man hours that will be spent at petrol stations today, will reduce our productivity as a nation.\nThis should not be so,” Mr Buhari said.\nBut over the last several years our refineries have declined, and we are at the mercy of imports.”Adeola Soetan"
    },
    {
        "url": "https://saharareporters.com/2023/08/03/both-nigerian-government-private-sector-should-work-new-minimum-wage-cushion-hardship",
        "summary": "The coalition expressed deep concerns over government’s initiatives to urgently cushion the harsh economic and social effect of the subsidy removal policy on the citizens.\nWhile lamenting that the current national minimum wage of N30,000 remains highly unsustainable considering the current economic condition, they recommended that a process for increasing the minimum wage should commence immediately at the federal, state, and local levels and by private sector employers as the current minimum wage no longer reflected the new realities.\nThe CSO Leaders noted that social protection policies implementation combined with enlightened leadership and pressure from below had the capacity to lift people out of poverty.\nChina and India for instance lifted 730 million and 170 million people respectively out of poverty between 1990 and 2015.\nZ. Ya’U of CITAD; Udy Akpan of YAF; Emem Okon of KEBETKACHE; Faith Nwadishi of CTA; EgedegbeEdeworof VREI; Idris Miliki of CHRCR and ObialunanmaNnaobi-Ayodele of Meluibe Foundation."
    },
    {
        "url": "https://saharareporters.com/2023/08/20/tinubunomics-cruel-and-unusual-punishment-killing-our-people-prof-usman-yusuf",
        "summary": "There is a real concern that President Tinubu’s government will be run by a shadowy few with his cabinet having little or no input in the formulation of important policy matters.\nThis singular policy action has exposed either President Tinubu’s inexperience at the national stage or crass arrogance or both.\nThe World Bank representative was effusive in praising President Tinubu’s economic policy describing it as being bold and timely.\nThis policy is nothing but a cocktail of impulsiveness, chaos, hubris, and incompetence which has negatively impacted the lives of all Nigerians.\nIt does not seem like these leaders care about the pains they have inflicted on the citizenry these two months."
    },
    {
        "url": "https://saharareporters.com/2023/08/11/tinubu-implemented-toxic-economic-policies-within-two-months-nigerian-president-group",
        "summary": "A pro-democracy civil society organisation, Global Integrity Crusade Network (GICN), has said that President Bola Tinubu implemented toxic economic policies within two months as Nigerian President.\nHe noted that Nigerians were deceived that the removal of fuel subsidy will promote competition and efficiency in the oil sector and drop prices naturally.\nIt continued, \"On his part, President Bola Ahmed Tinubu has within barely two months of grabbing the mantle of leadership implemented what we consider as “toxic economic policies” that have adversely affected the already impoverished masses.\n\"One of such toxic policies is the total removal of fuel subsidy by Mr. President on 29th May, 2023 during his inaugural speech without first providing the necessary palliatives.\nIf the President wanted to provide palliatives for the so-called “poor households” he should have done so before removing the fuel subsidy."
    },
    {
        "url": "https://saharareporters.com/2023/07/31/full-text-president-tinubus-nationwide-address-ahead-looming-national-strike",
        "summary": "Such a vast sum of money would have been better spent on public transportation, healthcare, schools, housing and even national security.\nIt diverted money that should have been used to create jobs, build factories and businesses for millions of people.\nI had promised to reform the economy for the long-term good by fighting the major imbalances that had plagued our economy.\nThus, the defects in our economy immensely profited a tiny elite, the elite of the elite you might call them.\nWith the fund, our states will become more competitive and on a stronger financial footing to deliver economic prosperity to Nigerians."
    },
    {
        "url": "https://saharareporters.com/2023/07/01/going-his-policies-buhari-never-wanted-tinubu-win-presidential-election-coalition",
        "summary": "The Coalition of Northern Groups has disagreed with a claim by former President Muhammadu Buhari’s spokesperson, Garba Shehu, that his principal (Buhari) wanted Bola Tinubu to emerge as Nigerian president and therefore, slowed down on the announcement of the fuel subsidy removal.\nThe CNG on Saturday noted that Buhari and his cabinet going by all his last-minute policies did not want Tinubu to win Nigerian presidency, and his (Buhari’s) to announce the fuel subsidy removal was rather out of “indecisions” rather than the Tinubu factor.\nSaharaReporters had during the week reported that Buhari's Senior Special Adviser on Media and Publicity, Garba Shehu, stated that Buhari “helped” Tinubu to win the presidential election by not announcing the fuel subsidy removal.\nThe Buhari administration in its last days could not have gone the whole way because the APC had an election to win.\n“We however disagree slightly with Buhari because everyone is aware by now that he never wanted Tinubu to win, and never worked for his victory."
    },
    {
        "url": "https://saharareporters.com/2023/05/30/president-tinubu-resumes-duties-aso-rock-villa-received-mele-kyari-central-bank-governor",
        "summary": "The newly inaugurated Nigerian President, Bola Tinubu has resumed his official duties at the Presidential Villa on Tuesday, to commence his four years term in office as the Commander-In-Chief.\nWhen President Tinubu arrived at the VIlla, he momentarily paused at the gate to observe a guard of honour, adding a touch of formality to the significant occasion.\nBut Tinubu’s administration began on a rather shaky and unpopular note on Monday after he declared that fuel subsidy would be removed by his administration.\nSaharaReporters had reported that some civil society organisations called on Nigerians to reject the fuel subsidy removal by the new administration of Tinubu, as angry reactions continued to trail his declaration on Monday.\nIn some hinterlands, pump prices were also adjusted from N280 previously sold to now N360 and above per litre."
    },
    {
        "url": "https://saharareporters.com/2023/07/28/president-tinubus-delegation-taking-us-small-children-nigerian-workers-nlc-leaders-storm",
        "summary": "The Steering Committee was set up by the government to come up with palliatives that would cushion the effect of fuel subsidy removal on the workers.\nBut the meeting could not proceed because according to some members of the Steering Committee, there was no quorum.\nSpeaking with Vanguard, a member of the Steering Committee from labour said, “They are not prepared for the meeting.\nFemi Gbajabiamila had earlier waited for the labour delegation with other members of the team at his Conference Hall.\nInformation has it that the names of the labour delegation were not sent to the gate for clearance which led to their delay for the meeting."
    },
    {
        "url": "https://saharareporters.com/2023/08/25/governor-obaseki-attacks-tinubu-govt-divert-attention-his-poor-performance-edo",
        "summary": "“Governor Obaseki has, in recent times, shifted focus to the nation's economic challenges as cannon fodder to divert attention from his poor performance at the state level since his move to the Peoples Democratic Party.\nRather than delving into narratives which do not provide the complete picture, the focus should be on how the Edo State Government will be using available resources to drive impactful projects that genuinely uplift the people of Edo State.\nThis vision is consistently echoed within the National Economic Council, where significant economic decisions are made.\nWe are still at a loss on what could be the trigger for Governor Obaseki to issue such blatantly false accusations against the Federal Government.\nIt would be helpful if Governor Obaseki participated in these meetings to provide insights and align with the collective vision."
    },
    {
        "url": "https://saharareporters.com/2023/08/28/no-one-should-consume-looted-palliatives-they-are-expired-food-items-bayelsa-government",
        "summary": "SaharaReporters had reported how some residents broke into a warehouse where palliatives were kept by the Bayelsa State government in Yenagoa on Sunday.\n\"During the 2022 flood in the state, the Agency used the warehouse to store food items.\nFor emphasis, BYSEMA states that these items were not fresh food palliatives and were not hoarded by the Agency or the state government.\n\"In essence, there were really no food items to loot.\nSo, those who carted away the unfit items are please advised in their own interest not to consume them."
    },
    {
        "url": "https://saharareporters.com/2023/02/24/why-sowore-she-asked-adeola-soetan",
        "summary": "Even candidate Buhari himself in 2015 said correctly that there's no oil subsidy, he described it as fraud.\nThe first major protest I participated as a student activist in Great Ife was against the so-called \"oil subsidy\" removal in 1988 during Babangida regime.\nAnd since then every succesive looting government has been talking of oil subsidy removal to punish the people as stealing and inefficiency continues in government.\nShe interjected: Sho you don't know politics.\nSo you don't know that great politicians like Awolowo, Olufunmilayo Ransome Kuti, Margaret Ekpo, Mallam Aminu Kano, Nelson Mandela, Nnamdi Azikwe were activists and politicians."
    },
    {
        "url": "https://saharareporters.com/2023/06/05/nigerian-government-again-meets-labour-union-nlc-leaders-presidential-villa-ahead",
        "summary": "The Nigerian government delegation has again summoned the leadership of the Nigeria Labour Congress, NLC to a meeting at the Presidential Villa Abuja over the grievances emanating from the fuel subsidy removal.\nThe NLC, led by its President, Comrade Joe Ajaero, arrived at the Presidential Villa at about 5:45 pm on Monday.\nMeanwhile, according to the communiqué signed by NLC President, Comrade Joe Ajaero, and the General Secretary, Comrade Emmanuel Ugboaja, and obtained by SaharaReporters, the NLC listed out reasons why the nationwide action must hold.\nThat it was unlawful for the federal government to have announced the withdrawal of the Subsidy on PMS.\nThat discussions were already on and understanding reached with government on the conditions precedent before the withdrawal of subsidy on PMS."
    },
    {
        "url": "https://saharareporters.com/2023/07/02/braggadocio-wrong-policy-implementation-style-leaders-adeola-soetan",
        "summary": "Now oil price is N500 or more per litre under his government, the same N500/litre he thought in Abeokuta would be a punishment for the people.\nThe same so-called oil subsidy that Buhari Seriki Integrity and others before him continued to remove to no end.\nNow the unprecedented fuel price hike has triggered unmanageable and uncontrollable chains of economic backlash and immediate adverse market reactions thereby putting people on the fringe with further mass poverty, hunger and anger.\nThe puerile argument that the Seriki Integrity regime didn't budget for oil subsidy beyond June didn't hold water.\nSo why did Tinubu who know subsidy removal was not in his official speech announce extempore the removal just like that?"
    },
    {
        "url": "https://saharareporters.com/2023/07/19/1000-ghana-cedis-now-change-n70500-have-some-shame-tinubu-elias-ozikpu",
        "summary": "Nigeria is an oil-producing nation yet citizens of the country have no right to enjoy the benefits of that oil?\nMost currencies across Africa now have much value than the Nigerian Naira.\nBy this official rate, 1000 Cedis would change for ₦75,000 whilst 100,000 Cedis would change for ₦7,500,000 [Seven Million, Five Thousand Naira].\nThe alarming thing about this is that the Nigerian Naira loses value almost every hour.\nAlthough Tinubu may be a man without the slightest traces of competence, I do not expect him to be immune to shame!"
    },
    {
        "url": "https://saharareporters.com/2023/07/31/let-poor-nigerians-revolt-they-wont-let-them-breathe-sowore-charges-amid-hardship",
        "summary": "Omoyele Sowore, the candidate of the African Action Congress in the 2023 presidential election on Monday said poor Nigerians should be allowed to revolt since they won't be allowed to breathe.\nThis comes amid the rising inflation and hardship in the country following the removal of subsidy on premium motor spirit, otherwise known as petrol.\n\"Let the poor revolt, since they won’t let them breathe!\"\n“The prayer is that, let the poor breathe, and Senator Mustapha has seconded that the poor should breathe.\nHe announced plans by the APC governors to meet with President Tinubu-led government to seek a quick solution to the hardship Nigerians are going through."
    },
    {
        "url": "https://saharareporters.com/2023/06/05/court-restrains-nigerian-workers-nlc-going-strike-fixes-june-19-hearing-suit-filed",
        "summary": "The government had taken the NLC and the TUC to court, praying for an order to stop the planned nationwide strike.\nSaharaReporters had reported that the Nigerian Labour Congress had released its communiqué on Friday confirming the nationwide strike by next week Wednesday to protest against the fuel subsidy removal.\nThis comes amid fuel shortages across the country occasioned by President Bola Tinubu’s inaugural speech in which he declared that “fuel subsidy is gone”.\nThat it was unlawful for the federal government to have announced the withdrawal of the Subsidy on PMS.\nThat discussions were already on and understanding reached with government on the conditions precedent before the withdrawal of subsidy on PMS."
    },
    {
        "url": "https://saharareporters.com/2023/05/30/petrol-prices-jump-n350-litre-queues-increase-lagos-abuja-other-nigerian-cities",
        "summary": "Following the sharp hike in pump price, commercial transporters have also hiked their trip fares across the country in response to the developments.\nIn some hinterlands, pump price has now been adjusted from N280 to N350, N360 per litre.\nMeanwhile, commuters were seen stranded at various bus stops waiting to board commercial bus which may have been trapped in the frenzy that greeted the petrol subsidy removal.\n“I have been at the fuel station for over an hour, and am yet to get to the fuel pump point.\nMeanwhile, most stakeholders who spoke on the development believed that the subsidy removal was a right step."
    },
    {
        "url": "https://saharareporters.com/2023/06/01/group-urges-nigerian-labour-congresses-nlc-tuc-declare-nationwide-strike-protest-over",
        "summary": "A group, Joint Action Front (JAF) has called on the Nigeria Labour Congress (NLC) and Trade Union Congress of Nigeria (TUC) to declare a nationwide strike and protest over recent hikes in petrol prices occasioned by subsidy removal.\nThe group advised the masses not to be deceived by the claim that the removal of the petrol subsidy will make more money available for education and infrastructure.\n\"Already the hike in petrol prices has compounded the pre-existing economic hardship which itself was a result of the capitalist policies of the APC government.\nThe already excruciatingly high cost of living and the high inflation which is at present over 22 percent will be worsened.\n\"We call on the masses not to be deceived by the claim that the removal of the so-called petrol subsidy will make more money available for education and infrastructure."
    },
    {
        "url": "https://saharareporters.com/2023/08/01/workers-and-youth-group-backs-nationwide-protest-says-clueless-tinubu-government-has",
        "summary": "According to the group, the protest is in the interest of the poor Nigerians, whom the policies of President Tinubu's government have rendered poorer.\nThe group asked the organised labour to also use the protest and industrial action to demand the implementation of N200,000 minimum wage.\nThe group described the fuel subsidy removal as ill-conceived and premature.\nIt said the government should have fixed the country's four refineries before embarking on fuel subsidy removal.\n\"Another evidence of the inefficiencies of the lackluster BAT government is the inability to come up with a plan to cushion the effect of subsidy removal."
    },
    {
        "url": "https://saharareporters.com/2023/06/01/tinubu-biting-bullet-day-one-azu-ishiekwene",
        "summary": "President Bola Ahmed Tinubu is under fire for announcing that petrol subsidy is gone from day one.\nOf all these, however, the one that got the headlines was petrol subsidy and the most frequently expressed concern, is why now?\nFor a man who has his work cut out for him, Tinubu does not have the luxury of philosophy or poetry.\nNot when organised criminals trading on a yearly petrol subsidy of about N4.4trillion as of 2022, have left the country bleeding nearly to death.\nPetrol subsidy is gone, means petrol subsidy is gone."
    },
    {
        "url": "https://saharareporters.com/2023/08/22/restore-fuel-subsidy-instead-wasting-money-war-niger-group-tells-nigerian-leader-tinubu",
        "summary": "The group asserted that the imposition of economic sanctions on Niger Republic is evidence that Nigerian President, Bola Tinubu and ECOWAS leaders do not care about the ordinary people of Niger who are the worst hit.\n\"We call on trade unions, working people and youth in Nigeria and West Africa to reject the planned war and the economic sanctions with a series of mass actions.\n\"The working masses and youth should demand, instead of wasting Nigeria’s resources on war against Niger, the Tinubu government should restore subsidy and reverse the petrol price to the old rate of N195 per liter.\n\"The imposition of the economic sanctions is evidence that Tinubu and ECOWAS leaders do not care about the ordinary people of Niger who are the worst hit.\n\"We, therefore, support the growing mass protest and rejection of French imperialism in Niger and other West African countries."
    },
    {
        "url": "https://saharareporters.com/2023/07/06/fuel-subsidy-nigerian-labour-congress-knocks-tinubu-shunning-dialogue-taking-decisions",
        "summary": "According to NLC, impoverishing workers and pushing millions more into hellish living does not, in any way, approximate sound economic management.\n“That, clearly shows that the Nigerian State from all corners is clearly at war with the people and workers.\n“Nigerian workers and masses cannot continue bearing the brunt of ill-conceived policies and outright fantasies of our leaders.\nThe continued sacrifice of poor Nigerian workers so that the rich can continue in their unbridled pleasures is beginning to push events to the edge.\n”The Nigeria Labour Congress, NLC, can halt this manifest mischief."
    },
    {
        "url": "https://saharareporters.com/2023/07/08/president-tinubu-will-move-mistake-mistake-until-nigerians-join-hands-push-him-out",
        "summary": "Sowore said the hardship and sufferings Nigerians are going through as a result of the sudden fuel subsidy removal might force the people into civil unrest.\nHe said the situation in the country was such that Tinubu would move from mistake to mistake until people would join hands and arise for a revolutionary Nigeria.\nHe would be moving from mistakes to mistakes to the point that people will have no option than to join hands and push all of them out.\nNothing has changed in Nigeria since they removed subsidy.\nHe is always oil company executives from abroad as if Nigeria is not for Nigerians,” Sowore added."
    },
    {
        "url": "https://saharareporters.com/2023/07/02/heda-asks-nigerias-central-bank-obey-court-disclosing-details-foreign-exchange-subsidy",
        "summary": "An order of Mandamus was granted, compelling the Central Bank to release specific information requested through their Freedom of Information (FoI) application submitted on October 14, 2020.\nThe group claims that the Central Bank had not yet complied with the court's order to release the requested information.\nTo date, the Central Bank of Nigeria has not issued an official response to the demands made by HEDA Resource Centre.\nHowever, should the Central Bank continue to defy the court's ruling, the anti-corruption has stated its intention to initiate contempt proceedings against the apex bank.\nSaharaReporters on October 17, 2019, reported that Nigeria's apex bank had refused to disclose data on beneficiaries of exchange rate differential."
    },
    {
        "url": "https://saharareporters.com/2023/06/03/fuel-subsidy-independent-marketers-ipman-rejects-pump-prices-fixed-nnpcl",
        "summary": "The Independent Petroleum Marketers Association of Nigeria (IPMAN), has rejected the fuel pump prices fixed by the Nigerian National Petroleum Company Limited (NNPCL) saying that the company could not regulate the price of fuel in the country.\nAnyaso said that “NNPCL is a private company.\nHowever, he condemned filling station owners who were selling fuel at the price as high as N600 per litre, saying it was exploitative.\nHe therefore called on the Nigerian government to issue licences to more importers and allow them to bring in Premium Motor Spirit (PMS) and other petroleum products into the country.\nAnyaso said that only competitive pricing would address the current problem of PMS and other petroleum products."
    },
    {
        "url": "https://saharareporters.com/2023/06/03/fuel-subsidy-i-inherited-liabilities-assets-buhari-i-havent-removed-any-budget-any-penny",
        "summary": "President Bola Tinubu has said that he inherited both liabilities and assets from his predecessor, Muhammadu Buhari, adding that no budget or penny has been removed by his government.\nThe President also told the governors that the government must make decisions that affect all Nigerians.\nOn the issue of leadership of the National Assembly, Tinubu asked the governors to set up a committee to meet with the Senate President.\n\"The situation that we have seen is one, I inherited, and it is fundamental, I inherited assets and liabilities of my predecessor.\nWe must strengthen the sources and application of those sources."
    },
    {
        "url": "https://saharareporters.com/2023/06/02/fuel-subsidy-removal-kano-governor-directs-petrol-stations-revert-old-pump-price",
        "summary": "Kano State Governor Abba Yusuf has asked petroleum marketers to revert to the old petrol pump price to ameliorate the hardship experienced by Kano residents.\nHe described the recent hikes in the prices of premium motor spirit, also known as petrol, as unjustified.\nThis is contained in a statement by his press secretary, Bature Dawakin-Tofa, on Thursday, NAN reports.\nHe said, “To reduce the needless hardship on the state’s citizens, the marketers should exercise some restraint and quickly reopen all filling stations with available products in stock to sell at the former price.”“As a concerned governor, I am disheartened to see our dear people of Kano suffering as a result of an unjustified fuel hike, and the situation must be stopped right away,” he added.\nMr Yusuf also urged Kano residents to comport themselves and uphold the law."
    },
    {
        "url": "https://saharareporters.com/2023/08/06/afenifere-diaspora-cautions-against-calls-coup-detat-nigeria-canvasses-reversal-fuel",
        "summary": "It said, “We in Afenifere have always maintained that restructuring is the only solution to the multifaceted problems of Nigeria.\n\"The current Constitution vested too much power to the centre and this cannot savage the real problems of Nigerians.\n\"There seems to be a loss of traction on national economic planning and management.\n\"On fuel subsidy, removal should be reversed and industries revamped before it is considered.\nThe new plan minimum wage is not the solution to the current economic hardship,\" the group added."
    },
    {
        "url": "https://saharareporters.com/2023/09/12/nigerian-maritime-university-deducts-n7000-monthly-each-staff-member-boat-transport",
        "summary": "The management of the Nigerian Maritime University, Okerenkoko, Delta State, has ordered the monthly deduction of N7,000 from the salary of its all senior staff as their monthly charge for boat transport to and from the Warri area of the state to the University in Okerenkoko/Kurutie.\n\"They pleaded with the Nigerian government to come to their rescue as the University VC and his Bursar have cornered the institution into his pocket without any drop of welfare package.\"\nThe Vice Chancellor in the memo said that the decision of the institution to charge all the senior staff N7,000 monthly from their salaries is due to the fuel subsidy removal by President Bola Tinubu-led Nigerian government.\n\"Consequently, Management decided as follows: Every Senior Staff is to contribute the sum of N7,000 (Seven Thousand Naira) monthly for water transportation as against over N50,000.\nI hereby sincerely thank all Senior Staff of the University for their Support and understanding.\""
    },
    {
        "url": "https://saharareporters.com/2023/06/07/subsidising-madness-evans-ufeli-esq",
        "summary": "They say the subsidy regime makes some people very rich at the expense of others.Yes!\nWhy drag the citizens of Nigeria into a conundrum that they know nothing about, wrecking cruelty with reckless abandon?\nSubsidy isn't paid for Kerosene, Aviation fuel and Diesel, the government earns the money without paying subsidy.\nYou argue that subsidy is not budgeted for in the 2023 Appropriation Act and it has no place in the new Petroleum Industry Act.\nI shall go to Rabbi againEvans Ufeli Esq is the Principal Partner, Rabbi Solicitors"
    },
    {
        "url": "https://saharareporters.com/2023/08/22/dont-treat-fuel-subsidy-palliatives-same-negligence-seen-during-covid-19-reliefs",
        "summary": "The group appealed to the state governments to ensure a fair distribution that encompasses all citizens.\nThe statement partly read: \"We emphasise the necessity of involving a diverse array of stakeholders in the distribution process.\n\"Our organization firmly believes that relief materials should reach every stratum of society, irrespective of political affiliations, religious beliefs, regional backgrounds, or tribal roots.\n\"We remind state governments that their actions are being observed not only by the Nigerian populace but also by the international community.\nBy ensuring that relief materials reach those in need, we uphold the values of empathy, equity, and responsibility in governance,\" the statement read."
    },
    {
        "url": "https://saharareporters.com/2023/08/17/tinubu-government-share-n185billion-palliative-states-capital-territory-address-impact",
        "summary": "To cushion the economic hardship facing Nigerians as a result of fuel subsidy removal, the Nigerian government says it will share N185 billion to 36 states and the federal capital territory (FCT) as palliative.\nBorno state governor, Babagana Zulum, who announced the package in Abuja on Thursday shortly after the National Economic Council (NEC) meeting, said each state will receive N5 billion.\nThe meeting was chaired by Vice President Kashim Shettima.\nThe council is made up of governors of the 36 states, the governor of the Central Bank of Nigeria (CBN) and other officials."
    },
    {
        "url": "https://saharareporters.com/2023/03/29/lagos-state-government-removes-subsidy-reverts-all-bus-fares-100-cent",
        "summary": "The Lagos State Government has announced that all its bus fares will revert to their 100 per cent rates effective from April 1, 2023.\nIn February, the state governor, Babajide Sanwo-Olu had announced a 50% reduction on all the state Public Transport System citing that the measure was to cushion the effect of the fuel and currency crisis.\nMeanwhile, a statement from the state government released by the Lagos Metropolitan Area Transport Authority, LAMATA, said, “With effect from Saturday, 1st April, bus fare on all regulated buses BRT, Standard and FLM - shall revert to 100 per cent rate.\nLagos State Governor, Mr. Babajide Olusola Sanwo-Olu, had on Wednesday, 8th February 2023 approved a 50% slash in bus fares following the cash crunch brought about by the recent currency swap.\n“Consequently, bus fares return to pre-50% slash rate effective Saturday, 1st April 2023."
    },
    {
        "url": "https://saharareporters.com/2023/06/10/fuel-subsidy-edo-state-government-reduces-schooling-days-three-week",
        "summary": "The Edo State government has disclosed that public basic and junior secondary schools in the state will operate three days in a week, beginning from June 13.\nThe Chairman, Edo State Universal Basic Education Board, SUBEB Mrs. Ozavize Salami, disclosed this to journalists in Benin after a meeting between the head of service and other government functionaries on the government’s directive on the three workdays.\nSalami said, “Monday, Tuesday and Wednesday have been chosen to be the days for our children to go to school while the school will be closed for Thursday and Friday.\n“Our plan for this period focuses on maximizing e-learning, ensuring the children cover the curriculum they ought to cover.\nFor administrative reasons, we have chosen the first three days of the week as students will come to school."
    },
    {
        "url": "https://saharareporters.com/2023/06/06/why-we-suspended-planned-nationwide-strike-over-fuel-subsidy-removal-nigeria-labour",
        "summary": "The Nigeria Labour Congress (NLC) has explained the reasons behind the suspension of its planned nationwide strike action over the recent hikes in fuel prices as a result of subsidy removal.\nSaharaReporters had reported that the union changed its direction after meeting with the delegates of the Nigerian government at the Presidential Villa in Abuja on Monday.\nThe union had announced that some measures had been put in place and an agreement was reached for the strike not to go on as planned.\nIt noted that it also recognised the willingness of the “government for continuous engagement through dialogue and to offer reasonable palliatives in due course to cushion the effect of its policies and some levels of understanding reached”.\n“All affiliates and State Councils of Congress are hereby directed to suspend further action and mobilization until the outcome of the final negotiations,” it added."
    },
    {
        "url": "https://saharareporters.com/2023/08/29/fuel-subsidy-nigerian-governors-others-will-keep-palliatives-themselves-families-they",
        "summary": "The governors and political party leaders will keep it for themselves and their families as they did with the palliatives during COVID-19,” Ajayi said.\nThe organisation lamented the tribal, ethnic and religious colourations in Nigeria in a statement issued by its Secretary, Engr.\nOur leaders must rise against this trend of fanning tribal, ethnic and religious war in Nigeria.\nWe have seen some of our leaders speak carelessly in public thereby creating an atmosphere of tribal, ethnic or religious intolerance.\n\"The 1999 Constitution of the Federal Republic of Nigeria mandates government by democratic legislatures, and an executive accountable to the people."
    },
    {
        "url": "https://saharareporters.com/2023/06/05/fuel-subsidy-kwara-state-government-reduces-workdays-three-week-public-servants",
        "summary": "Governor Abdulrahman Abdulrazaq of Kwara State has approved a temporary reduction of workdays to three days a week for state public servants.\nThe State Chief Press Secretary, Murtala Atoyrbi, who made this known in a statement on Monday said that the workdays reduction by the state government was a temporary palliative measure to bring some ease to workers following the removal of fuel subsidy by the Nigerian Government.\nAccording to Atoyrbi, the State Head of Service, Mrs Susan Modupe Oluwole, announced the governor's approval for workdays’ reduction from five days to three days a week on Monday.\nThe State Head of Service directed all heads of Ministries, Departments and Agencies (MDAs) in the state to immediately work out a format indicating the alternating work days for each worker under them.\nOluwole however warned the workers in the state \"not to abuse the magnanimity of the Governor, stressing that the regular monitoring of MDAs by her office would be intensified to ensure strict compliance.\""
    },
    {
        "url": "https://saharareporters.com/2023/09/01/nigerian-petroleum-company-nnpcl-says-petrol-consumption-reduces-30-amid-subsidy-crisis",
        "summary": "The Group Managing Director of the Nigerian National Petroleum Company Limited, NNPCL, Mele Kyari, has claimed that the consumption of petrol has reduced by 30 per cent.\nKyari stated during a news conference held by the Minister of Finance and Coordinating Minister of the Economy, Wale Edun, in Abuja on Friday that the reduction is due to President Bola Tinubu's abolition of the petrol subsidy.\nHe explained that the decrease in gasoline consumption from 66.7 million litres per day previously to around 46 million today indicated a 30% decrease in NNPCL's requirement for foreign exchange to import fuel.\nHe explained that the decrease in gasoline consumption from 66.7 million litres per day previously to around 46 million today indicated a 30% decrease in NNPCL's requirement for foreign exchange to import fuel.\nFurthermore, Wale Edun, the Finance Minister, has indicated that President Tinubu's administration was targeting Nigerians' cash stored in domiciliary accounts in the country as well as funds held overseas in order to revitalise the economy."
    },
    {
        "url": "https://saharareporters.com/2023/09/17/ruling-apc-chairman-caught-camera-beating-ondo-female-commissioner-over-subsidy",
        "summary": "A video has surfaced on the internet showing the ward chairman of the ruling All Progressives Congress in Arigidi, in Akoko North West, Olumide Awolumate, assaulting Dr. Bunmi Osadahun, the Commissioner for Women Affairs and Social Development.\nSaharaReporters gathered that Osadahun was also attacked by other leaders of the party over the distribution of palliatives aimed at mitigating the impact of the government’s removal of fuel subsidy.\nThe state government had initiated the distribution of palliatives to the residents of Arigidi Akoko, located in Akoko North West Local Government Area.\nIn the viral video, the party ward chairman is seen attacking Osadahun with a chair.\nShe’s resting.”The state government last week flagged off the distribution of palliatives to vulnerable households in the state, with commissioners leading the distribution in their respective local government areas."
    },
    {
        "url": "https://saharareporters.com/2023/08/01/workers-rights-campaign-calls-full-return-petrol-subsidy-n200000-minimum-wage-ahead",
        "summary": "In a statement signed by its National Coordinator, Ayemhenre Kelvin and National Secretary, Nkechi Obinna, the WRC demanded the “full reversal of pump price of petrol”.\nIt also called for the arrest and prosecution of the cabal the Presidency has blamed for the subsidy scam.\nThe WRC also called on the government to “stop increases in electricity tariff” while saying “no to crazy bills”.\nIt called for the “implementation of a new minimum wage of N200,000”.\nIt called for free trade zones, adding that “their owners must obey the rule of employment relationship as its affects workers”."
    },
    {
        "url": "https://saharareporters.com/2023/08/18/labour-party-chieftain-okupe-applauds-tinubu-over-fuel-subsidy-removal-others-says",
        "summary": "A chieftain of the Labour Party and former Director General of the presidential campaign organisation of the party for the 2023 election, Doyin Okupe, has applauded President Bola Tinubu for removing fuel subsidy and showing commitment, zeal and courage in his administration.\nIn the election result declared by the Independent National Electoral Commission (INEC), Obi and other candidates lost to Bola Tinubu of the ruling All Progressives Congress (APC).\nOkupe in an appraisal of Tinubu’s administration and policies he titled, ‘For President Bola Tinubu: Still Many Rivers to Cross,” commended President Tinubu.\nAccording to Okupe, “President Bola Tinubu actually hit the ground sprinting; showing much determination, zeal, commitment and courage.\n“In conclusion, I personally believe that President Bola Tinubu is a thinker and an achiever."
    },
    {
        "url": "https://saharareporters.com/2023/06/03/trade-union-congress-asks-tinubu-led-nigerian-government-immediately-return-fuel-subsidy",
        "summary": "The Trade Union Congress (TUC) has demanded the Nigerian government to immediately reverse its decision on fuel subsidy to status quo.\nThe TUC President, Mr Festus Osifo, made this known on Friday while addressing newsmen at the end of an emergency meeting of the congress’s National Executive Council (NEC) meeting in Abuja.\nOsifo was quoted as saying, “Having noted this, we wish to state that the NEC-in- session resolved that discussions with the Federal Government should continue while demanding that the government should revert to the status quo ante.\n“The status quo ante should be maintained while discussions continue as we had a meeting with the government on Wednesday.\nOnce we are done with that meeting then the TUC is going to put its demands forward, it is how they react to those demands that will determine our next line of action.”"
    },
    {
        "url": "https://saharareporters.com/2023/07/26/fuel-subsidy-removal-other-factors-will-sustain-inflation-rise-nigeria-says-central-bank",
        "summary": "The Central Bank of Nigeria (CBN) has said that fuel subsidy removal (deregulation of petrol price) and other factors including the transition to a unified and market-determined exchange rate will sustain rise in inflation in Nigeria.\nThis was contained in a communique issued by the apex bank’s Monetary Policy Committee (MPC) after its 2023 meeting held between Monday and Tuesday.\nThe National Bureau of Statistics (NBS) in its June report stated that Nigeria’s headline inflation rose from 22.41 percent recorded in May to 22.79 percent in June.\nThe CBN’s Monetary Policy Committee noted that the steady rise in the country’s inflation “was driven by the moderate increases to both food and core components.\nLegacy headwinds, including security challenges in major food-producing areas; high cost of transportation driven by the rising cost of energy; and inadequacies in public infrastructure, continue to drive the rise in food and core inflation.”The Committee stated, “Key developments that would likely sustain upward pressure on domestic prices, in the short to medium term, are the recent deregulation of petrol price (fuel subsidy removal) and the transition to a unified and market-determined exchange rate.”According to the apex bank, “The unfolding dynamics in the policy environment and the resultant pass-through to domestic prices would thus require greater collaboration between the Bank and the fiscal authority.”"
    },
    {
        "url": "https://saharareporters.com/2023/05/31/fuel-subsidy-removal-nigerian-petroleum-company-nnpcl-releases-n488-n557-fuel-pump-price",
        "summary": "Following President Bola Tinubu’s announcement of fuel subsidy removal on Monday during his inaugural speech, the Nigerian National Petroleum Company Limited (NNPCL) on Wednesday morning released a list of adjusted pump prices for its mega stations across the 36 states of the federation and the Federal Capital Territory, Abuja.\nAccording to the released price list, the new pump price for fuel, also known as premium motor spirit (PMS), ranges from N488 in Lagos State to N557 per litre in Yobe and Borno states, while it is N537 in Abuja.\nIt was gathered that the NNPCL management has instructed all the management of its mega stations across the country to immediately implement the new price at all their Mega/Standard/Leased Stations.\nThe development has been confirmed in Port Harcourt, Rivers State capital and Yenagua, Bayelsa state capital where the NNPCL mega stations are opened for sale but motorists refused to buy the product at the new price as they lament that the price is beyond what they can afford.\nThere have been agitations across the country over the announcement of the fuel subsidy removal by President Tinubu with the immediate geometric price hikes of the product following the announcement."
    },
    {
        "url": "https://saharareporters.com/2023/07/11/fuel-smuggling-neighbouring-countries-persists-despite-subsidy-removal-tinubu-nigerian",
        "summary": "The Acting Comptroller-General of the Nigeria Customs Service, Adewale Adeniyi, has stated that the removal of fuel subsidy by the President Bola Tinubu-led Nigerian government did not stop the smuggling of stolen crude oil from Nigeria to neighbouring countries.\nAdeniyi made the disclosure on the sidelines of a sensitisation workshop on the Nigeria Customs Service Act 2023 for management staff of the NCS in Abuja.\nSaharaReporters had reported that NNPCL intercepted a vessel with 800,000 litres of stolen crude oil.\nAs a result, he stated that the agency was examining its enforcement techniques, and that under the new Nigeria Customs Service Act 2023, offenders would face harsh penalties.\nThe situation of fuel is very sensitive and we cannot afford to let the saboteurs take over our economy.”"
    },
    {
        "url": "https://saharareporters.com/2023/07/09/same-political-group-castigated-ex-president-jonathan-removing-fuel-subsidy-now-praise",
        "summary": "It was also endorsed by 174 Nigerians from all the geopolitical zones and the Diaspora.\nIn the weeks to come, Nigerians shall pronounce their verdict on the judiciary, whether guilty or not guilty.\"\nCommenting on the recent fuel subsidy removal, the Christian body said it was done without appropriate remediation for the plight of the masses.\n\"Soon as Rehoboam was up on the throne, he demonstrated a gross lack of empathy with the hardships of the people.\n\"A Yoruba proverb warns that the eye that would see the evening does not stir dust in the morning."
    },
    {
        "url": "https://saharareporters.com/2023/08/06/nigerians-subjected-worse-hardship-pain-despite-tinubus-claim-saving-n1trillion-fuel",
        "summary": "A former presidential candidate of the African Action Congress (AAC), Omoyele Sowore, has asked President Bola Tinubu’s administration to account for the N1 trillion it claimed to have saved from fuel subsidy removal.\nAddressing Nigerians in the RevolutionNow 4th Anniversary Video Broadcast: Revolution Or Nothing, Sowore said that despite the government’s claim to have saved N1 trillion from fuel subsidy, which according to him, is rather a total deregulation of the country’s oil sector, Nigerians have been subjected to worse hardship and pain.\nTweet URL“Policies such as the total deregulation of the Nigerian oil sector, which is popularly and incorrectly referred to as subsidy removal has brought untold hardship on our people.\n“Do not be deceived when they say they have saved some unwilled and bogus N1 trillion.\nThe question is, where is the N1 trillion, and why is it that after saving N1 trillion, your lives have not changed?"
    },
    {
        "url": "https://saharareporters.com/2023/05/31/fuel-subsidy-removal-nigerian-petroleum-company-nnpcl-confirms-adjusted-fuel-pump-prices",
        "summary": "The Nigerian National Petroleum Company Limited has announced that it has adjusted its pump prices of premium motor spirit, also known as petrol at its retail outlets across the country to reflect the fuel subsidy removal.\nIn a statement issued on Wednesday by its Chief Corporate Communications Officer, Garba Deen Muhammad, the company said, “NNPC Limited wishes to inform our esteemed customers that we have adjusted our pump prices of PMS across our retail outlets, in line with current market realities.\nAccording to the released price list, the new pump price for fuel, also known as premium motor spirit (PMS), ranges from N488 in Lagos State to N557 per litre in Yobe and Borno states, while it is N537 in Abuja.\nIt was gathered that the NNPCL management has instructed all the management of its mega stations across the country to immediately implement the new price at all their Mega/Standard/Leased Stations.\nThere have been agitations across the country over the announcement of the fuel subsidy removal by President Tinubu with the immediate geometric price hikes of the product following the announcement."
    },
    {
        "url": "https://saharareporters.com/2023/06/22/nigerian-governors-new-legislators-still-move-endless-convoys-despite-fuel-subsidy",
        "summary": "The President of the Trade Union Congress (TUC), Festus Osifo has lambasted governors, lawmakers and other government officials for continuing with “endless convoys” despite the removal of subsidy on petrol by the President Bola Tinubu-led Nigerian government.\nAccording to Osifo, the elected politicians should be cutting costs by reducing the number of cars in their convoys.\nYou see the new legislatures, you see their convoys, it’s endless,” Osifo said on Channels Television on Wednesday evening.\n“Nigerians are facing a lot of hardship all across, it is really hard and it is really terrible.\n“What we are saying is that if the Federal Government was not able to fund subsidy, at whose expense?"
    },
    {
        "url": "https://saharareporters.com/2023/06/05/fuel-subsidy-president-tinubu-should-give-nigerian-workers-tax-holiday-mass",
        "summary": "The Trade Union Congress (TUC) has called on President Bola Tinubu to increase the minimum wage of workers in the country to at least N200,000 in order to cushion the effects of the fuel subsidy removal.\n“PMS allowance to be introduced for those earning between N200,000 to N500,000 or 500USD to 1,200USD whichever is higher.\n“State Governments should immediately set up a subsidized transportation system to reduce the pressure on workers and students.\n“The existing National Housing Fund (NHF) should be made accessible to genuine workers; the framework on this must be discussed and agreed.\nGovernment must design a framework for social housing policy for workers through Rent to Own System."
    },
    {
        "url": "https://saharareporters.com/2023/06/10/june-12-nigerias-organised-civil-society-declares-nationwide-protest-monday-over-petrol",
        "summary": "The Organised Civil Society which comprises of civil society leaders and pro-democracy activists affiliated to about 120 concerned CSOs in Nigeria has set aside Monday, June 12 for a nationwide protest over the petrol subsidy fraud and hike in fuel price.\nThis was contained in a statement signed by Olawale Okunniyi, Head of Secretariat, National Coordinating Centre.\nTargeting just the fuel subsidy is anti-people.\nOther questions of how much are the savings from the removal of Subsidy?\nAll these in the estimation of the coalition need to be urgently addressed by all concerned and affected stakeholders."
    },
    {
        "url": "https://saharareporters.com/2023/06/05/subsidy-removal-fuel-retailers-and-supplier-ardova-plc-loggerheads-over-4-week-delay",
        "summary": "Fuel retailers under Ardova PLC have protested against an alleged unfair and unjust treatment by the management of the indigenous energy group.\nHe said that the complaints made by the retailers under Ardova should not be taken seriously because they understand the practice in the industry.\nThere is another type whereby dealers own the stations, run the stations but they buy the product from us.\n“There is no product and when NNPC gets the product, they supply to their stations first, and NNPC has a thousand stations.\n“We have offered dealers in the queue who were next in the queue a discount as goodwill."
    },
    {
        "url": "https://saharareporters.com/2023/08/18/tinubu-government-approves-compressed-natural-gas-initiative-ease-impact-fuel-subsidy",
        "summary": "President Bola Tinubu has approved the establishment of the Presidential Compressed Natural Gas Initiative (PCNGI) to ease the economic hardship created by the removal of fuel subsidy.\nThis is contained in a statement issued by the Special Adviser to the President on Media and Publicity, Ajuri Ngelale.\nAccording to Ngelale, the approval is in furtherance of the President’s commitment to easing the impact of fuel subsidy removal on Nigerians by reducing energy costs.\nMeanwhile, the Nigerian Petroleum and Natural Gas Authority (PCNGI) is reportedly launching a comprehensive Adoption Strategy to reduce transit costs and promote the integration of CNG utility within the energy value chain.\nHe said the initiative demonstrates the administration's commitment to reducing carbon emissions and promoting energy security through domestic natural gas resource utilization."
    },
    {
        "url": "https://saharareporters.com/2023/06/12/take-it-back-movement-calls-immediate-reversal-petrol-prices-says-subsidy-nigerians",
        "summary": "Human rights and pro-democracy group, the Take-It-Back Movement (TIB) has called for an immediate reversal of Premium Motor Spirit (PMS), otherwise called petrol, pump price across filling stations in Nigeria, saying subsidising the petrol product is a democratic right Nigerians should be enjoying.\nThe statement also raised worry over the persistent attacks on press freedom and the right to protest of Nigerian citizens.\nThe democratic will of the Nigerian people remained an object of attacks, both at the polls, and on the streets.\nNigerians are struggling with survival that has been made worse by the over 300% increase in pump price imposed by the Tinubu administration.\n“We seize the occasion of today to restate our opposition to the increase in pump price, and we maintain that being subsidized is a democratic right of the Nigerian people."
    },
    {
        "url": "https://saharareporters.com/2023/09/01/nigeria-labour-congress-declares-two-day-warning-strike-over-removal-fuel-subsidy",
        "summary": "The Nigeria Labour Congess (NLC) has declared a two-day nationwide warning strike from next Tuesday, September 5, 2023 over the economic hardship in the country, worsened by the removal of the petrol subsidy by the government.\nThe union announced the industrial action on Friday to demand immediate adjustment of economic policies to make lives easier and more meaningful for the masses.\nNLC in June also declared a nationwide strike amid fuel shortages across the country occasioned by President Bola Tinubu’s inaugural speech in which he declared that “fuel subsidy is gone”.\nThe union announced that some measures had been put in place and an agreement was reached for the strike not to go on as planned.\nAccording to the National Executive Council of the NLC, it also considered “the mood of the Socio-polity (after the) last elections and the need to pursue national stability.”"
    },
    {
        "url": "https://saharareporters.com/2023/08/02/fuel-subsidy-removal-labour-unions-workers-gather-commence-peaceful-protest-government",
        "summary": "Labour unions have gathered to commence Wednesday’s march to protest against the removal of subsidy on premium motor spirit, otherwise called petrol and other policies of President Bola Tinubu’s administration.\nThe Nigeria Labour Congress (NLC) on Tuesday said that it had neither reconsidered nor suspended its planned nationwide protest scheduled for Wednesday.\nThe labour union made this known in a statement signed by its President, Joe Ajaero, insisting that its demands still remained the same.\n\"Nigerians are advised to ignore the work of fifth columnists who are working hard against the wishes of the people.\nThe organised labour’s demands include the immediate reversal of all anti-poor policies of the government including the recent hikes in petrol prices, school fees and VAT."
    },
    {
        "url": "https://saharareporters.com/2023/07/18/oil-marketers-import-first-shipment-fuel-after-subsidy-removal-nigerian-agency-nmdpra",
        "summary": "The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) has said that oil marketers have commenced the importation of Premium Motor Spirit popularly known as fuel as the marketers brought first shipment after the subsidy removal by the Nigerian government.\nThe Chief Executive Officer of NMDPRA, Farouk Ahmed, made the revelation on Monday during a stakeholders’ engagement in Lagos.\nHe had remarked as the Nigeria National Petroleum Company Limited announced it apprehended a suspected Cameroon-bound tanker carrying crude oil.\nSaharaReporters reported that NNPCL intercepted a vessel with 800,000 litres of stolen crude oil.\nThe vessel – MT TURA II (IMO number: 6620462) – belonging to Holab Maritime Services Limited, was apprehended offshore with the Captain and Crew members on board."
    },
    {
        "url": "https://saharareporters.com/2023/06/05/fuel-subsidy-removal-nurses-judiciary-staff-journalists-others-mobilise-nigerian-labour",
        "summary": "The National Association of Nigeria Nurses And Midwives (NANNM), Senior Staff Union in Colleges Of Education, Nigeria (SSUCOEN), Nigerian Union Of Journalists and other workers’ unions have mobilised their members for the planned nationwide strike by the Nigerian Labour Congress(NLC) on Wednesday.\nIn a letter released by NANNM Deputy General Secretary, Elder Otairu Daniel Shaibu, the strike was aimed to protest against fraudulent increment in fuel prices in Nigeria.\n“The proposed strike was billed to commence on Wednesday 7th June, 2023.\nConsequently, all State Councils of our Association are by this notice directed to mobilize our members in strict compliance with the directive of the National Leadership of the Nigeria Labour Congress.\"\nOther affiliates who have also mobilised their members for the strike include Judiciary Staff Union Of Nigeria, Maritime Workers’ Union Of Nigeria, Nigerian Local Government Employees, Non-Academic Staff Union of Educational And Associated Institutions and the National Union of Civil Engineering Construction Furniture & Wood Workers (NUCECFWW)."
    },
    {
        "url": "https://saharareporters.com/2023/05/30/fuel-subsidy-removal-line-petroleum-industry-act-no-need-panic-buying-nigerian",
        "summary": "The Nigerian Midstream and Downstream Petroleum Regulatory Authority (NMDPRA) has said that Nigerians should not panic over President Bola Tinubu’s announcement of fuel subsidy removal as it is in line with the Petroleum Industry Act (2021).\nNMDPRA in a statement by its General Manager, Corporate Communications, Kimchi Apollo, stated that the Petroleum Industry Act (2021) provides for total deregulation of the petroleum downstream sector to drive investment and growth.\n“Contrary to speculations and concerns, the announcement is in line with the Petroleum Industry Act (2021) which provides for total deregulation of the petroleum downstream sector to drive investment and growth.\n“Therefore, we call on Nigerians to remain calm and resist the urge to stockpile as it poses a significant safety hazard.\n“We will continue to monitor activities and implement necessary measures to enhance transparency and accountability in the petroleum downstream sector,” the statement read."
    },
    {
        "url": "https://saharareporters.com/2023/06/12/fuel-subsidy-removal-has-imposed-extra-burden-nigerian-masses-president-tinubu-admits",
        "summary": "Tinubu stated this in his maiden Democracy Day speech, while hailing the winner of the June 12, 1993 presidential election, Chief MKO Abiola.\n“I admit that the decision will impose an extra burden on the masses of our people.\nPainfully, I have asked you, my compatriots, to sacrifice a little more for the survival of our country.\n“For your trust and belief in us, I assure you that your sacrifice shall not be in vain.\nHours after Tinubu’s announcement, the petrol pump prices skyrocketed from N195 to N537 nationwide, alongside an ancillary price increase."
    },
    {
        "url": "https://saharareporters.com/2023/07/10/fuel-consumption-nigeria-falls-67million-48million-litres-daily-after-subsidy-removal",
        "summary": "The average consumption of Premium Motor Spirit, popularly called petrol, has dropped from 66.9 million litres daily to 48.4million litres since May 29 when the President Bola Tinubu-led government announced the removal of fuel subsidy.\nAn analysis of the data by PUNCH showed that the difference between the average monthly consumption figures during the pre-deregulation and post-deregulation periods was about 18.5 million litres.\nThis implies that the average daily consumption of petrol across the country reduced by about 18.5 million litres after subsidy on commodity was stopped by the Federal Government.\nIt was, however, observed that petrol consumption rose above 100 million litres in some days, while it fell to below 10 million litres in few other days.\nA random pick of petrol consumption figures contained in the NMDPRA report, for instance, showed that on March 8, April 20, and May 16, Nigerians consumed 103.6 million litres, 105.02 million litres, and 101.9 million litres respectively."
    },
    {
        "url": "https://saharareporters.com/2023/08/22/fuel-subsidy-removal-governor-oborevwori-announces-n10000-monthly-stipend-delta-civil",
        "summary": "Delta state governor, Sheriff Oborevwori, has announced palliatives for civil servants in the state with each worker to receive additional N10,000 monthly.\nHe said it is part of his administration's effort to cushion the impact of fuel subsidy removal on the workers, adding that the state's 50,196 workforce will now work in shifts and from home.\nThe governor assured that the additional monthly N10,000 to support the workers would commence in August and last for three months.\nHe said, \"We are keeping faith with the electorate to make life richer and more fulfilling for them as contained in the M.O.R.E Agenda.\nThose sworn-in as commissioners are: Odinigwe Odigie Daniel; Joan Onyemaechi, Jerry Ehiwario; Charles Aniagwu; Kingsley Ashibuogwu; Michael Ifeanyi Anoka; Pat."
    },
    {
        "url": "https://saharareporters.com/2023/09/14/buhari-hoped-fuel-subsidy-removal-would-reduce-number-nigerians-coming-see-him-daura",
        "summary": "Mallam Garba Shehu, Senior Special Adviser to former President Muhammadu Buhari on Media and Publicity, has said that Buhari said he had hoped that fuel subsidy removal by President Bola Tinubu’s administration would constrain a large number of Nigerians across the country from coming to see him in his hometown of Daura, Katsina State.\nShehu said this on Thursday in a statement marking 100 days since Buhari left office and handed over power to President Tinubu on May 29.\nShehu said that Buhari, who according to him, has remained in Daura since he left office, receives visitors from across the country and beyond as he used to receive when he was in office.\nHe said, \"To manage the numbers, he has a weekly program drawn for him as they did while he was in the Villa.\nNot left out are those who benefited from the administration, one way or another."
    },
    {
        "url": "https://saharareporters.com/2023/07/25/president-tinubu-has-released-grains-fertilisers-reduce-effects-fuel-subsidy-removal",
        "summary": "Nigerian Vice President, Kashim Shettima, has told a United Nations summit that his principal, President Bola Tinubu, withdrew the subsidy on petrol from “day one” and embarked on the release of grains and fertilisers to reduce the effects of the removal.\nShettima added that the Tinubu-led government had also mobilised over half a billion dollars for sustainable food systems transformation initiatives.\nOn removing impediments to economic recovery, he said \"we had two albatrosses around our necks: subsidy on petrol and multiple exchange rates system.\nWe withdrew the subsidy on petrol from day one, just like President Ruto did in Kenya.\nTo mitigate the effects of the subsidy removal, the government embarked on the immediate release of grains and fertilisers."
    },
    {
        "url": "https://saharareporters.com/2023/07/22/nigerias-subsidy-dilemma-forging-path-transparency-and-empowerment-rasheed-akinyele",
        "summary": "The road ahead demands sacrifice, accountability, and unwavering determination to shape a brighter future for our beloved nation.\nOnce hailed as a beacon of hope, the proponents of subsidy removal now find themselves entangled in the same intricate web of challenges that afflict ordinary citizens.\nCentral to this journey is the need for clarity on how the funds recouped from subsidy removal will be allocated.\nAs we weather this storm together, we can forge a path of empowerment, transparency, and progress.\nIn the crucible of this subsidy dilemma lies an opportunity to redefine the very essence of Nigerian governance."
    },
    {
        "url": "https://saharareporters.com/2023/06/05/fuel-subsidy-joint-action-front-backs-nigerian-workers-nationwide-strike-warns-former",
        "summary": "The Joint Action Front (JAF) has declared its support to the Nigerian Labour Congress (NLC) planned nationwide strike on Wednesday.\nThe JAF also advised Comrade Adams Oshiomhole, former NLC president and former governor of Edo State, not to play a divisive role on the planned nationwide strike.\n“Our principles to struggle in the defence of working people and the poor are sacrosanct, from Imoudu Labour Leader No.\nWe therefore consider any attack on the organisation of working class people as an attack on us.\n“The NLC since its inaugural creation 73 years ago has overcome ethnic or regional lines on an issue with a national spread."
    },
    {
        "url": "https://saharareporters.com/2023/08/03/subsidy-removal-nigerian-petroleum-company-nnpcl-announces-partnership-nipco-provide-35",
        "summary": "Nigerian National Petroleum Company (NNPC) Limited has announced a partnership with NIPCO Gas Limited to provide Compressed Natural Gas (CNG) stations across the country, including three mother stations.\n“Under the NNPC-NIPCO strategic partnership, 35 state-of-the-art CNG stations will be constructed nationwide, including three (3) Mother stations.\n“Once fully operational, the stations can service over 200,000 vehicles daily, thereby significantly reducing the cost of automobile fuel for Nigerians and the cost of transportation.\nThe first phase, comprising 21 CNG stations, will support intra-city transportation and be ready by the first quarter of 2024; While the second phase, comprising 35 CNG stations, will support inter-city transformation and will be ready by late 2024.\n“NIPCO Gas Limited is currently operating 14 CNG stations across Nigeria and has converted over 7,000 vehicles to run on CNG."
    },
    {
        "url": "https://saharareporters.com/2023/09/04/bank-insurance-electricity-workers-vow-join-nigeria-labour-congress-2-day-nationwide",
        "summary": "The National Union of Banks, Insurance and Financial Institutions Employees has announced the withdrawal of services for Tuesday and Wednesday, saying its members will join the two-day nationwide warning strike declared by the Nigeria Labour Congress (NLC).\nThe NLC declared the strike to protest against the hardship in the country foisted on the masses through the removal of fuel subsidy as announced by President Bola Tinubu in his inaugural speech on May 29.\nThe National Union of Banks, Insurance and Financial Institutions Employees in a circular seen by SaharaReporters said it took the decision to join the strike after its National Executive Council (NEC) meeting during the weekend.\n“We hereby direct all our organs to comply with this directive by ensuring all our members stay off duties for the two days.”Similarly, the National Union of Electricity Employees directed its members across the country to join the two-day nationwide warning strike.\n“To embark on a total and indefinite shutdown of the nation within 14 working days or 21 days from 1st September."
    },
    {
        "url": "https://saharareporters.com/2023/05/30/fuel-subsidy-removal-rise-against-tinubu-apc-through-protests-rallies-processions-group",
        "summary": "A civil society group under the aegis of the International Solidarity for Peace and Human Rights Initiative (IS4PAHRI) has strongly opposed the removal of fuel subsidy by President Bola Tinubu, saying it is a clear indication that Tinubu has come to destroy Nigeria and not rebuild it.\nThe IS4PAHRI said this on Tuesday in a statement signed by its President, Comrade Osmond Ugwu and Secretary, Dr Jerry Chukwuokolo.\nThe group said that it “condemns in very strong terms, the removal of subsidy by Bola Ahmed Tinubu”.\nto rise up and work in solidarity to save Nigeria from Tinubu and APC by embarking on consistent mobilization of their members and direct them to embark non-violent but consistent agitation, picketing, rallies and road protest with procession in all the states until the decision is reversed and proper arrangements put in place for reactivation of all refineries and building of new ones in all the states of the federation”.\n“IS4PAHRI hereby assures the working-class people and other traditional allies of her ever-ready support and solidarity towards the liberation of Nigerian people from the trepidation and unjustified hardship they are subjected to by the ruling oppressive regime of APC government,” it added."
    },
    {
        "url": "https://saharareporters.com/2023/03/28/us-ambassador-mary-leonard-says-buhari-government-must-remove-fuel-subsidy-leaving-may",
        "summary": "The United States Ambassador to Nigeria, Mary Beth Leonard, has warned the Nigerian government, politicians and Nigerians in general to stay off any form of actions that will jeopardise Nigeria’s democracy.\nThe outgoing US Ambassador further expressed hope that President Muhammadu Buhari would remove the fuel subsidy as he prepared to leave office in May.\nLeonard in her farewell speech on Monday called on individuals who may not be satisfied with the outcome of the 2023 general elections to seek redress from judicial platforms to secure justice.\nIt was also reported that Leonard had recently met with President Muhammadu Buhari at the Presidential villa in Abuja, where she expressed happiness with the progress made in Nigeria-US relations in the last three and half years.\nLeonard cited President Buhari’s strong response against the recent surge of coups-d’état in West Africa as worthy of commendation."
    },
    {
        "url": "https://saharareporters.com/2023/08/02/breaking-heavy-security-presence-labour-unions-workers-protest-lagos-bayelsa-kano-kwara",
        "summary": "Labour unions in Lagos have commenced Wednesday’s march to protest against the removal of subsidy on premium motor spirit, otherwise called petrol and other ‘anti-masses policies’ of President Bola Tinubu’s administration.\nHowever, there is a heavy security presence around Ikeja Under-bridge in Lagos where the protesters are gathered.\nThere is also a heavy security presence in Kano, northwest Nigeria where protesters have gathered for mass action.\nThe Nigeria Labour Congress (NLC) on Tuesday said that it had neither reconsidered nor suspended its planned nationwide protest scheduled for Wednesday.\nThe labour union made this known in a statement signed by its President, Joe Ajaero, insisting that its demands still remained the same."
    },
    {
        "url": "https://saharareporters.com/2023/08/07/subsidy-removal-nigerian-private-school-owners-increase-tuition-suspend-bus-services",
        "summary": "The National Association of Proprietors of Private Schools (NAPPS) has informed parents of their decision to suspend school bus services nationwide and the tendency of increasing their wards’ tuition fees.\nOtubela was quoted by The PUNCH as saying: “Undoubtedly, this is a challenging time for all, touching every sector of the economy, private schools not exempted.\n“We decided that there was a need to reduce some activities that are not directly necessary to academic activities to reduce cost.\nThe NAPPS President said private schools are in need of support.\n“Unknown to many people, many of the private schools are running at a loss, while many are running as charity organisations,” he added."
    },
    {
        "url": "https://saharareporters.com/2023/05/29/breaking-petrol-queues-resurface-abuja-hours-after-tinubu-vowed-remove-fuel-subsidy",
        "summary": "Barely two hours after President Bola Tinubu promised to remove fuel subsidy as part of the agenda of his administration, fuel queues have resurfaced in petrol stations across Abuja, the nation’s capital city, with many motorists scrambling to get petroleum products.\nSome of the filling stations visited included; NNPCL Mega stations along Kubwa Expressway, MRS Oil and AP.\nThe president had said, “We commend the decision of the outgoing administration in phasing out the petrol subsidy regime which has increasingly favoured the rich more that than the poor.\nSubsidy can no longer justify its ever increasing costs in the wake of drying resources.\nWe shall instead rechannel the funds into better investment in public infrastructure, education, health care and jobs that will materially improve the lives of millions.\""
    },
    {
        "url": "https://saharareporters.com/2023/06/05/breaking-nigerian-labour-congress-suspends-planned-nationwide-strike-over-fuel-subsidy",
        "summary": "The Nigeria Labour Congress (NLC) has suspended its planned strike over the hike in fuel price as a result of subsidy removal.\nSaharaReporters had earlier reported that the Nigerian government delegation again summoned the leadership of the Nigeria Labour Congress, NLC to a meeting at the Presidential Villa Abuja over the grievances emanating from the fuel subsidy removal.\nMeanwhile, at the end of the meeting, NLC announced that some measures had been put in place and an agreement was reached for the strike not to go on as planned.\nThe NLC, led by its President, Comrade Joe Ajaero, had arrived at the Presidential Villa at about 5:45 pm on Monday.\nJames Faleke, Permanent Secretary, Ministry of Labour Labour and Employment, Kachollom Daju among others."
    },
    {
        "url": "https://saharareporters.com/2023/07/31/small-set-powerful-nigerians-controlled-our-economy-so-fuel-subsidy-had-go-president",
        "summary": "President Bola Tinubu has said that the wealth of Nigerians was doled out to a handful of people through fuel subsidy and multiple exchange rates before he came on board.\nAccording to President Tinubu, \"Such a vast sum of money would have been better spent on public transportation, healthcare, schools, housing and even national security.\nInstead, it was being funnelled into the deep pockets and lavish bank accounts of a select group of individuals.\nIf we are to be a democracy, the people and not the power of money must be sovereign.\n\"It also compounded the threat that the illicit and mass accumulation of money posed to the future of our democratic system and its economy,\" he said."
    },
    {
        "url": "https://saharareporters.com/2023/08/01/tinubus-fuel-subsidy-will-still-find-way-capitalists-pockets-revolutionary-group-rsm",
        "summary": "The movement said it opposed the removal of subsidy, saying the corruption in the oil sector would not be addressed by the removal.\nTo address this, we must fight against corruption in subsidy payment, refurbish existing refineries, and build new ones.\nThe Maritime and Air worker’s union must ensure total compliance to send a clear message to the Federal Government to reverse all anti-people policies.\nWe oppose the removal of subsidy- the corruption in the oil sector will not be addressed this way.\nCorruption is endemic in Nigerian capitalism, and will find ways to fill the capitalists’ pockets, with or without the subsidy."
    },
    {
        "url": "https://saharareporters.com/2023/09/02/fuel-subsidy-committees-set-tinubu-failed-meet-six-weeks-lack-seriousness-nigerian",
        "summary": "The NLC President, Joe Ajaero, stated this, adding that the committees set up at the inception by President Bola Tinubu “couldn’t meet for almost six weeks” and cancelled their meetings two times to show there was no seriousness attached to the matter.\nNLC had declared a two-day nationwide warning strike from next Tuesday, September 5, 2023 over the economic hardship in the country, worsened by the removal of the petrol subsidy by the government.\nAjaero on Friday during an interview said the body was going on a two-day warning strike because the government failed to initiate any communication.\n“We cannot continue this way, three months after the removal of fuel subsidy, on the excruciating effects of this policy on Nigerians.\nThere were committees set up at the inception when we wanted to embark on the strike."
    },
    {
        "url": "https://saharareporters.com/2023/01/04/nigerias-anti-graft-agency-efcc-recovers-n13billion-illegal-fuel-subsidy-payments",
        "summary": "Nigeria's anti-corruption agency, the Economic and Financial Crimes Commission has recovered about N13billion as proceeds of illegal payments made under the subsidy regime between 2017 and 2022.\nThe revelation contained in a document published in the website of the Nigeria Financial Intelligence Unit on the National inherent risk assessment of money laundering and terrorist financing in the Nigerian extractive sector.\nThe absence of reliable equipment to measure the volume of crude oil being extracted makes it impossible to estimate the volume of crude oil extracted and even stolen through oil theft and vandalism.\n“Also, to be noted is the sale of petroleum products on the ‘black market’ giving rise to petroleum products being sold at exorbitant prices.\n“Other fraudulent practices include the diversion of petroleum products to non-designated retail outlets to gain undue financial advantage."
    },
    {
        "url": "https://saharareporters.com/2023/06/05/fuel-subsidy-you-have-double-standards-acting-out-peter-obis-script-over-planned-protest",
        "summary": "Femi Fani-Kayode, former aviation minister and the ruling All Progressives Congress Presidential Campaign Council's Director of New Media during the 2023 general election, has described the planned protest by the Nigeria Labour Congress (NLC) against the Nigerian government's removal of fuel subsidy as a reflection of the union's leadership's hypocrisy and insincerity.\nThe former minister added that the union is directly advocating for the political interest of the Labour Party candidate in the 2023 presidential election, Peter Obi.\n“Is this not strange and is it not a reflection of the insincerity, double standards and hypocrisy of the leadership of the Labour Congress?\nYet the truth is that whether the NLC likes it or not the oil subsidy MUST and WILL go.\nSome of the affiliates of the NLC include the Academic Staff Union of Universities, Academic Staff Union of Polytechnics, Nigeria Union of Teachers, Judicial Staff Union of Nigeria, and National Association of Nigeria Nurses and Midwives."
    },
    {
        "url": "https://saharareporters.com/2023/06/07/fuel-subsidy-house-reps-demands-audit-nigerian-company-nnpcl-over-missing-n2trillion",
        "summary": "The House of Representatives has called for a forensic audit of the Nigerian National Petroleum Company Limited to determine its assets and liabilities as well as its current market value.\nAccording to the House, the audit has become necessary due to the metamorphosis of the Nigerian National Petroleum Corporation into a limited liability company.\nThe House, at the plenary on Tuesday, considered and adopted the report of its ad hoc committee to ascertain the total inventory, assets, interest, and liabilities of the Nigerian National Petroleum Corporation and its subsidiaries.\nWhen contacted, the spokesperson for the NNPCL, Garba-Deen Muhammad, said the firm had nothing to hide and would answer any question from the Reps members.\nThere is a need to further establish the current market values of NNPC, especially under a devalued naira regime."
    },
    {
        "url": "https://saharareporters.com/2023/06/03/fuel-subsidy-crisis-nigerian-labour-congress-writes-academic-unions-asuu-asup-41-other",
        "summary": "The Nigeria Labour Congress (NLC) has written all its 43 affiliate unions to mobilise for a scheduled industrial action primed to begin on Wednesday, June 7, 2023.\nSome of the affiliates of the NLC include – the Academic Staff Union of Universities, Academic Staff Union of Polytechnics, Nigeria Union of Teachers, Judicial Staff Union of Nigeria, National Association of Nigeria Nurses and Midwives among others.\nTinubu had also disclosed that the 2023 budget did not make provision for fuel subsidy as such, further payment was no longer justifiable.\n“The fuel subsidy is gone,” Tinubu had declared, adding that his government would instead channel funds into infrastructure and other areas to strengthen the economy.\nAlthough Tinubu’s decision received backing from the NNPCL and the House of Representatives, it has since been resisted by the NLC and Trade Union Congress of Nigeria."
    },
    {
        "url": "https://saharareporters.com/2023/06/04/fuel-subsidy-removal-tinubu-government-set-committee-review-minimum-wage-consider-trade",
        "summary": "The Nigerian Government will consider the list of demands from the Trade Union Congress (TUC) which includes minimum wage, a government spokesperson, Dele Alake, said on Sunday.\nThis meeting followed Wednesday’s meeting between government representatives and the NLC and TUC which ended in a deadlock.\nHe said there was no disagreement with the NLC over its demand for a review of the minimum wage or a return to the status quo.\nAccording to him, the absence of NLC representatives from Sunday’s meeting does not translate to an isolation of the group in the discussion.\nPresident of the TUC, Festus Osifo, said the union was hopeful as the government had promised to look into their demands, on top of which is a review of the current minimum wage."
    },
    {
        "url": "https://saharareporters.com/2023/06/19/fuel-subsidy-nigerian-government-resumes-talks-labour-union",
        "summary": "The Nigerian government and the workers under the Nigeria Labour Congress, NLC, have resumed negotiations at the Presidential Villa, Abuja, over the proposed palliatives on the fuel subsidy removal.\nThe Nigerian government delegation had in the first week of June summoned the leadership of NLC to a meeting at the Presidential Villa Abuja over the grievances emanating from the fuel subsidy removal.\nThe NLC, led by its President, Comrade Joe Ajaero, met the government team at the meeting on Monday.\nSaharaReporters had on June 6 reported that to the dismay of Nigerians, the NLC announced the suspension of its planned nationwide strike action over the hike in fuel price as a result of subsidy removal.\nConsidering the mood of the Socio-polity last elections and the need to pursue national stability.”"
    },
    {
        "url": "https://saharareporters.com/2023/05/30/fuel-queues-frustration-hit-lagos-sokoto-ibadan-other-nigerian-cities-over-fuel-scarcity",
        "summary": "There is palpable frustration in major cities across Nigeria due to long queues at filling stations occasioned by hikes in prices of premium motor spirit (PMS), otherwise called petrol and the closure of many stations.\nThe hikes in fuel prices and hoarding of fuel come hours after the newly elected President, Bola Tinubu, declared an end to fuel subsidy in the country during his inaugural speech on Monday.\nIn Lagos, some marketers have responded by increasing their prices by about 100 per cent to about N400 from N195 per litre.\nA few stations, especially the major marketers, sold between N195 and N220 per litre across Lagos and Abuja.\nThe development has now led to the return of queues in filling stations after some operators closed their stations."
    },
    {
        "url": "https://saharareporters.com/2023/03/15/imf-mounts-pressure-nigeria-ghana-announces-removal-fuel-subsidy",
        "summary": "The Ghana National Petroleum Authority has announced the removal of the country's fuel subsidy.\nThis is just as the International Monetary Fund (IMF) also urged the Nigerian government to deliver on its commitment to remove fuel subsidies by mid-2023.\nHamid said the Ghanaian government, through the NPA, had also removed energy subsidies.\nAccording to Punch, he said, “We have removed subsidies and deregulated our markets.\nMeanwhile, the IMEF reminded the Nigerian government to deliver on its commitment to remove fuel subsidies by mid-2023."
    },
    {
        "url": "https://saharareporters.com/2023/05/30/nigerian-petroleum-company-nnpc-confirms-plan-remove-fuel-subsidy-cautions-against-panic",
        "summary": "The Nigerian National Petroleum Company Limited (NNPCL) has given its support to the immediate removal of fuel subsidy by President Bola Tinubu on Monday.\nThis was said by the GCEO of the company, Mele Kyari, in a statement who noted that the company had been spending a huge amount of its profits on fuel subsidy, indicating that its removal would be a huge relief for NNPC.\nMeanwhile, barely two hours after President Bola Tinubu promised to remove fuel subsidy as part of the agenda of his administration, fuel queues resurfaced in petrol stations across Abuja, the nation’s capital city, with many motorists scrambling to get petroleum products.\nSome of the filling stations visited included; NNPCL Mega stations along Kubwa Expressway, MRS Oil and AP.\nKyari however said there was no need for panic buying, noting that the company had enough product to supply the country for the next 30 days, adding that it was monitoring its supply and distribution networks around the country."
    },
    {
        "url": "https://saharareporters.com/2023/06/05/president-tinubu-meets-falana-over-fuel-subsidy-removal-economy",
        "summary": "President Bola Tinubu and human rights lawyer, Femi Falana (SAN), have met over the looming strike following the removal of petrol subsidy.\n“Falana met with Tinubu on Saturday.\nThey discussed how best to handle the removal of fuel subsidy and how to ensure that the pain of Nigerians does not worsen.\n“It is true that I met with President Tinubu on Saturday.\nWe discussed subsidy and how to tackle waste in government and recover looted funds."
    },
    {
        "url": "https://saharareporters.com/2023/06/07/how-i-supported-fuel-subsidy-removal-far-back-ex-president-jonathans-administration",
        "summary": "The Presidential Candidate of Labour Party during the 2023 general election, Peter Obi has explained how his government would have removed subsidy payment on Premium Motor Spirit also known as petrol if elected as Nigerian president.\nObi, a former governor of Anambra State, stated this at the Court of Appeal, the venue of the Presidential Election Petitions Tribunal, in response to the directive issued by the newly inaugurated president, Bola Tinubu, which resulted in the immediate removal of the subsidy.\n“People were just stealing the resources of the country and I showed it empirically in my statistical analysis that we were not consuming the amount of fuel they claimed we consumed.”Obi used a \"tooth pain\" removal comparison, adding, \"If you go to a dentist to have a painful tooth extracted, he will use a local anaesthetic to numb the area around the tooth so you don't feel pain.\"\nHe continued: “It’s not the same thing as pulling the tooth forcefully; the pain you feel will be different.\nIf you read my manifesto you will see clearly how I planned to remove subsidies."
    },
    {
        "url": "https://saharareporters.com/2023/03/28/fuel-subsidy-go-june-tinubus-government-will-determine-palliatives-nigerians-buharis",
        "summary": "The President Muhammadu Buhari’s administration has said the incoming government of Bola Tinubu will be responsible for providing fuel subsidy palliatives to Nigerians after the subsidy is eventually removed in June 2023.\nFielding a question on the issue, the minister said, “The subsidy palliatives will be left to the incoming government to implement.\nWithin that period, however, the committee had yet to harmonise its templates, he added.\n“Like you know, it is something that is going to affect the entire nation.\nThey will just have to ensure that everyone is carried along, that is both the federal and sub-national governments”, he added."
    },
    {
        "url": "https://saharareporters.com/2023/07/19/nigerian-government-will-review-workers-salaries-over-fuel-subsidy-removal-senate",
        "summary": "Senate President Godswill Akpabio has assured Nigerian workers of the readiness of the government to review the salaries of its workers to cushion the effect of the removal of fuel subsidy.\nAkpabio gave the assurance during a courtesy visit by the Ekiti State Governor, Abiodun Oyebanji and members of the National Assembly from the state.\nAccording to a statement issued by the Media Office, Office of the President of the Senate on Wednesday, Akpabio also noted that the removal of fuel subsidy by President Bola Tinubu’s administration was to address corruption in the petroleum sector.\nSpeaking further, Akpabio told the governor that \"the Senate is very proud of your representatives in the 10th National Assembly”.\n“They are committed and dedicated members of the legislature and that means the people of Ekiti, the ‘land of knowledge’ have a lot to offer this country particularly, the Senate."
    },
    {
        "url": "https://saharareporters.com/2023/07/12/president-tinubu-writes-national-assembly-seeks-n500billion-cushion-effects-fuel-subsidy",
        "summary": "President Bola Tinubu has written to the National Assembly, seeking an amendment to the 2022 Supplementary Appropriation Act to allow the government to source N500 billion.\nThe fund is to “source for funds to provide necessary palliatives to cushion the effect of the recent removal of fuel subsidy in Nigeria,” the letter from the President reads.\nThe letter titled, ‘Request for the amendment of the 2022 Appropriation Act’, reads, “I write to request the approval of the House of Representatives for an amendment of the 2022 appropriation act in accordance with the law.\n“The request has become necessary in other to source for funds to provide necessary palliatives to cushion the effect of the recent removal of fuel subsidy in Nigeria.\n“The sum of N500 billion only has been extracted from the 2022 appropriation act of N819.536 for the provision of palliatives to Nigerians to cushion the effect of fuel subsidy removal."
    },
    {
        "url": "https://saharareporters.com/2023/05/29/breaking-no-provision-fuel-subsidy-my-government-says-tinubu",
        "summary": "The newly inaugurated Nigerian President, Bola Tinubu, has officially announced the removal of fuel subsidy, saying that there is no provision for it.\nPresident Tinubu said this on Monday during his inaugural speech at Eagle Square in Abuja.\nHe was informed that there is no provision for fuel subsidy, adding that it can no longer be justified.\nHe said, “Fuel subsidy is no more.\n“No provision for fuel subsidy.”He said there will be a “thorough house cleaning,” adding that the interest rate will be reduced."
    },
    {
        "url": "https://saharareporters.com/2023/04/09/prioritise-revamping-refineries-tackling-corruption-oil-sector-subsidy-removal-heda",
        "summary": "Suraju urged the government under President Muhammadu Buhari and his political party, the All Progressives Congress, to prioritise the revamp of the country's refineries and tackle corruption in the petroleum sector before removing fuel subsidy.\nHe expressed concerns over the state of the Nigerian petroleum industry and criticised the government's plan to remove fuel subsidy without addressing corruption and revamping moribund refineries.\n\"Corruption and mismanagement have plagued the Nigerian petroleum industry, leading to the poor state of the country's refineries,\" the statement said.\n\"Therefore, HEDA called on the government to take concrete steps to revamp the refineries and clean up corruption bedevilling the sector.\nThis includes implementing policies that promote transparency and accountability, ensuring a transparent process in the award of contracts, and appointing officials to oversee the refineries' revamp."
    },
    {
        "url": "https://saharareporters.com/2023/06/06/fuel-subsidy-edo-government-reduces-workdays-three-week-civil-servants-increases-salary",
        "summary": "Godwin Obaseki, Edo State Governor, has reduced the number of work days that civil and public servants are required to be at workplaces from five days a week to three days a week, among other measures.\n\"The Edo State Government shares the pains of our people and wants to assure everyone that we are standing with them in these very challenging times.\nTherefore, the Edo State Government is hereby reducing the number of work days that civil and public servants will have to commute to their workplaces from five days a week to three days a week till further notice.\nWorkers will now work from home two days every week.\n\"Similarly, fibre optic connections are being made available to help our people work remotely, thereby reducing their cost of transportation.”"
    },
    {
        "url": "https://saharareporters.com/2023/05/14/fuel-subsidy-close-leakages-collecting-world-banks-800-million-loan-hamzat-lawal-tells",
        "summary": "The Chief Executive Officer of Connected Development (CODE), Mallam Hamzat Lawal, has advised the Nigerian government to close all leakages that could fuel corruption before proceeding with its plans to access $800 million from the World Bank.\nLawal also stated that the Nigerian government’s continued fuel subsidy payment is unacceptable and has to end.\nHe said, “For me, it is about closing these gaps and leakages beyond collecting $800 million.\nIt is only $800 million that we know about, but there are other interventions and loans that government would collect and have been collecting that are not in the public domain.\nLawal added that the National Assembly must call for a public hearing concerning the loan, noting that it will help address all concerns."
    },
    {
        "url": "https://saharareporters.com/2023/08/15/kenya-reinstates-fuel-subsidy-after-months-violent-protests",
        "summary": "Kenya has reinstated a small subsidy to stabilise retail fuel prices for the next 30 days, the energy regulator says.\nAfter taking office in September, President William Ruto removed fuel and maize flour subsidies put in place by his predecessor, saying he preferred subsidising production rather than consumption.\nAnnouncing the end of fuel subsidy, Ruto said subsidies were a temporary solution to a permanent problem and that they were unsustainable.\nBut the subsidy cuts as well as recent tax hikes have increased living costs and contributed to violent anti-government protests in recent months.\nLike Kenya, Nigeria also removed fuel subsidy, which has also led to high cost of goods and services."
    },
    {
        "url": "https://saharareporters.com/2023/06/17/living-conditions-now-tough-benin-republic-citizens-over-fuel-subsidy-removal-nigeria",
        "summary": "The motorbikes and cars she normally supplies are no longer stopping to stock up on her cheap gasoline, which is smuggled in from neighbouring Nigeria.\nThat is now higher than the petrol in service stations at the market price of around 650 CFA a litre.\nIn Nigeria, fuel prices have also tripled since Tinubu ended the subsidies, with food, transport and power prices feeling the knock-on effect.\nIn front of gas stations that still have fuel to sell, long queues are now visible at peak times.\nAt the Benin border post of Seme-Krake, on the Atlantic coast, the usual hustle of currency traders, sellers, transporters and small traders involved in gasoline trafficking may have slowed, but another activity persists."
    },
    {
        "url": "https://saharareporters.com/2023/06/26/nigerias-oil-corporation-nnpcl-marketers-claimed-fuel-subsidies-pipelines-never-existed",
        "summary": "Yuguda, who was governor of Bauchi State between 2007 and 2015, spoke while featuring on Channels TV morning programme, SunriseDaily on Monday.\n\"We came across a situation where subsidy was claimed on pipelines that never existed,\" the former Minister of State for Transport and Aviation between 2003 and 2005 stated.\nAsked whether NNPCL was the one making the claim, he said, \"Of course, it is the NNPC, those that pumped are those in the subsidy scam.\nHe, however, maintained that both marketers and NNPCL are all involved in the subsidy scam in Nigeria.\n“So the subsidy regime as I said should have gone way back in 2012/2013."
    },
    {
        "url": "https://saharareporters.com/2023/08/27/tinubu-government-gagging-governor-obaseki-speaking-truth-power-about-fuel-subsidy",
        "summary": "The Edo State government has accused President Bola Tinubu-led Nigerian government of gagging the state governor, Godwin Obaseki, for speaking the truth about the President's fuel subsidy palliatives, abandoned federal roads in the state and other policies of the federal government.\nIdris told Obaseki that the 2023 elections were over and that he should show more statesmanship.\n\"The claim that Governor Godwin Obaseki failed to attend the National Economic Council (NEC) meetings is blatantly false.\nThe governor has attended all NEC meetings since the onset of this administration and records are there to prove this fact.\n\"Records of Edo State Government’s performance are also available for Nigerians to verify."
    },
    {
        "url": "https://saharareporters.com/2023/05/31/fuel-subsidy-instruct-nnpcl-withdraw-its-outrageous-pricing-template-nigerian-workers",
        "summary": "The Nigerian Labour Congress (NLC) has called on the President Bola Tinubu-led federal government to immediately instruct the Nigerian National Petroleum Corporation Limited (NNPCL) to withdraw its \"vexatious Pricing template\" to allow free flow of discussions with the government on subsidy removal.\nIt had been reported that President Tinubu announced during his inaugural speech on Monday at the Eagle Square, Abuja that there would be no more fuel subsidy.\nReacting to the new pricing template, the NLC opposed it declaring that Nigerians would not accept any manipulations of any kind from any of the parties especially from the representatives of the Government.\nDescribing it as unacceptable, NLC President said \"we seriously condemn it\" adding that \"good faith negotiation is key to reaching agreement.\n\"We call on the federal government to immediately instruct the NNPC to withdraw this vexatious Pricing template to allow free flow of discussions by the parties."
    },
    {
        "url": "https://saharareporters.com/2023/06/04/fuel-subsidy-removal-distraction-misgovernance-nigerias-political-class-law-society",
        "summary": "The President of the Nigerian Law Society (NLS), Kunle Ogunba (SAN), has said that fuel subsidy is not Nigeria’s problem.\nHe described the recent removal of fuel subsidy as cheap government propaganda to divert Nigerians’ attention from the misgovernance and “irresponsibility within the political class\".\n\"Why should the masses be offered the wrong end of the stick all of the time?\nFrom the way it has set out with the phantom subsidy issue, it is clearly premeditated and unfortunate.\nHe, however, called for peace and patience, encouraging Nigerians to limit their movement and to avoid panic buying of fuel."
    },
    {
        "url": "https://saharareporters.com/2023/06/10/nigerian-workers-nlcs-surrender-tinubu-government-fuel-subsidy-disappointing-joint",
        "summary": "The Joint Action Front (JAF) has tackled the leadership of the Nigerian Labour Congress (NLC) over the suspension of the nationwide strike on the removal of fuel subsidy by the President Bola Tinubu government.\nThe statement reads: “The Joint Action Front (JAF) receives with disappointment the suspension of the strike that was scheduled to commence on Wednesday, July 7 by the Nigeria Labour Congress against the criminal hike in petrol price under the guise of fuel subsidy removal.\n“At the moment, millions of workers and poor Nigerians are finding it hard to go out daily to earn their living.\nUnfortunately, the trade unions leadership’s capitulatory approach of negotiating for palliatives, which even, if granted, will not cushion the effect of the subsidy removal for the majority of the population!\nThe same bourgeois rule of law has a maxim that says one who comes into equity must come with clean hands."
    },
    {
        "url": "https://saharareporters.com/2023/08/02/labour-unions-demand-reversal-hikes-school-fees-subsidy-removal-adamawa-0",
        "summary": "The organised labour in Adamawa State on Wednesday joined their counterparts across the country to protest against the removal of subsidy on Premium Motor Spirit (PMS), otherwise known as petrol.\nThe members of labour unions took to major streets in Yola, the state capital to demand the immediate and unconditional restoration of subsidy on PMS.\nThe unionists also demanded the reversal of hikes in school fees in federal schools, among other demands.\nOn July 29, 2023, SaharaReporters reported that the University of Jos announced hike in school fees from N45,000 to N213,000, an increment of over 300 percent.\nAccording to the new school fees chat signed by the Registrar of the university, the N213,000 fee is for 100 200-level students while the 300-level students and above will now pay N160,000."
    },
    {
        "url": "https://saharareporters.com/2023/06/06/fuel-subsidy-nigerian-labour-movement-has-credibility-problem-they-are-bed-system-sowore",
        "summary": "The presidential candidate of the African Action Congress (AAC), Omoyele Sowore, has lambasted the Nigerian Labour Congress (NLC) and the Trade Union Congress (TUC), saying that most labour movements in the country have credibility problem as most of them are in bed with the system.\nSowore said this while speaking in an exclusive interview on MIC ON following the NLC and TUC earlier announcement of Wednesday planned nationwide strike action over the removal of fuel subsidy.\nThe labour movement has now suspended the nationwide action after a meeting with the Nigerian government on Monday.\nYou will not hear from the labour movement because most of them are in bed with the system.\n“And I am not afraid to say this publicly that the labour movement has a credibility problem.”THE LABOUR MOVEMENT HAS CREDIBILTY PROBLEM; MOST ARE IN BED WITH THE SYSTEM - @yeleshoFind out more via our YouTube channel."
    },
    {
        "url": "https://saharareporters.com/2023/06/28/nigerians-share-their-coping-strategies-amid-inflation-created-fuel-subsidy-removal",
        "summary": "Since the fuel subsidy was removed following its announcement by President Bola Tinubu during his inauguration on May 29, 2023, Nigerians have been embracing a range of tactics and strategies to alter their lifestyles to meet the country's market inflation.\nPresident Tinubu, in his inauguration speech, announced the removal of fuel subsidy, saying there was no provision for it and could no longer be justified.\nFor example, commercial drivers across the country raised transport fares, claiming that the withdrawal of the fuel subsidy had automatically resulted in an increase in their operating costs.\nBut now, definitely, the time has been reduced because of the fuel situation.\n“Since the removal of fuel subsidy, things have been hard."
    },
    {
        "url": "https://saharareporters.com/2023/06/11/civic-group-serap-drags-president-tinubu-court-failing-probe-21billion-missing-fuel",
        "summary": "The organisation is also seeking a mandamus ruling for President Tinubu to urge anti-corruption authorities to examine government gasoline subsidy payments since 1999, identify and humiliate alleged culprits, and retrieve any proceeds of crime.\n“The NNPC also reportedly failed to account for the allocation of crude oil to refineries in 2019.\nThe Department of Petroleum Resources (DPR) in 2019 also reportedly failed to remit US$1,278,364,595.49 in revenue to the Federation Account.\n“The DPR in 2019 also paid N137,225,973.35 to contractors and consultants for various contracts and consultancies but failed to deduct stamp duty.\n“The DPR also paid N11,856,088,271.92 as salaries for 2019 but failed to deduct N118,560,882.72 as the contribution of 1% Industrial Training Fund (ITF)."
    },
    {
        "url": "https://saharareporters.com/2023/08/02/petrol-subsidy-removal-too-hasty-no-thought-out-plan-cushion-effects-nigerians-labour",
        "summary": "Barnabas Simon, the Bayelsa State chairperson of the Nigeria Labour Congress (NLC), has said the removal of subsidy on Premium Motor Spirit, otherwise called petrol, by the government was too hasty.\nSimon lamented that there was also no thought-out plan by the government to cushion the effects of the subsidy removal on Nigerians.\nHe said this on Wednesday during a protest in Yenagoa, the state capital against the removal of fuel subsidy and the general hardship in the country.\n“The essence of the protest is against inhuman treatment occasioned by the removal of the fuel subsidy,” he said.\n“The removal of fuel subsidy was hasty with no thought-out plan to cushion the effects on workers and other Nigerians already at the poverty belt."
    },
    {
        "url": "https://saharareporters.com/2023/07/13/house-reps-approves-tinubu-request-source-n500billion-budget-palliatives-cushion-effects",
        "summary": "This is to source N500 billion from the budget to provide palliatives to cushion the effect of fuel subsidy removal in the country.\nThe fund is to “source for funds to provide necessary palliatives to cushion the effect of the recent removal of fuel subsidy in Nigeria,” the letter from the President read.\n“The request has become necessary in other to source for funds to provide necessary palliatives to cushion the effect of the recent removal of fuel subsidy in Nigeria.\n“The sum of N500 billion only has been extracted from the 2022 appropriation act of N819.536 for the provision of palliatives to Nigerians to cushion the effect of fuel subsidy removal.\nI expect that the House will speedily consider the request.”The House on Thursday considered the President’s request and granted approval."
    },
    {
        "url": "https://saharareporters.com/2023/06/03/fuel-subsidy-nigerian-union-journalists-joins-wednesdays-national-strike-asks-members",
        "summary": "The Nigeria Union of Journalists (NUJ) has stated its plan to withdraw its services across the country over the social unrest and hardship unleashed on Nigerians by the announcement of fuel subsidy removal by President Bola Tinubu.\nAccording to the union, with President Tinubu’s announcement of the fuel subsidy removal in his inaugural speech, there is already an astronomical increase in the prices of petroleum products and high inflation which have drastically reduced the purchasing power of citizens.\nThe statement read, “An emergency Central Working Committee meeting of the Union was convened online today, Saturday, June 3, 2023, to discuss issues surrounding the decision by the Federal Government to remove Fuel Subsidy and the position taken by the Nigeria Labour Congress.\n“After presentations by the National President, Chris Isiguzo, and the National Treasurer Bamidele Atunbi on the position taken by NLC on the matter, members unanimously adopted the position of NLC on the issue.\n“Accordingly CWC directs all State Councils of the Union to mobilise members to withdraw their services and commence protests nationwide from Wednesday next week, 7th June, 2023, if the Nigerian National Petroleum Company Limited (NNCPL) refuses to reverse the new price regime in the oil sector.”"
    },
    {
        "url": "https://saharareporters.com/2023/06/05/farooq-kperogi-tinubu-and-dangers-subsidy-removal-rejoinder-emeka-orjih",
        "summary": "Early this morning, I read Farooq Kperogi's 3rd June piece titled \"President Tinubu and Dangers of Subsidy Removal\"His is an interesting argument.\nHe posits that PMS subsidy should remain.\nNigerians are paying nearly the equivalent of $4.60 per gallon of petrol (using the official exchange rate).\nIf we use the black market exchange rate, its much higher than that\"_This is simply faulty arithmetic.\nFacilitating the creation and development of new local economies and industries in partnership with the private sector and the development sector."
    },
    {
        "url": "https://saharareporters.com/2023/06/01/fuel-subsidy-why-petrol-prices-will-soon-come-down-nigerian-company-nnpcl",
        "summary": "The Nigerian National Petroleum Company Limited (NNPCL) has claimed that with time, the current high pump price of premium motor spirit (PMS) popularly known as fuel will come down.\nSaharaReporters had reported that queues returned to fuel stations across Nigeria after President Bola Tinubu announced at his inaugural speech that “fuel subsidy is gone” which was immediately followed by sudden increase in the petrol pump price.\nThe NNPCL adjusted its petrol pump price to between N488 and N557 across all the 36 states of the federation and FCT, Abuja on Wednesday, saying that it had adjusted the fuel pump price to reflect the market realities.\nThe NNPCL boss claimed that the move would ensure healthy competition which would ultimately lead to a downward review of pump prices of petroleum products across the country.\nThis means that prices in the market can go down at any time and of course, the market will adjust itself.”"
    },
    {
        "url": "https://saharareporters.com/2023/09/05/we-knew-fuel-subsidy-should-go-played-politics-2012-occupy-nigeria-protest-under",
        "summary": "Kayode Fayemi, former Governor of Ekiti State, has said that the protest against the fuel subsidy removal during former President Goodluck Jonathan's administration in 2012, by the defunct Action Congress of Nigeria (ACN) and other opposition political parties, was basically premised on political interests.\nOn January 1, 2012, then-President Jonathan announced the removal of fuel subsidy and adjusted the official fuel pump price from N65 per litre to N141, but the opposition political parties unleashed mass protests tagged, ‘Occupy Nigeria’ to kick against it.\n“What we need is alternative politics and my own notion of alternative politics is that you can’t have 35 percent of the vote and take 100 percent.\n“All political parties in the country agreed and they even put in their manifesto that the subsidy must be removed.\nBut we in ACN at the time, in 2012, we know the truth, Sir, but it is all politics."
    },
    {
        "url": "https://saharareporters.com/2023/05/29/just-petrol-queues-resurface-after-president-tinubu-announced-fuel-subsidy-removal",
        "summary": "Petrol stations in Lagos started witnessing queues few hours after President Bola Tinubu announced that “fuel subsidy is gone”.\nSaharaReporters earlier reported that the newly inaugurated Nigerian president officially announced the removal of fuel subsidy, saying that there was no provision for it.\nHe had said he was informed that there was no provision for fuel subsidy, adding that it could no longer be justified.\nHe said, “Fuel subsidy is no more.\n“No provision for fuel subsidy.”He said there would be a “thorough house cleaning,” adding that the interest rate would be reduced."
    },
    {
        "url": "https://saharareporters.com/2023/06/09/fuel-subsidy-we-cant-be-feeding-smugglers-doing-father-christmas-neighbouring-countries",
        "summary": "President Bola Tinubu has maintained that the fuel subsidy removal he announced during his inaugural speech on May 29, was the best thing as fuel subsidy was the elephant that was going to bring Nigeria to its knees.\nPart of the statement quoted Tinubu as saying, “I am grateful that you are paying attention to what I have been doing.\nYou have paid attention to the subsidy removal.\nWhy should we in good heart and sense, feed smugglers and be Father Christmas to neighbouring countries, even though they say not every day is Christmas?\nIt is only when we have prosperity for the country that we can create jobs that will employ our youths.”"
    },
    {
        "url": "https://saharareporters.com/2023/06/22/nigerias-daily-fuel-usage-drops-41million-litres-67million-after-subsidy-removal",
        "summary": "Nigerian Vice President, Kashim Shettima, has claimed that fuel consumption in Nigeria has reduced from 67 million litres per day to 41 million litres per day since President Bola Tinubu's current regime eliminated the petrol subsidy.\nHe said, “This is just the beginning because it was a fait accompli to withdraw the fuel subsidy.\nWe either get rid of the fuel subsidy or the fuel subsidy gets rid of the Nigerian nation.\nIn 2012, we spent $10 billion on fuel subsidy alone,” explained the Nigerian vice-president.\nHe added, “Last month, we were purportedly consuming 67 million litres per day, but after the removal of the subsidy, it dropped to 41 million litres per day, nearly four per cent off."
    },
    {
        "url": "https://saharareporters.com/2023/08/05/government-keeps-blaming-corrupt-elites-removal-fuel-subsidy-failed-prosecute-anyone",
        "summary": "Sowore noted that to justify the implementation of the removal of the fuel subsidy, the government keeps blaming elites who corruptly benefited from the programme, but failed to produce anyone or even prosecute them for the crime of stealing $10 billion annually.\nWhy are we punishing the victims of the corruption in the implementation of the subsidy programme?\nThey rolled out a student loan programme with so many conditionalities.\n“It is interesting that those who are defunding Nigerian education and advocating student loans have all stolen Nigeria’s money and have used it to educate their own children overseas.\nAre their own children taking student loans in their universities in the UK and the US?"
    },
    {
        "url": "https://saharareporters.com/2023/06/04/aac-directs-members-join-labour-union-nationwide-strike-says-fuel-subsidy-class-war",
        "summary": "The African Action Congress (AAC), one of the political parties that participated in Nigeria’s 2023 general elections, has directed its members across the country to join the Nigerian Labour Congress (NLC) and the Trade Union Congress (TUC) proposed nationwide strike.\nThe strike is scheduled to start on Wednesday over the announcement of fuel subsidy removal by President Bola Tinubu.\nThe party, while commending the labour unions’ firm rejection of the fuel subsidy removal by the Nigerian government, described the subsidy removal as a class war against Nigerians.\n“When you subtract from the Lagos price and the old fixed price, Nigerians are forced to pay N293 for every litre of fuel.\nIt said, “While the Labour Movement was hoodwinked to endorse a neo-liberal candidacy endorsing the same fuel subsidy removal at the last Presidential Election, the AAC notes that the new labour leadership insisted against the whole gamut of subsidy removal."
    },
    {
        "url": "https://saharareporters.com/2023/03/21/were-not-hopeful-inflation-will-go-down-because-fuel-subsidy-will-soon-be-removed",
        "summary": "Godwin Emefiele, the Governor of the Central Bank of Nigeria (CBN), has said that he is not optimistic that inflation will go down despite some tightening measures being implemented by the bank, noting that fuel subsidy will soon be removed.\nAccording to the governor of the apex bank, subsidy removal has its own implications, which is inflation.\nThe CBN governor added that most likely before the end of May, fuel subsidy will be removed.\nBut between August and even now, the rate increase is only about 1.4%.\nBecause of the timing measures that have been adopted by the CBN.”Emefiele said it doesn’t follow that because “we're tightening, inflation should immediately begin to drop”."
    },
    {
        "url": "https://saharareporters.com/2023/08/16/impact-removal-fuel-subsidy-legal-practice-nigeria-evans-ufeli-esq",
        "summary": "The effect of the removal of fuel subsidy on the activities of legal practitioners nationwide, and the judiciary in general, in Nigeria is far-reaching.\nThis is a critical issue at this time, in a country like ours, where there are no social support systems available to cushion the effects of a radical policy of government on the fuel subsidy removal.\nThe reality of legal practice in the post subsidy regime is a huge challenge to the Judicial sector.\nThe cost of running the daily administrative activities of the Courts have increased in the post subsidy removal regime.\nEvans Ufeli is a Lagos based lawyer and principal partner, The Chambers of Evans Ufeli (RABBI SOLICITORS)"
    },
    {
        "url": "https://saharareporters.com/2023/06/01/cushion-effects-fuel-subsidy-removal-nigerians-address-widespread-hunger-unemployment",
        "summary": "A human rights advocacy organisation, Amnesty International has urged the Nigerian authorities to protect the people most affected by its removal of fuel subsidy.\nDuring his inaugural speech on Monday, May 29, President Bola Tinubu announced an end to Nigeria’s fuel subsidy, citing budgetary concerns.\nThe announcement led to a steep rise in fuel prices and widespread panic-buying of fuel.\nBut in a statement on Thursday, Isa Sanusi, Acting Director for Amnesty International Nigeria said the government has a duty to cushion the impact of the subsidy removal on Nigerians.\nSanusi said, “President Bola Tinubu’s decision to remove the fuel subsidy has left millions of Nigerians terrified about the knock-on effects that it will have on their daily lives."
    },
    {
        "url": "https://saharareporters.com/2023/06/12/revolutionary-socialist-movement-demands-return-fuel-subsidy-reversal-fuel-price-n195",
        "summary": "The Revolutionary Socialist Movement (RSM) has demanded the immediate return of the fuel subsidy which was removed by President Bola Tinubu during his inaugural speech on May 29, 2023.\nThe Revolutionary Socialist Movement (RSM) argues that the crisis in the oil sector is a direct consequence of capitalist greed.\n“We demand the public prosecution of all individuals involved in the fuel subsidy scam.\n“RSM firmly believes that a socialist revolutionary change is needed, and it is crucial to build such a movement.\nTo achieve socialist revolutionary change in Nigeria, we need a new mass workers' party that is dedicated to revolution in this country."
    },
    {
        "url": "https://saharareporters.com/2023/07/10/dont-allow-fuel-subsidy-saved-be-looted-government-officials-pyrates-warn-president",
        "summary": "The statement read in part, “The President Bola Tinubu administration must be bold to block several leakages in the financial system of the government.\nIt is not enough to remove petrol subsidy but concerted efforts must be put in place to ensure that monies saved are not stolen again, as it was in the past.\nPresident Bola Tinubu must demonstrate the political will to tame corruption.\n”President Bola Tinubu must continue with the drastic reforms in the operations of the Nigeria National Petroleum Corporation Limited.\nThe President Bola Tinubu administration must take a definite stand on retaining ownership of the refineries to promote efficiency."
    },
    {
        "url": "https://saharareporters.com/2023/05/31/get-ready-massive-protests-against-fuel-subsidy-socialist-party-urges-nigerian-workers",
        "summary": "“These two anti-people policies (petrol price increase and devaluation of the Naira) will have further devastating consequences for already poor living standards of working people.\nThe desperation to increase petrol price is also connected to the desire to guarantee huge profits for Dangote and oil marketers.\n“Tinubu also said that his administration will unify the exchange rate of Naira, which means allowing the so-called market forces to determine the exchange rate, another term for devaluation of currency.\nAgain, allowing the private speculators to determine the exchange rate will most likely spiral higher exchange rate than the black market rate which is currently at about N770 to a dollar.\n“The Socialist Party of Nigeria (SPN) is opposed to a hike in petrol price as a consequence of subsidy removal and devaluation of Naira."
    },
    {
        "url": "https://saharareporters.com/2023/06/02/marketers-should-be-blamed-fuel-crisis-ex-president-buhari-already-made-decision-remove",
        "summary": "The state governors on the platform of the ruling All Progressives Congress (APC), under the aegis of the Progressive Governors’ Forum (PGF), have condemned the price increase on premium motor spirit (PMS) by the oil marketers.\nWhile reiterating their support for the removal of subsidy on petrol, the governors noted that it was the administration of former President Muhammadu Buhari, under the National Economic Council (NEC), led by former Vice President, Yemi Osinbajo, that removed fuel subsidy.\nSaharaReporters earlier reported that following President Bola Tinubu’s announcement of fuel subsidy removal on Monday during his inaugural speech, the NNPCL on Wednesday morning released a list of adjusted pump prices for its mega stations across the 36 states of the federation and the Federal Capital Territory, Abuja.\nThe governors accused oil marketers of inflicting pains on Nigerians after Tinubu’s pronouncement at his inauguration that fuel subsidy was gone.\nWhile reiterating their support for the removal of subsidy on petrol, Uzodinma said the decision for fuel subsidy removal was reached by the administration of President Muhammadu Buhari, under the National Economic Council (NEC), led by former Vice President Yemi Osinbajo, when they came to the realisation that it was no longer possible to fund subsidy."
    },
    {
        "url": "https://saharareporters.com/2023/09/04/civil-society-leaders-back-nlcs-planned-strike-action-says-tinubu-should-remove",
        "summary": "The United Action Front of Civil Society, the umbrella platform for organised civil society on issues of governance and democracy, has declared support for the two-day warning strike declared by the Nigeria Labour Congress (NLC).\nThe strike was declared to protest against the hardship in the country foisted on the masses through the removal of fuel subsidy as announced by President Bola Tinubu in his inaugural speech on May 29.\nAccording to the organisation, the warning strike which is slated to begin on Tuesday, September 5, has become “highly inevitable in light of the emerging realities which have clearly shown that the government is being deceptive and mercurial with its fuel subsidy removal regime, which has been characterised by flip-flopping and uncertainty”.\n“We make bold to challenge the Tinubu government to demand accountability for the fraudulent fuel subsidy payments and wasteful debt servicing policy of the preceding Buhari administration if it genuinely wishes to be taken seriously by Nigerians.\nThe leadership of the organisation therefore urged the “working people to comply with the directive of the NLC, while the masses of the Nigerian civil society demonstrate support for Labour by holding complimentary mass action to draw home their displeasure about the inhuman treatment of Nigerian citizens through sudden unilateral removal of fuel subsidy and the ill-conceived economic policies of government”."
    },
    {
        "url": "https://saharareporters.com/2023/06/02/fuel-subsidy-nigerian-labour-congress-releases-communique-lists-12-grounds-nationwide",
        "summary": "The Nigerian Labour Congress has released its communiqué confirming the nationwide strike by next week Wednesday to protest against the fuel subsidy removal by the newly inaugurated President Bola Tinubu-led government.\nThe NLC listed 12 grounds on which the nationwide action must go on, while digging out humongous corruption and unaccounted funds spent by the Nigerian government and the Nigerian National Petroleum Company Limited (NNPCL) under the guise of fuel subsidy.\nThis comes amid fuel shortages across the country occasioned by President Bola Tinubu’s inaugural speech in which he declared that “fuel subsidy is gone”.\nThat it was unlawful for the federal government to have announced the withdrawal of the Subsidy on PMS.\nThat discussions were already on and understanding reached with government on the conditions precedent before the withdrawal of subsidy on PMS."
    },
    {
        "url": "https://saharareporters.com/2023/01/09/petrol-subsidy-organised-crime-nigeria-ill-remove-it-immediately-if-elected-president",
        "summary": "The presidential candidate of the Labour Party, Peter Obi, has described petrol subsidy as an organised crime.\nHe, therefore, vowed to remove the subsidy immediately if elected the next president in the February election.\n\"Fuel subsidy is an organised crime and I will remove it immediately, if I am elected President.\n\"Which reasonable country will spend more on subsidy than Education, Health etc.\nSubsidy, I have said it before, is organised crime and I will not allow it to stay a day longer,” Obi said."
    },
    {
        "url": "https://saharareporters.com/2023/05/31/tinubu-announced-fuel-subsidy-removal-without-increasing-minimum-wage-n250000-nigerians",
        "summary": "Sowore, who opposes the fuel subsidy removal said while the minimum wage for Nigerian workers remains at N30,000, those who are supporting the fuel subsidy removal have not been able to pay their way to work following the sudden fuel price hikes across the country, which have led to hikes in transport fares.\n“Worker’s minimum wage is N30k per month, @officialABAT just stumbled a few times at his inauguration and the only thing he could say was “Fuel Subsidy” is gone!\nAnd now those who claimed this is good for Nigeria are stranded at home unable to pay their way to work.\n“Those who said an increase in minimum wage would lead to inflation are not saying a 300% increase in fuel price will kill everyone, even the middle class (if there exist any).\nIn Awka, Anambra State capital, some private filling stations are currently selling fuel between N520 and N700 per litre."
    },
    {
        "url": "https://saharareporters.com/2023/06/01/fuel-subsidy-labour-congress-nlc-has-lost-competence-speak-nigerians-after-previous",
        "summary": "The Coalition of Northern Groups (CNG) on Thursday alleged that Nigeria Labour Congress (NLC) has stripped itself of every strand of credibility, public trust and confidence.\nThe group noted that NLC has developed a penchant over the years for mass public deception over issues of serious national importance.\nThe statement reads, \"The Coalition of Northern Groups (CNG) notes with sadness that the Nigeria Labour Congress (NLC) has developed a penchant over the years for mass public deception over issues of serious national importance.\n\"Government should device compassionate ways of cushioning the impact of the subsidy removal without necessarily compromising its economic recovery policies.\n\"We demand from the Federal Government action to call the syndicate that have siphoned the trillions of Naira of public funds during the previous regime in the name of a fictitious, fraudulent oil subsidy to account."
    },
    {
        "url": "https://saharareporters.com/2023/06/24/my-may-29-inaugural-speech-excluded-fuel-subsidy-i-had-stop-it-day-one-president-tinubu",
        "summary": "President Bola Tinubu on Friday admitted that his May 29 swearing-in speech had no fuel subsidy address but he had to mention it because fuel subsidy was a “scam” and disincentive to growth.\nAccording to the statement, addressing Nigerians in France, Tinubu explained that the Special Adviser on Monetary Policy, Wale Edun and Alake had excluded fuel subsidy removal from his inaugural speech, “but he felt it was expedient to stop the subsidy on the first day”.\nThis marked the first time the President would publicly comment on his May 29 inaugural speech, in which he declared that “fuel subsidy is gone.”“We have transport challenges, electricity challenges, infrastructural challenges and others.\nThe comment on fuel subsidy had sparked a near-instant hike in prices and hoarding, leading to calls for protests by the Nigeria Labour Congress (NLC).\nThis is despite former President Muhammadu Buhari’s early moves to end the payment of fuel subsidy by June."
    },
    {
        "url": "https://saharareporters.com/2023/06/07/fuel-subsidy-nigerians-can-no-longer-rely-labour-movements-nlc-tuc-after-such-betrayal",
        "summary": "A Labour Party’s House of Representatives aspirant from the Eti-Osa Federal Constituency, Lagos State, Ayo Ademiluyi has stated that the Nigerian masses can no longer depend on the labour unions – the Nigeria Labour Congress and the Trade Union Congress – on the fight against the fuel subsidy removal.\nAdemiluyi added on Wednesday that the new betrayal by the NLC and TUC had only confirmed that their ideological acceptance of the fuel subsidy removal in the first instance, while claiming to be \"fighting for concessions\".\n“STATE OF LABOUR PARTY - I cannot proceed in my commentary on the fuel subsidy removal without commenting on the current state of Labour Party as a whole.\nWithout fail, he would have equally implemented the fuel subsidy removal just as Tinubu has done.\n“The Labour Party is a party formed with the money of the sweat of rank and file workers."
    },
    {
        "url": "https://saharareporters.com/2023/07/02/serap-writes-president-tinubu-seeks-spending-details-n400billion-saved-through-fuel",
        "summary": "According to reports, the Nigerian Government has saved N400bn within four weeks following the implementation of the policy on the removal of payment of subsidy on petrol.\n“Publishing the details of the spending of the savings would promote transparency, accountability, and reduce the risks of corruption in the spending of the funds,” it added.\nThe letter read in part: “SERAP is concerned that the savings from subsidy removal may be embezzled, misappropriated or diverted into private pockets.\n“Opacity in the spending of the savings from subsidy removal would have negative impacts on the fundamental interests of the citizens and the public interest.\n“We would be grateful if the recommended measures are taken within 7 days of the receipt and/or publication of this letter."
    },
    {
        "url": "https://saharareporters.com/2023/06/05/reverse-fuel-subsidy-removal-its-attack-livelihoods-survival-working-nigerians-informal",
        "summary": "Former President Muhammadu Buhari in 2022 said the government would remove fuel subsidy, hence, there was no provision for fuel subsidy in the 2023 appropriation bill.\nThe fuel subsidy removal received the backing of the candidates of the All Progressives Congress, Peoples Democratic Party and Labour Party, Bola Tinubu, Atiku Abubakar and Peter Obi respectively.\nHowever, President Tinubu’s announcement that there was no more fuel subsidy during his inaugural speech has since generated floods of both criticisms and praises while Nigerians have been thrown into hardship with the automatic fuel price hikes across the country.\nHowever, FIWON in a statement signed by its General Secretary, Gbenga Komolafe, called on the government and President Tinubu to immediately reverse the price hikes.\n\"The latest subsidy removal and consequential hike in the pump price of petroleum is yet another attack on the livelihoods and survival of working people in the informal sector which currently employs over 70% of the Nigerian working population."
    },
    {
        "url": "https://saharareporters.com/2023/06/04/president-tinubu-and-dangers-subsidy-removal-farooq-kperogi-right-reply-felix-ayanruoh",
        "summary": "It is instructive to note that the President Tinubu did not speak of agricultural subsidy but fuel subsidy– which is fossil fuel subsidy in the US.\nThe issue of fossil fuel removal in the US depends on which side of the political divide you belong to.\nIt is imperative to state that every Democrat elected government is for fossil fuel subsidy removal why every Republican elected government who are for “Big Oil” is against fossil fuel removal.\nOil subsidy has metamorphosed into a growing liability to Nigeria’s budgetary allocations for almost four decades.\nA large portion of NNPC’s withholding is spent on fuel subsidy payments, which are vulnerable to misappropriation and excessive spending."
    },
    {
        "url": "https://saharareporters.com/2023/05/30/fuel-subsidy-removal-will-not-take-effect-immediately-president-tinubu-reacts-backlashes",
        "summary": "President Bola Tinubu has stated that the fuel subsidy removal announcement he made during his inaugural speech on Monday will not take effect immediately.\nSaharaReporters reported that fuel queues surfaced immediately Tinubu made his speech, with fuel prices going up as high as N350 per litre in the major cities of Lagos, Abuja, Port Harcourt and other locations.\nSeveral interest and civic groups have called on Tinubu not to begin his administration on a draconian note for Nigerians but should be circumspect on the fuel subsidy removal.\nIn a tweet, the Tinubu through his media centre said the fuel subsidy removal was not immediately but a process that had been on.\n“He was merely communicating the status quo, considering that the previous administration’s budget for fuel subsidy was planned and approved to last for only the first half of the year."
    },
    {
        "url": "https://saharareporters.com/2023/09/10/subsidy-removal-serap-gives-36-nigerian-governors-7-days-provide-details-spending",
        "summary": "The Nigerian Government recently disbursed N2 billion out of the N5 billion palliative package for each state of the federation and the Federal Capital Territory (FCT), to cushion the impact of the removal of fuel subsidy.\nAccording to the organisation, \"Nigerians have the right to know how their states are spending the fuel subsidy relief funds.\n\"Transparency and accountability in the spending of the N2 billion and any subsequent disbursement to your state would help to reduce the risk of corruption, mismanagement, diversion, or opportunism,\" it said.\n\"The constitutional principle of democracy also provides a foundation for Nigerians' right to know details on spending of the N2 billion fuel subsidy palliative.\n\"The effective operation of representative democracy depends on the people being able to scrutinise, discuss and contribute to government decision making, including on the fuel subsidy relief funds."
    },
    {
        "url": "https://saharareporters.com/2023/06/02/n413billion-subsidy-payments-house-reps-investigate-loan-central-bank-tells-president",
        "summary": "The House of Representatives Ad-hoc Committee has launched an investigation into the N413 billion funds borrowed from the Central Bank of Nigeria (CBN) for subsidy payments.\nChairman of the Committee, Ibrahim Mustapha Aliyu, who submitted the report to the House during the plenary on Thursday appealed to the government to introduce intermodal, regional and national transport systems to ease mass movement of people across the country as a way to cushion the effects of subsidy removal.\nThe report partly read: “The House do consider the Report of the Ad–hoc Committee on the Need to Investigate the Petroleum Products Subsidy Regime in Nigeria from 2013–2022 and approve recommendations therein.\n“That the Federal Government should immediately design measures and palliatives to cushion the effects of the subsidy removal for Nigerians effective from this year 2023 through the provision and procurement of CNG Busses as an alternative Transport System with Cheaper Fuel Consumption.\nThe government should also introduce intermodal, regional and national transport system to ease mass movement of people across the country.”It added, “With the subsidy removal, the Federal Government should forthwith suspend all Direct Sales Direct Purchase (DSDP) contracts."
    },
    {
        "url": "https://saharareporters.com/2023/06/04/probe-missing-21billion-n31trillion-subsidy-payments-unremitted-funds-nigerian-petroleum",
        "summary": "The Socio-Economic Rights and Accountability Project (SERAP) has urged President Bola Tinubu to probe allegations of oil revenue funds.\nThe letter read in part: \"Any removal of fuel subsidy should not be used as a ploy to keep the poor in poverty while those who allegedly stole oil revenues and fuel subsidy payments keep their ill-gotten wealth.\n\"Allegations of corruption in oil revenues and fuel subsidy payments suggest that the poor have rarely benefited from the use and management of the revenues and payments.\"\n\"The NNPC also failed to account for N4,572,844,962.25 of 'domestic gas receipts', thereby 'reducing the distributable revenue in the Federation account.'\n\"The NNPC also in 2019 failed to account for 22,929.84 litres of PMS pumped from refineries and valued at N7,056,137,180.00."
    },
    {
        "url": "https://saharareporters.com/2023/06/08/nigerian-petroleum-company-nnpcl-not-transparent-fuel-subsidy-failed-remit-n84trillion",
        "summary": "The Revenue Mobilisation Allocation and Fiscal Commission, RMAFC has disclosed that the Nigeria National Petroleum Company Limited (NNPCL) withheld the sum of N8.480trillion meant for the Federation Account, as petrol subsidy, between January last year and now.\nThe Chairman of the commission, Mohammed Shehu, in a statement in Abuja, said that the subsidy regime was not transparent.\nHe maintained that the decision to end the subsidy was the best for the nation, as the whooping sum had remained not reconciled.\nAccording to him, “It is saddening to note that since 1st January, 2022 to date, the Nigeria National Petroleum Company Limited (NNPCL) has not been contributing to the Federation Account due to the claimed subsidy payments.\nShehu called on President Tinubu take action against all the economic saboteurs who have contributed to the nation’s economic woes in accordance with the extant laws of the federation."
    },
    {
        "url": "https://saharareporters.com/2023/05/30/nationwide-industrial-strike-looms-civil-societies-warn-president-tinubu-reject-planned",
        "summary": "Some civil society organisations have called on Nigerians to reject the fuel subsidy removal by the new administration of President Bola Tinubu, as angry reactions continued to trail his declaration on Monday.\nDescribing such pronouncement as an anti-poor and neo-liberal policy, they regretted that President Tinubu was not as vehement and declarative with plans to curb corruption and reduce waste associated with flamboyant cost on governance.\nSaharaReporters reported on Monday that shortly after President Tinubu announced the total removal of subsidy on petrol otherwise known as fuel, queues returned in major petrol stations across the country especially in Lagos and Abuja.\nReacting in separate statements to the uncertainties the announcement has brought into the economy in less than 24 hours and its attendant consequences, the civil society organisations berated the new president, advising President Tinubu to rescind the decision.\nThe groups in their statements condemned the decision of the new government to withdraw subsidies on fuel without providing alternatives."
    },
    {
        "url": "https://saharareporters.com/2023/06/26/buhari-didnt-remove-fuel-subsidy-so-apc-could-win-februarys-presidential-election-garba",
        "summary": "Former President, Muhammadu Buhari led-administration didn't remove subsidy on the Premium Motor Spirit (PMS) otherwise known as fuel because its attendant consequences could have led to the ruling All Progressives Congress (APC) losing the February 25 presidential election, his media aide has revealed.\nBuhari's Senior Special Adviser on Media and Publicity, Garba Shehu, disclosed this in a release on his Twitter handle which was titled: \"Buhari Didn’t Fail To Remove Subsidy\".\n\"Why did it take the new Tinubu/ Shettima presidency weeks to remove the petrol subsidy when Buhari didn’t do so for years fails to ask the right question?\nThe former presidential media adviser maintained that though, \"Buhari didn’t remove the petrol subsidy – but in vitally important stages he removed every other budget-busting, egregious, economic-growth-crushing subsidy along the way\".\nThe Buhari administration in its last days could not have gone the whole way because the APC had an election to win."
    },
    {
        "url": "https://saharareporters.com/2023/08/06/serap-sues-president-tinubu-over-failure-publish-spending-details-n400billion-fuel",
        "summary": "The Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Bola Tinubu over its administration's “failure to publish spending details of about N400 billion so far saved as a result of the removal of subsidy on Premium Motor Spirit (PMS) popularly called petrol.”The suit followed reports that the Nigerian Government saved N400 billion within four weeks following the removal of subsidy on petrol policy.\nIn the suit, SERAP is arguing that: “Nigerians have the right to know how the savings are spent.\nDisclosing the spending details of the savings would reduce the risks of corruption in the spending of the funds.”SERAP also said, “The Tinubu government has a legal obligation to ensure that the savings from the removal of subsidy on petrol are spent solely for the benefit of the 137 million poor Nigerians who are bearing the brunt of the removal.\n“The Nigerian Constitution, 1999 [as amended], Freedom of Information Act, and the country’s anti-corruption and human rights obligations rest on the principle that citizens should have access to information regarding their government's activities.\n“Prevention of corruption in the spending of savings from the removal of subsidy on petrol and preventing and addressing the challenges caused by the removal are serious and legitimate public interests.”No date has been fixed for the hearing of the suit."
    },
    {
        "url": "https://saharareporters.com/2023/07/05/no-economy-survives-high-cost-energy-buhari-removed-fuel-subsidy-2016-restored-it-win",
        "summary": "President Buhari removed subsidy in 2016, where he jacked up the price of PMS from N87 he inherited in 2015 to N145 and declared subsidy gone.\n“As the time, Buhari was preparing for his own election, so he restored subsidy so that he could win the election.\n\"Why will subsidy removal lead to loss of election?\n\"In 2022, the global amount of money spent to subsidise energy was $1.3 trillion.\nWhen government subsidise energy globally, they are doing it to boost productivity.”According to Dahiru, “they have scammed us”."
    },
    {
        "url": "https://saharareporters.com/2023/01/05/nigerians-shouldnt-pay-more-fuel-sowore-speaks-petrol-subsidy",
        "summary": "The presidential candidate of the African Action Congress, Omoyele Sowore, has said \"Nigerians shouldn't pay more for fuel” adding that “it should be their right\".\nSowore said this during an interview on Arise TV’s Morning Show on Thursday while replying to a question on fuel subsidy.\nWhen asked if he would keep or remove fuel subsidy despite the budget deficit that would be inherited by the next leader.\n\"They have been made to pay huge fines to the US government when they are not even doing the kind of businesses they are doing in Nigeria,\" Sowore said.\n“One of the badges claimed to be bringing subsidised fuel to Nigeria had sunk 20 years before."
    },
    {
        "url": "https://saharareporters.com/2023/06/07/fuel-subsidy-removal-kill-corruption-not-nigerian-people-kazeem-olalekan",
        "summary": "There is no gainsaying the fact that the NLC is being hypocritical on their stance as regards fuel subsidy removal.\nAs a matter of fact, I believe that their call for protest against the removal of subsidy was hypocritical considering the fact that they even supported and campaigned for a Presidential candidate who advocated for subsidy removal during electioneering campaign.\nSo, it amounts to reckless lie and mere wishful thought to claim that the removal of fuel subsidy would translate into improved funding of social services that the people will directly benefit from.\nThe government should not just come up to declare subsidy removal as a means of fighting corruption but they must be ready to make everyone who have benefitted from it answerable to the people.\nNigerians want fuel subsidy, but we disgust that it is the rich oil barons that are reaping the funds."
    },
    {
        "url": "https://saharareporters.com/2023/04/27/nigerian-government-suspends-removal-fuel-subsidy-slated-june",
        "summary": "The Nigerian government on Thursday suspended its plans to remove fuel subsidy on the petroleum products by the end of President Muhammadu Buhari’s administration.\nThe Independent Petroleum Marketers Association of Nigeria (IPMAN) had kicked against subsidy removal, stressing that the move should be suspended, because the President Muhammadu Buhari administration did not provide the required factors for subsidy removal.\nShe stated that the council deliberated on the matter and resolved that the subsidy could not be removed for now.\nAlso, northern youths under the aegis of the Northern Youth Council of Nigeria (NYCN) had vowed to stop the fuel subsidy removal by the President Muhammadu Buhari-led Nigerian government.\nThe Northern youths, while threatening to resist the proposed fuel subsidy removal by all means, had expressed concern over the potential impact of fuel subsidy removal on “already struggling economy and the Nigerian people.”"
    }
]