{
    "NO LOCATION": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/27/1.html",
            "summary": "According to him, successive polls indicated that the ruling party would have lost the 2023 election, if the Petroleum Industry Act, containing the petrol subsidy removal, was implemented earlier.\nIn the statement, titled \u0091Buhari Didn\u0092t Fail To Remove Subsidy\u0092, Shehu wrote: \u0093Why did it take the new Tinubu/Shettima presidency weeks to remove the petrol subsidy, when Buhari didn\u0092t do so for years \u0097 fails to ask the right question.\nBuhari didn\u0092t remove the petrol subsidy \u0096 but in vitally important stages, he removed every other budget-busting, egregious, economic-growth-crushing subsidy along the way.\n\u0093That\u0092s why it\u0092s important to remind ourselves \u0096 and all those who have conveniently forgotten \u0096 that the Buhari administration had been on this pathway from the very beginning in 2015.\nThe Buhari administration, in its last days, could not have gone the whole way because the APC had an election to win."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/20/4.html",
            "summary": "President, Nigeria Labour Congress (NLC), Joe Ajaero (middle) during a press briefing shortly after the Federal Government\u0092s meeting with NLC/TUC over subsidy removal at the Presidential Villa, Abuja.\nThis was the kernel of discussion as representatives of the Federal Government and leadership of the Nigeria Labour Congress (NLC) and the Trade Union Congress of Nigeria (TUC), yesterday, met in resumed talks on petrol subsidy removal palliative.\nFasua said this on Channels Television yesterday, while also hitting out at NLC for making such an outrageous demand as minimum wage for Nigerian workers.\nHe said: \u0093I honestly feel that it would be insane for the government to agree to increase the minimum wage from N30,000 to between N150,000 and N200,000 if you ask me.\nMEANWHILE, the National Industrial Court yesterday reiterated that its order restraining NLC and TUC from embarking on industrial action subsists."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/19/4.html",
            "summary": "Gbajabiamila said the Federal Government had promised to provide a framework for the maintenance of roads and expansion of rail networks across the country.\nAlready, the National Economic Council (NEC) at the weekend, recommended palliatives for workers and vulnerable groups to ameliorate the harsh effects of fuel subsidy removal.\nAmong the 14 items presented, it said a representative of governors would be a party to the communiqué and all the governors must commit to implementing the new minimum wage.\nBy the time we get there, we will also look at what they will come up with and negotiation will start.\n\u0093Our target is to ensure that there are living allowances for workers before we zero into the issue of minimum wage, which is a constitutional matter."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/8/316.html",
            "summary": "THE Depots and Petroleum Products Marketers Association of Nigeria (DAPPMAN) yesterday in Abuja pledged its support for the Federal Government\u0092s removal of fuel subsidies.\nAkpani said the buses would be locally manufactured and would use Compressed Natural Gas as fuel.\n\u0093We pledge our support for President Tinubu in the bold decision of removing petrol subsidy.\n\u0093Removal of subsidy is not about making fuel costly and taking it out of the reach of Nigerians.\nIt is about getting it right on the real issue of petroleum product subsidy."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/28/1.html",
            "summary": "Poor and economically-insecure households also face an equivalent monthly income loss of N5,700, the Bank also projects in its Nigeria Development Update (NDU) released yesterday in Abuja.\n\u0093Reaching 20 million beneficiary households will lift four million people out of poverty.\nNDU argues that not many poor Nigerians benefited directly from the subsidy payment, though.\nThe report is also particularly concerned about the negative impacts of inflation on Nigerians and businesses.\nThe report also raises concern about the rising debt servicing to revenue ratio and its impacts on the country\u0092s fiscal position."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/3/28.html",
            "summary": "Elder statesman and chieftain of the New Nigeria Peoples Party (NNPP), Buba Galadima has disagreed with the method employed by President Bola Tinubu in removing fuel subsidy in the country.\nAccording to Galadima, if he was Tinubu, he could have done it differently.\nAccording to Galadima who spoke on Monday during an interview on Arise Television, President Tinubu should have first inquired on why and how this fuel subsidy keeps accumulating and got it got Nigerians to the level it did.\nHe said, \u0093If I were him (Tinubu), I could have done it differently.\nI could have inquired on why and how this fuel subsidy keeps accumulating and got us to this level where we are."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/12/40.html",
            "summary": "President Bola Ahmed Tinubu on Wednesday wrote to the National Assembly seeking an amendment to the 2022 supplementary appropriation Act.\nThis was disclosed in a letter read on the floor of the House during Wednesday\u0092s plenary by Speaker Tajudeen Abbas.\nThe President said the money will be sourced from the 2022 supplementary Appropriation Act of N819.\nThe Speaker said the House will consider Tinubu\u0092s request at plenary on Thursday and asked members willing to make contribution to be prepared to \u0091do so\u0092.\nThe letter titled: \u0093Request for the amendment of the 2022 appropriation act\u0094 reads in part: \u0093I write to request the approval of the House of Representatives an amendment of the 2022 appropriation act in accordance with the law."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/13/24.html",
            "summary": "The House of Representatives has made adjustments to the 2022 supplementary appropriation act to accommodate President Bola Tinubu\u0092s request.\nThey have approved sourcing 500 billion naira from the approved budget to help Nigerians in the wake of the petrol subsidy removal.\nThis change happened swiftly, only a day after the president\u0092s request, passing the 2nd and 3rd readings rapidly.\nThe legislators also urged President Tinubu to use the funds as conscientiously as possible.\nIn a related development, President Tinubu has plans for the money: 12 million families are set to receive N8,000 over the course of six months."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/323.html",
            "summary": "Primate Elijah Ayodele of INRI Evangelical Spiritual Church, has asked President Bola Tinubu to increase workers\u0092 minimum wage to N100,000.\nThe cleric said an increase in the minimum wage would cushion the effect of subsidy removal instead of the proposed N8,000 palliatives to 12 million households.\nHe said the minimum wage should be increased to N100,000 if, indeed, the government has the people at heart.\nHe stated, \u0093If truly the government is concerned about the masses, the minimum wage should be increased to N100,000.\nMinimum wage increase will have a direct impact on the people than N8,000 palliative."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/105.html",
            "summary": "The leader of INRI Evangelical Spiritual Church, Primate Elijah Ayodele has condemned the N8,000 palliatives to 12 million households by President Bola Tinubu, saying the proposed plan will only benefit the rich and not poor Nigerians.\nIn a statement signed by his media aide, Osho Oluwatosin, Primate Ayodele noted that the N8,000 palliatives will only lead to corruption and will not reach out to the poor masses that need it.\nHe mentioned that the palliatives will not have any serious impact on the people because of corruption among politicians.\nThe cleric posited that N8,000 palliative will be a total waste of time because it won\u0092t work for its purpose due to corrupt practices that will mar the process.\n\u0091\u0092The N8,000 palliative is corruption, I see nothing in the palliative and it will not reach out to the poor masses."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/11.html",
            "summary": "In May, former President Muhammadu Buhari had asked the Senate to approve the loan request despite the public outcry it generated.\nIn passing that amended supplementary budget, the Senate approved N500 billion for palliatives and other capital expenditure to cushion the effect of the recent subsidy removal policy.\nAccording to them, with about 133 million Nigerians that are multi-dimensionally suffering from poverty, N8,000 for six months, which translates to N48,000 in six months, will neither eradicate nor alleviate poverty in 12 million household\u0092s lives.\n\u0093On the $800 million loan, our position remains that N8,000 to 12 million poor Nigerians is laughable.\nN48,000 for 12 million Nigerians to alleviate poverty and you impose a life of long suffering on the people."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/309.html",
            "summary": "By Olugbenga Ige The organised labour has kicked against the plan by the Bola Tinubu government to pay N8,000 monthly to 12 million households to cushion the effect of the fuel subsidy removal.\nThe government also stated that the money would be transferred directly to identified beneficiaries\u0092 accounts.\nHe said, \u0093The issue is whether the President has trust and confidence in the Steering Committee set up or not.\nIf he has a budget already, it means that he already has activities he has planned on his own.\n\u0093Will it make any significant impact in addressing the consequences already being faced by Nigerians?"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/307.html",
            "summary": "Human rights activist, Omoyele Sowore has berated President Bola Tinubu\u0092s administration over its announcement to pay the sum of N8,000 to 12 million Nigerian families for six months to cushion the effects of petrol subsidy removal.\nNaija News reports that Tinubu had unveiled plans to transfer N8,000 to 12 million poor households in the country.\nHe urged the House of Representatives to secure the loan.\nReacting to the development, Sowore described Tinubu\u0092s administration as a government of \u0091renewed shege\u0092.\nSpeaking via Twitter, the political activist lamented that the Federal Government has no respect for the Nigerian people."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/37.html",
            "summary": "Veteran Nigerian singer, Eedris Abdulkareem has reacted to President Bola Tinubu\u0092s administration decision to pay the sum of N8,000 to 12 million Nigerian families for six months to cushion the effects of petrol subsidy removal.\nNaija News reports that Tinubu had unveiled plans to transfer N8,000 to 12 million poor households in the country.\nHe said the money would be sent to poor Nigeria within the next six months.\nThe president\u0092s plan was contained in a letter to the House of Representatives over the 800 million dollars loan requests of former President Muhammadu Buhari\u0092s administration for the social safety net program.\nHe urged the House of Representatives to approve the loan."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/310.html",
            "summary": "Political analyst, Charles \u0093Charly Boy\u0094 Oputa has mocked the plan by the Bola Tinubu government to pay N8,000 monthly to 12 million households to cushion the effect of the fuel subsidy removal.\nReacting in a tweet via his Twitter handle on Thursday, Charly Boy said the Tinubu government is using the same format used by the Muhammadu Buhari administration to distribute palliatives to Nigerians during the COVID-19 pandemic.\nThe Labour Party (LP) supporter, therefore, described the All Progressives Congress (APC) as a fraud.\nHe wrote: \u0093APC Yahoo Yahoo Same Format.\nWe Must Also Teach Nigerians How To Fish \u0096 Omokri Reacts To Tinubu\u0092s N8,000 Monthly Palliative"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/28.html",
            "summary": "Phrank Shaibu, the Special Assistant on Public Communications to former Vice President Atiku Abubakar, has described President Bola Tinubu\u0092s plan to hand out N8,000 to 12 million households for six months as a joke and an attempt to divert public funds.\nSo, with Tinubu\u0092s uninspiring plan, each individual in a household will get ?1,600 per month or ?53 per day.\nThis must be a joke or a more sinister attempt to divert public funds.\u0094 Shaibu also argued that the Tinubu administration lacked a clear economic policy apart from taxing Nigerians.\nHe added: \u0093The so-called palliatives that Tinubu seeks to share to the poor are just another avenue to divert public funds.\nThe scheme is nothing but a means to use public funds to prosecute political campaigns and objectives."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/15/32.html",
            "summary": "An Igbo interest group, Coalition of South East Youth Leaders (COSEYL) has condemned plans by President Bola Tinubu to pay N8,000 to 12 million households as subsidy palliative.\nThe N8,000 stipend is to be paid monthly within a duration of six months to homes of low income earners.\nSpeaking via a press statement signed by its President General, Goodluck Ibem, the group described the plan as a Greek gift.\nThey insisted that it is impossible for a meagre sum of N8,000 to thoroughly cushion the hardship caused by the fuel subsidy removal.\nThe group said: \u0093It is a Greek Gift for President Tinubu to say he wants to pay 12 million Nigerians N8000 a month when he is the same person that makes it impossible to use N8000 just to cook a pot of soup for a family of three, by removing fuel subsidy which has been paid for till July 2023 by the former administration.\u0094Speaking further, they alleged that Tinubu\u0092s plan was simply to siphon the resources of the nation."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/15/23.html",
            "summary": "By Tayo ElegbedeSpeculations have emerged that Senate President Godswill Akpabio and other senators, including Adeola Yayi, allegedly padded President Bola Tinubu\u0092s palliative budget with over N200 billion.\nThe N500 billion will be taken from the N819 billion Supplementary Appropriation Act.\nOne of the sources said, \u0093Akpabio and Adeola Yayi inserted over N200 billion into Tinubu\u0092s palliative budget.\n\u0093Akpabio, Senator Jibrin Barau, and Senator Adeola Yayi are the major architects of the budget padding,\u0094 another source said.\n-N1.25 billion for the construction of some rural roads in Abiakpo Ikot Essien-Ikono to ease the movement of farm produce."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/16/800.html",
            "summary": "By Soonest NathanielProminent human rights lawyer, Femi Falana, has condemned the National Assembly\u0092s decision to allocate N70 billion as palliatives for its members, labeling it as illegal and contemptuous.\nFalana emphasized the callousness and insensitivity displayed by the National Assembly, especially when considering the economic hardships endured by the majority of Nigerians.\nFalana stressed that these judgments remain valid and binding, and the National Assembly\u0092s actions are therefore illegal and contemptuous.\nHe called on the leadership and members of the National Assembly to reverse the controversial allowances and the purchase of luxury vehicles.\nOtherwise, we are going to commence contempt proceedings against the Chairman of the RAMFC and the leaders of both Chambers of the National Assembly."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/16/309.html",
            "summary": "President Tinubu By Peter Duru, Makurdi • it\u0092s either equivalent of $150 monthly or other options The Campaign for Equal Rights and Opportunities for all Nigerians, CERON, has described the Federal Government\u0092s proposed N8,000 monthly palliative for 12million poor Nigerian households to cushion the harsh effect of the fuel subsidy removal as a mockery of the poor.\nThe group insisted that the said sum which would be given for six months would amount to \u0093a paltry N48,000 which is worth almost nothing in the present day Nigeria.\u0094 CERON in a statement issued weekend in Makurdi by its Executive Secretary, Francis Odiir, urged the government to jettison the idea of giving out the said amount and opt for non monetary palliative.\nHe said: \u0093The government can opt for other forms of palliative other than cash, that would impact the goods and services that directly affect the lives of the ordinary citizens because the proposed N8,000 is not only too meagre, it amounts to a mockery of the poor.\n\u0093But if the government insists on giving out cash, then it should be looking at the equivalent of at least a minimum of $150 monthly for the said beneficiaries.\n\u0093If the government cannot do that for the suffering masses then there is no need for that gesture which we all know will not add any kind of value to the living condition of the suffering masses."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/17/304.html",
            "summary": "Nigerian activist, Aisha Yesufu has reacted to the proposed plan by the Federal Government to distribute N8000 monthly palliatives to 12 million households.\nNaija News recalls that some days back, President Bola Tinubu had asked the senate to approve a borrowing request of $800 million.\nThe president\u0092s request was contained in a letter read by the senate president, Godswill Akpabio during plenary.\nTinubu, in the letter, explained that the loan would be used to scale up the national social safety net programme.\nHe also assured that the Federal Government would transfer the sum of N8,000 monthly to 12 million poor and low-income households for six months."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/17/306.html",
            "summary": "By Enioluwa Adeniyi The 10th Senate has denounced reports alleging it manipulated the 2023 Supplementary budget that was approved last week, calling these allegations mischievous.\nThis will be managed by the National Assembly Bureaucracy.\nIt\u0092s pertinent to also note that the National Assembly complex does not house only the Legislators.\n\u0093The alleged padding of the palliative budget by the national assembly only exists in the minds of those who are all out to discredit the 10th Assembly.\n\u0093We wish to urge fellow compatriots to see the national assembly as partners in the progress of Nigeria.\u0094 NAIJANEWSNEWS SECTIONS"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/18/28.html",
            "summary": "By Justina Otio Famous Nigerian Catholic priest, Rev Fr Chinenye Oluoma, has urged President Bola Tinubu to desist from his plan of sharing N8,000 to 12 million Nigerian household.\nThe clergyman described it as \u0093puerile, penny wise pound foolish economics\u0094.\nThe cleric, while praising the removal of fuel subsidy, opined that the funds should be invested into job creating ventures such as transportation and agriculture.\nHe wrote, \u0093I am a supporter of the removal of fuel subsidy for obvious reasons.\nThe corruption in fuel subsidy is child play compared to the one in sharing 8k to 12 million Nigerians."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/18/200.html",
            "summary": "What this means all this while is that the government is seeking ways of robbing the very poor Nigerians so that the rich can become richer.\nIt is not a product of social dialogue, which would have produced collectively negotiated outcomes by critical national stakeholders.\n\u0093NLC would not want to continue to be part of the usual charade of Committees with outcomes that are never implemented.\nWe would not want to waste the time of Nigerians, especially workers, on Committees that have already been programmed to fail and thus ignored.\nWe do not want to provide a cover for the government to get away with the hardship it has imposed on the people."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/19/100.html",
            "summary": "DAILY POST reports that the amendment was passed in both chambers of the National Assembly barely 24 hours after President Bola Ahmed Tinubu forwarded the request to the parliament.\n\u0093While the masses of Nigeria are groaning under the excruciating economic pains unleashed on them by the ruling class, the National Assembly has awarded N228.7 million to each newly elected legislator.\nOn its part, the Socio-Economic Rights and Accountability Project, SERAP, indicated readiness to sue the Federal Government over the allocation of the N70 billion to the National Assembly, which it described as ill timed.\nHowever, two members of the House of Representatives recently defended the National Assembly in the wake of the controversy.\n\u0093Most of the members of the National Assembly did not return; most of us are new members."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/19/38.html",
            "summary": "By Ignatius Igwe The Colleges of Education Academic Staff Union (COEASU) has directed union members to go to work twice a week in view of the current hike in petrol prices occasioned by the removal of fuel subsidy.\nThe President of the Union, Smart Olugbeko, in a statement on Wednesday, said the union members could no longer survive on the current minimum wage.\nOlugbeko said members of the union would not return to full work till the Federal Government agreed to COEASU\u0092s demand of 200 percent increase in salary.\n\u0093The implementation of the removal of fuel subsidy by the Federal Government two months ago raised the price of a litre of petrol by 250%.\nWhile our capabilities to sustain hope were already exhausted, the price of petrol rose further to N650 per litre."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/20/110.html",
            "summary": "By Seun Opejobi The 2023 African Action Congress, AAC, presidential candidate Omoyele Sowore has described President Bola Tinubu\u0092s administration as a \u0091Yahoo Yahoo\u0092 government.\nSowore made the remark while condemning the subsidy removal and the proposed palliative of the Federal Government.\nHe wondered what the Federal Government has done with the money accrued since the removal of fuel subsidy, stressing that no road has been constructed.\nThey are all lying that subsidy is not good for Nigerians, subsidy is the only thing that Nigerians enjoy, and they themselves are following it up.\nNothing has changed in Nigeria, and the only thing subsidy has brought is hardship and suffering.\u0094 DAILY POSTNEWS SECTIONS"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/20/2.html",
            "summary": "This is second meeting of the Council and it is expected to deliberate on the reviewed palliative package for Nigerians following petrol subsidy removal.\nThe National Economic Council (NEC) meeting is being held at the Council Chambers of the State House in Abuja on Thursday.\nThe meeting, which is being chaired by the Vice President Kashim Shettima, has in attendance governors of the 36 states of the Federation, the Director General of the Nigerian Governors\u0092 Forum, as well as stakeholders from the World Bank and other agencies of government.\nThis is second meeting of the Council and it is expected to deliberate on the reviewed palliative package for Nigerians following the removal of petrol subsidy and the recent hike in petrol prices to up to N617/litre as a result of market forces.\nPresident Bola Tinubu had unveiled his administration\u0092s plan for a monthly N8,000 transfer to 12 million of the poorest households in the country for six months, in a bid to cushion the effects of the removal of fuel subsidy."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/22/303.html",
            "summary": "Lawyer and political analyst, Dele Farotimi said the ruling All Progressives Congress, APC-led government does not care about the ordinary Nigerians in its subsidy palliative approach.\nFarotimi stated this while speaking in an interview with Arise Television on Friday.\nAccording to him, the measures have not adequately addressed the realities and concerns of the common people in Nigeria.\nRecall that, in a meeting on Thursday, the National Executive Council (NEC) had agreed on palliative measures for Nigerians.\nThe NEC meeting, chaired by Vice President Kashim Shettima and also attended by governors of the 36 states of the Federation, agreed that cash transfers would be done via state social registers instead of national social registers subject to state peculiarities."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/24/3.html",
            "summary": "President Bola Tinubu\u0092s U-turn on proposed N8, 000 monthly palliative for 12 million vulnerable households didn\u0092t come as a surprise to many.\nAccording to the President, the money transfer to poor households would have a multiplier effect on about 60 million individuals.\nYou may also wish to note that the purpose of the facility is to expand coverage of shock-responsive safety net support among the poor and vulnerable Nigerians.\n\u0093That the N8,000 conditional cash transfer programme envisaged to bring succour to most vulnerable households be reviewed immediately.\nThe government should admit it has failed and reverse the policy of subsidy removal, which is causing the fuel hike."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/29/17.html",
            "summary": "By AdewaleMomoh, Akure • Seeks Solutions To Alleviate Mass Suffering The pan-Yoruba socio-political organisation, Afenifere, has lashed out at the All Progressives Congress-led administration over the state of the country\u0092s economy, which it said has continued to take its toll on Nigerians.\nThe group denounced the Senate\u0092s motion, titled, \u0093Let The Poor Breathe,\u0094 which it perceived as a mockery of the suffering populace.\n\u0093Nigeria, despite being touted as the 55th largest economy in the world, currently ranks 142 out of 167 on the global prosperity index, with the expected total number of Nigerians plunged into the deep end of multidimensional poverty reaching 133 million before the end of 2024.\n\u0093It is feared that this latest gross act of thoughtless policy implementation and its unintended consequences will further push Nigeria\u0092s economy down the slope as Nigeria has officially overtaken India as The New Poverty Capital of the World.\u0094 Afenifere further stressed that the sudden manner in which the subsidy was removed caught many off guard, as it was announced without due consideration for its impact on the people and the economy.\nGUARDIANNEWS SECTIONS"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/31/310.html",
            "summary": "By Victor Young, Johnbosco Agbakwuru & Chidi Nkwopara, OWERRIThe Catholic Bishops Conference of Nigeria, CBCN, yesterday raised the alarm that the removal of fuel subsidy without cushioning the effects has put the country on the brink of collapse.\nThe bishops\u0092 alarm came as Nigeria Employers Consultative Association, NECA, pleaded with the Federal Government to urgently address the pains of the people arising from the removal of subsidy on petrol.\nIndeed, Nigeria is on the brink of collapse.\n\u0093Government has not ceased to inundate citizens with it\u0092s fabled palliative measures to cushion the effects of the subsidy removal.\n\u0093The complex employment inter-relationship between successive Nigerian governments, organized labour (NLC/TUC), and the Nigeria Employers Consultative Association, NECA, has been challenging, especially between government and organized labour."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/1/26.html",
            "summary": "In a statement on Monday, hours after the President\u0092s special broadcast to Nigerians on his plans to alleviate the suffering of the citizens, NLC President, Joe Ajaero, said \u0093the promises and assurances made by President Tinubu is not the silver bullet that Nigerians expected\u0094.\n\u0093The speech indeed appears to be out of touch with reality and anomalous with the hardship and suffering that most Nigerians are going through now,\u0094 the NLC leader said.\nTinubu had removed subsidy on petrol during his epic inauguration speech on May 29, 2023, with a litre of the petrol jumping from N184 to over N620 and food prices and general inflation galloping at an unprecedented rate.\nIn his address on Monday, Tinubu promised to review workers\u0092 salaries and minimum wage.\nHe also announced a N75 billion palliative for the manufacturing sector, saying 75 businesses would benefit within a nine-month period spanning the third quarter of 2023 to the first quarter of next year."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/2/1.html",
            "summary": "Rising yesterday from the rescheduled Presidential Steering Committee on Palliatives meeting with Organised Labour, comprising NLC and Trade Union Congress (TUC), there had been insinuations that the labour leaders would rethink its planned nationwide protest.\nNLC President, Joe Ajaero, said the Congress neither reconsidered nor suspended the nationwide mass protest.\nAlso, General Secretary of NLC, Emmanuel Ugboaja, in a phone interview, told The Guardian: \u0093The protest is going on tomorrow (today).\nThe coalition noted that the fuel subsidy removal, though painful, has resulted in some economic gains for the country, the benefits that will manifest soon.\nHe applauded President Tinubu for finding it compelling to address the nation given the difficulties Nigerians are facing since the withdrawal of fuel subsidy."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/4/305.html",
            "summary": "But, Falana described the loan from the World Bank as illegal and contravenes the laws in the country, as against the position of the World Bank.\n\u0093If the government goes ahead to regard it as a loan, Nigerians have the right to challenge the illegality of the loan.\nFalana, while urging the World Bank to cancel the loan, said, \u0093The world bank has copies of these laws, and they must respect the sovereignty of Nigeria.\n\u0093There are situations where the World Bank cancels loans, [and for me] this is one of such situations.\u0094 He also accused the World Bank of supporting the Nigerian government in the removal of fuel subsidy.\n\u0093It is the contribution of the World Bank to the campaign for the removal of fuel subsidy."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/5/106.html",
            "summary": "According to NAN, the Chairman of the LGA, Mr Segun Odunmbaku, disclosed this on Saturday while marking his two years in office.\nHe said the release of the mini-buses was part of the palliative measures by his administration to cushion the effects of the fuel subsidy removal on the people of Ojodu and its environs.\n\u0093With the level of deficit infrastructure that we met, it was necessary for us to have a vision and narrow down our needs into these four acronyms.\u0094DAILY POST recalls that President Bola Ahmed Tinubu had urged states to roll out palliatives to cushion the effect of fuel subsidy removal nationwide."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/7/5.html",
            "summary": "Similarly, the over $15.1billion being used to import PMS alone into the country may still be going into the economy of other nations, a development which mocks the Federal Government\u0092s subsidy removal.\n\u0093I am mindful of the high misery index in the economy with high inflation, high unemployment and high borrowing rate.\nGoing on strike because of subsidy removal will actually complicate the path to resolving the economic crisis in the presence of a declining economic growth.\nWe are also being told that Dangote Refinery will commence production in 2024,\u0094 Adenikinju said.\nThe Executive Director of Extractive Industries Transparency Initiative, Faith Nwadishi, who decried the high cost of living, noted that the last government had promised to get the refineries working but failed."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/16/20.html",
            "summary": "Experts, including a former statistician general of the country and head of NBS, Yemi Kale, had predicted at least 30 per cent headline inflation on account of subsidy removal.\nThe latest report shows a seven-month consecutive rise in the nation\u0092s inflation rate, defying efforts by the Central Bank of Nigeria (CBN) to keep it down with its various monetary policy measures.\nAccording to NBS the headline inflation rate for July 2023 increased to 24.08 per cent compared to 22.79 per cent recorded in June 2023.\nNBS said the rise represented an increase of 1.29 per cent points from the June 2023 headline inflation.\nThe CBN, on its part, also raised the Monetary Policy Rate from 18.5 per cent to 18.75 per cent to rein in inflation."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/23/30.html",
            "summary": "The Health Sector Affected Naija News reports that the removal of fuel subsidies has had a damning effect on the Nigerian health sector.\n\u0093As expected, the price of hospital commodities like drugs, laboratory reagents, and instruments have been rising since the advent of fuel subsidy.\nShe further stated that the fuel subsidy removal may likely make it impossible for the health insurance industry to thrive.\nYeah, primarily, the fuel increase actually affects transportation more.\nBecause if you go to the farmers now and ask them why yeah, I mean, why they\u0092re increasing the cost of cassava, they will tell you the transportation cost is too much."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/26/12.html",
            "summary": "The leadership of the House of Representatives has set aside N150 million for each member to carry out projects in their constituencies, totalling N54 billion.\nNaija News reports that a member of the Green Chamber, who pleaded for anonymity, made this known during an interview with The Punch on Friday.\nThe lawmaker said the constituency allowances are part of the few privileges available to lawmakers to impact their various constituencies directly.\nHe said, \u0093In the House of Reps, our constituency allowance is N150m.\nThis is the only opportunity we have to help our constituencies with one or more projects."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/2/323.html",
            "summary": "By Emperor Simon This comes amid fuel shortages across the country occasioned by President Bola Tinubu's inaugural speech in which he declared that \"fuel subsidy is gone\".\nThe Nigeria Labour Congess (NLC) has declared a nationwide strike from next Wednesday.\nThis comes amid fuel shortages across the country occasioned by President Bola Tinubu\u0092s inaugural speech in which he declared that \u0093fuel subsidy is gone\u0094.\nNLC President Joe Ajaero made the announcement after an emergency meeting of the union\u0092s National Executive Council (NEC) in Abuja.\nOn the organised labour\u0092s side, the NLC National President, Joe Ajaero; and the President of the Trade Union Congress of Nigeria (TUC), Festus Osifo, were present."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/1/105.html",
            "summary": "Nigerian famous entertainer and socio-political activist Charles Oputa, known by his stage name, Charly Boy, has thrown his weight behind the decision of President Bola Tinubu to remove fuel subsidy.\nThere has been public outcry over the skyrocketed new pump price of petroleum products following the removal of the subsidy.\nThe Petroleum Motor Spirit, PMS, is currently sold above N500 per litre in many parts of the country.\nReacting to the controversies surrounding the development, Charly Boy, a staunch supporter of the presidential candidate of the Labour Party in the last election, Peter Obi, backed the removal, saying there is no better time than now."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/may/31/2.html",
            "summary": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has said subsidy removal is very important to Nigeria economy.\nIPMAN spokesperson Yakubu Suleiman on Channels Television\u0092s Sunrise Dailyprogramme on Wednesday said the move is the only way to make Nigeria great.\nDuring his inaugural speech after he was sworn in on Monday, President Bola Ahmed Tinubu announced the removal of fuel subsidy.\n\u0093Subsidy can no longer justify its ever-increasing costs in the wake of drying resources.\n\u0093We commend the decision of the outgoing administration in phasing out the petrol subsidy regime which has increasingly favoured the rich more than the poor.\u0094"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/may/31/114.html",
            "summary": "By Donatus Anichukwueze The NLC President, Joe Ajaero, doubted that the Dangote Refinery can take care of 30% of the needs of Nigerians.\nThe Nigerian Labour Congress (NLC) says the recently launched Dangote Petrol Refinery may not take complete care of the needs of Nigerians and may not bring down prices of petroleum products in the country.\nAjaero said, \u0093First, I commend Dangote Refinery but the provision of having dictatorship of the market especially in the private sector is dangerous.\nWhat is Dangote Refinery going to produce?\nSo Dangote has done well, but can Dangote take care of 30% of the needs of Nigerians?\u0094 Ajaero queried."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/may/31/113.html",
            "summary": "By Kayode Oyero NLC National President, Joe Ajaero said President Bola Tinubu should have asked questions and find out the implications of fuel subsidy removal on Nigerians before proceeding with the decision.\nFederal Government representatives are expected to meet with the leadership of the Nigeria Labour Congress (NLC) today by 2pm over the planned removal of fuel subsidy.\nHe said the President should have asked questions and find out the implications of fuel subsidy removal on Nigerians on the streets.\nSubsidy Removal Only Answer To Make Nigeria Great \u0096 IPMAN Meanwhile, the Independent Petroleum Marketers Association of Nigeria (IPMAN) has said that the deregulation of the oil sector and subsidy removal is the only way to make Nigeria great.\nThe Nigerian National Petroleum Company Limited (NNPCL) has since backed Tinubu on the removal of fuel subsidy."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/may/31/11.html",
            "summary": "By Justina Otio A chieftain of the Peoples Democratic Party (PDP), Ayodele Fayose on Wednesday reacted to the removal of the fuel subsidy by President Bola Ahmed Tinubu\u0091s administration.\nFayose tweeted, \u0093On this removal of fuel subsidy, I am convinced that President Tinubu has taken the best and the wisest decision for the collective good of Nigeria and its people.\n\u0093Most importantly, too, the immediate past govt already removed fuel subsidy technically by not making provision for it in the 2023 budget.\n\u0093Removing the fuel subsidy is the best thing to do and it has to be done once and for all.\n\u0093No doubt, President Tinubu is not a magician who can manufacture money."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/2/320.html",
            "summary": "Kyari said, \u0093I\u0092m aware that Mr president has directed some engagements and some palliatives will be put in place.\nThe country is not able to settle NNPC for the money we are spending on subsidy.\nRecall Tinubu at the his inauguration on Monday said that his government cannot sustain the fuel subsidy.\nBut Kyari boldly said on Thursday said that the country can no longer sustain such an expensive regime.\nSo over 38 per cent of the total fuel distributed in this country ends up in these places."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/2/311.html",
            "summary": "Mele Kyari, NNPCL boss The Nigerian National Petroleum Company Limited, NNPCL said a total of 1.8 billion litres petrol are available, adding that the fuel queues being witnessed across the country will not exceed Saturday (3rd June).\nThe NNPCL\u0092s Group Chief Executive Officer, Mele Kyari, disclosed this during an interview on Channels Television in Abuja on Thursday.\nHe confirmed that the PMS pricing document for various states that trended on Wednesday on the internet was from the NNPCL.\nHe stressed that the notion that petrol prices would reduce once the country starts domestic production was false.\n\u0093There will also be no subsidy when local production starts because there is no cash-to-back subsidy, this country no longer has the resources to continue with subsidy,\u0094 Kyari added."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/2/133.html",
            "summary": "The Nigeria Labour Congress has started an emergency National Executive Council (NEC) meeting concerning the increment in the pump price of Premium Motor Spirit (PMS), also known as petrol.\nNaija News gathered that the Labour Union commenced the NEC meeting a few minutes past 12 pm, and in attendance were executive members of the affiliate unions of the congress.\nThe NLC had kicked against the removal of the fuel subsidy announced by President Bola Tinubu on Monday when he was inaugurated.\nThe Labour Union also knocked the Nigerian National Petroleum Company Limited (NNPCL) for the upward review of pump prices petrol on Wednesday.\nThe organised labour comprising Trade Union Congress and the Nigeria Labour Congress described the move by Tinubu and the NNPCL as a \u0093joke taken too far.\u0094"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/2/116.html",
            "summary": "The leader of INRI Evangelical Spiritual Church, Primate Elijah Ayodele has said the subsidy removal would damage President Bola Tinubu\u0092s government.\nTo this end, Ayodele said his administration would not be good until 2026 if God decides to show him mercy.\nPrimate Ayodele said it\u0092s not yet time for Tinubu to remove the fuel subsidy because it will affect his government.\nPrimate Ayodele explained that the President didn\u0092t address the issue of subsidy well.\nHe said: \u0091\u0092No matter how you want to put it, It is not yet time to remove the fuel subsidy, it will damage the present government."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/3/820.html",
            "summary": "By Rachel Okporu Fadoju Deborah, the daughter of the Founder of Dunamis International Gospel Centre, Paul Enenche, has been attacked online.\nNaija News reports that this comes after Deborah distanced herself from the experiences of other Nigerians and questioned if they are praying over the current situation of fuel subsidy removal.\nAccording to the clergy\u0092s daughter, she was at a filling station in Abuja and didn\u0092t meet anyone there and another place she visited was selling fuel at N700/liter.\nobynodaddymuna wrote: \u0093Praying what?\nThat\u0092s how we got here in the first place.please tell your dad to pray on behalf of Nigerians."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/3/808.html",
            "summary": "By Adejayan Gbenga GsongPresident Bola Ahmed Tinubu has said that the national minimum wage needs a review to reflect realities, assuring that improved livelihood for Nigerians remains a top priority of his administration, with more people-focused economic policies.\nTinubu stated: \u0093We need to do some arithmetic and soul searching on the minimum wage,\u0092\u0092 adding, \u0093We will have to take a look at that together, and the revenue.\nHe said petroleum subsidy was no longer sustainable as he said it was pulling the country down.\nHe added: \u0093If you\u0092ll recall, government after government attempted to remove subsidy on petroleum products, right from 1999 till date and it has not been 100% successful.\n\u0093Now, during the presidential campaigns, the presidential candidates of all the political parties promised that when they assume office they\u0092ll remove subsidy on petroleum products."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/3/307.html",
            "summary": "NLC gave the NNPCL till Wednesday to return to the old price of N194 per litre or it would direct its members to withdraw their services nationwide.\nThis is as the Labour centre has directed all its affiliates unions and state councils to commence mobilisation in case the government through the NNPCL refuses to revert to the old pump price of PMS.\nAjaero said after an unanimous decision of all NLC affiliates, unions were directed to commence mobilisation immediately ahead of the planned nationwide protest.\nThe NLC NEC therefore directed all state councils and all industrial unions to commence mobilisation from this moment to make sure that this action is enforced.\nThe announcement has triggered hike in the fuel pump price less than 24 hours after the announcement and it has also caused more economic hardship to Nigerians."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/4/301.html",
            "summary": "Okonjo-Iweala By Kennedy Mbele This isn\u0092t the first time the idea of petrol subsidy removal would be mooted.\nIn fact, former President Jonathan said at that time severally that fuel subsidy was unsustainable and tried unsuccessfully to remove it.\n\u0093At the end of 2011, a total of N1.73tr, US $11b equivalent, was submitted as claims for subsidy by 143 marketers, who were importing the product.\nTo implement a policy that was good for the country, to lead to the taking of my mother\u0092s life.\nCould I have justified trading firmness on policy and standing up to blackmailers, implementing a good policy for my mother\u0092s life?"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/4/102.html",
            "summary": "By Don Silas The Peoples Democratic Party, PDP, has urged the present administration under President Bola Ahmed Tinubu to engage in genuine dialogue with organised labour and other stakeholders over petroleum subsidy removal to reach a fair and reasonable solution.\nUmar Damagum, made available to newsmen in Abuja, expressed concerns over what it described as the quick removal of the subsidy and the lack of adequate consultation.\nThe party identified key issues for legislative focus, including insecurity, unemployment, inflation, fuel subsidy removal, and strategies for national development.\nIt encouraged coalition-building by PDP lawmakers with other opposition parties to form a minority caucus and strong alliance for effective national development.\nIt called for members of minority political parties in opposition in the National Assembly to unite on issues of national concern."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/4/100.html",
            "summary": "The letter read in part: \u0093Any removal of fuel subsidy should not be used as a ploy to keep the poor in poverty while those who allegedly stole oil revenues and fuel subsidy payments keep their ill-gotten wealth.\n\u0093Allegations of corruption in oil revenues and fuel subsidy payments suggest that the poor have rarely benefited from the use and management of the revenues and payments.\n\u0093A comprehensive approach that prioritizes accountability and full recovery of missing crude oil and public funds is required to address the problems of the implementation of fuel subsidy since 1999.\n\u0093The NNPC also reportedly failed to account for the allocation of crude oil to refineries in 2019.\n107,239,436.00 barrels of crude oil were lifted as domestic crude without any document."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/5/311.html",
            "summary": "They also demanded a pay rise to cushion the effects of the subsidy removal.\n\u0093The 2023 Appropriation Act made provisions for funding subsidy regime on PMS till the end of June 2023.\n\u0093Discussions were already on an understanding reached with the government on the conditions precedent before the withdrawal of subsidy on PMS.\nThis makes the country\u0092s fuel price not only dependent on global oil prices and exchange rates but also on importation and handling charges.\nThis will give extra cash to the employed poor on a monthly basis to cushion the impact of subsidy removal on them."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/5/800.html",
            "summary": "The withdrawal of the fuel subsidy has prompted the Judiciary Staff Union of Nigeria (JUSUN) to launch industrial action.\nAfter President Bola Tinubu stated that the fuel subsidy was gone, the price of gasoline at the pump tripled.\nThe Nigerian National Petroleum Corporation Limited (NNPCL) had instructed its retail stations to suddenly increase the cost of gasoline from N197 to between N488 and N570 per liter.\nThe national strike had been called by the Nigeria Labour Congress (NLC).\nIn a statement, JUSUN\u0092s General Secretary, M.J. Akwashiki, directed all branches and chapters of the union to begin nationwide mobilisation and withdrawal of service."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/5/117.html",
            "summary": "By Williams Anuku The Nigeria Labour Congress, NLC, has debunked speculations that it might back down on its proposed industrial action slated nationwide for Wednesday.\nIt said the only reason it would shelve the strike is when the Federal Government and the Nigeria National Petroleum Corporation Limited NNPCL did the needful by returning to status quo on the fuel subsidy removal issue.\nNLC declared the position in a statement by Benson Upah, Head of Information and Public Affairs on Sunday.\nIt described the report as laughable and desperate attempt by enemies of the people to polarise Nigeria Labour Congress along ethnic or regional lines on an issue with a national spread.\n\u0093Whereas, primordial sentiments such as religion, region or ethnicity may be refuge for some, at the Nigeria Labour Congress, they have no place."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/7/1.html",
            "summary": "By Oluyemi Ogunseyin Labour Party presidential candidate, Peter Obi was welcomed by thousands of party supporters in Yola Adamawa state on Tuesday.\nThe Labour Party (LP) candidate during the presidential election of February 25, Peter Obi, says he would have provided various relief policies for Nigerians after removing the subsidy on fuel.\nRecall that President Bola Ahmed Tinubu (BAT) during his inauguration at the Eagle Square in Abuja on May 29 announced the removal of subsidy payment on Premium Motor Spirit also known as petrol.\nObi while speaking on Channels Television on Wednesday insisted that fuel subsidy should be removed because it is an \u0093organised crime\u0094 but not without \u0093relieving policies\u0094 in place for Nigerians.\n\u0093It\u0092s not the same thing as pulling the tooth forcefully; the pain you feel will be different,\u0094 Obi clarified."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/7/126.html",
            "summary": "However, after a meeting with the Federal Government, the NLC leadership called off the strike.\nThe development followed President Bola Tinubu\u0092s inaugural speech announcing the removal of fuel subsidy.\nThe NLC said the authorities should have listened to the poor masses before removing the fuel subsidy.\n\u0093So states will not come out now to say, remove fuel subsidy or don\u0092t remove fuel subsidy, or we will do this or do that.\n\u0093Ordinarily, even with the communique that is coming now, issues ought to have been discussed and the communique in place before he removed the fuel subsidy."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/7/800.html",
            "summary": "By paulcraft The Nigeria Labour Congress (NLC) president, Joseph Ajaero, has responded to criticism about the union\u0092s planned nationwide strike over the removal of fuel subsidies.\nAjaero, speaking on the AIT\u0092s morning show, blamed Nigerians and the general public for the strike\u0092s suspension.\nProtests must not only be led by NLC, what about 130 million Nigerians in multi-dimension poverty, can\u0092t they come out to protest?\nProtests must not only be led by NLC, what about 130 million Nigerians in multi-dimension poverty, can\u0092t they come out to protest?\nNigerians should not be docile, waiting for only NLC to lead protests."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/7/125.html",
            "summary": "One of the most obvious effects of the fuel subsidy removal and price hike is the rise in transportation costs.\nAnother significant impact of the fuel subsidy removal and price hike is the potential decrease in consumer demand.\nThe increased fuel costs have directly impacted their production costs, forcing them to reevaluate their pricing structures.\nCommercial motorcyclists, commonly referred to as \u0093Okada\u0094 riders, have also been significantly affected by the fuel subsidy removal and price hike.\nAnas said the Federal Government should have put measures in place to cushion the effect of subsidy removal before making the declaration."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/8/1.html",
            "summary": "Each was to be given 20,000 barrels of crude per day to bring the daily allocation to 320,000 barrels.\nIn 2020/2021, when oil price averaged $71 per barrel, the 109,500,000 barrels exchanged should be worth about $7.7billion.\nLtd.; Litasco SA/Brittania- U Nigeria Ltd./ Freepoint Commodities; Mrs. Oil and Gas Company Ltd.; Sahara Energy Resource Ltd.; Bono Energy Ltd./ EternaPlc/ Arkleen oil and gas Ltd./ Amazon energy; Matrix Energy Ltd./ Petratlantic energy Ltd./ Utm offshore Ltd./ Levene Energy Development Ltd.;, Mercuria Energy Trading SA/Barbedos Oil and Gas services Ltd./ Rainoil Ltd./ Petrogas Energy; Asian oil and Gas Pte Ltd./ Eyrie Energy Ltd./ Masters Energy oil and gas Ltd/Casiva Ltd and Duke Oil Company Incorporated.\nHe noted that full liberalisation of the process would remove the problems associated with the DSDP arrangement.\nAudits of the DSDP and subsidy scheme are necessary for exposing corruption and fostering openness,\u0094 Nwadishi, former Board Member at global body of EITI, said."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/4/300.html",
            "summary": "The letter read in part: \u0093Any removal of fuel subsidy should not be used as a ploy to keep the poor in poverty while those who allegedly stole oil revenues and fuel subsidy payments keep their ill-gotten wealth.\n\u0093Allegations of corruption in oil revenues and fuel subsidy payments suggest that the poor have rarely benefited from the use and management of the revenues and payments.\n\u0093A comprehensive approach that prioritizes accountability and full recovery of missing crude oil and public funds is required to address the problems of the implementation of fuel subsidy since 1999.\n\u0093The NNPC also reportedly failed to account for the allocation of crude oil to refineries in 2019.\n107,239,436.00 barrels of crude oil were lifted as domestic crude without any document."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/11/15.html",
            "summary": "\u0093According to the audited reports between 2016 and 2019 by the Auditor General of the Federation (AGF), the Nigerian National Petroleum Corporation (NNPC) failed to remit N663,896,567,227.58 into the Federation Account.\n\u0093The NNPC also reportedly failed to account for the allocation of crude oil to refineries in 2019.\n\u0093The DPR in 2018 also withdrew without any explanation US$759,387,755.10 from DPR Signature Bonus Account rather than paid the money into the Federation Account.\n\u0093Subsidy records show that N443,940,559,974.80 was paid as total subsidy for 2016 but the money was not budgeted for.\nOnly outstanding payments for previous years 2014 and 2015 and interest payments were made in 2016."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/12/31.html",
            "summary": "By Olugbenga Ige President Bola Ahmed Tinubu has promised to ease the pains of Nigerians following the removal of fuel subsidy by his administration.\nNaija News reports that the Nigerian leader made the promise in his maiden Democracy Day address to Nigerians on Monday, June 12, 2023.\nHe admitted that the fuel subsidy removal will impose an extra burden on the Nigerian masses, and urged the citizens to sacrifice a little more for the survival of the country which he promises will not be in vain.\nPainfully, I have asked you, my compatriots, to sacrifice a little more for the survival of our country.\n\u0093For your trust and belief in us, I assure you that your sacrifice shall not be in vain."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/feature/publication/amobi-chukwuma/061423.html",
            "summary": "All Nigerians were advised to deposit the concerned old naira notes into the bank in exchange for new redesigned Naira notes in N200, N500 and N1000 denominations.\nBoth the old naira notes and the new redesigned naira notes were nowhere to be found.\nAfter long period of agony, hunger, anger and desperation, the old naira notes were once again released.\nIn his inaugural speech President Bola Tinubu said without mincing words, \"The fuel subsidy is gone!\"\nIt is really a situation of jumping from frying pan into fire."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/15/28.html",
            "summary": "Popular Nigerian TV host, Rufai Oseni has urged the Federal Government to make some changes in the National Assembly so as to ease the effect of the removal of fuel subsidy on the nation.\nSpeaking via a series of tweets, Oseni asked the FG to cut the National Assembly N160 billion budget to N50 billion, adding that the leftover funds should be used to improve federal medical facilities across the nation.\nHe argued that if Nigerians have to suffer the effect of the subsidy removal then the lawmakers must also must not be exempted.\nSpeaking further, the political analyst insisted that the number of Ministers of State and Special Advisers should also be cut down.\nHe wrote, \u0093National Assembly get over 160 billion, cut that money to 50 billion, make it a unicameral legislature use the remaining money to upgrade Federal medical centers across the country."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/16/310.html",
            "summary": "By Elizabeth Adegbesan Investment analysts have predicted that headline inflation rate will rise above 23 percent on account of recent government policies including removal of fuel subsidy and naira depreciation in the forex market.\nThis is the highest inflation rate recordedinNigeriasinceSeptember 2005 and the third straight month of staying within the 22 percent band.\nThe NBS report stated: \u0093In May 2023, the headline inflation rate increased to 22.41 percent relative to April 2023 headline inflation rate which was 22.22 percent.\n\u0093Notwithstanding these efforts, the new administration has hinted at the need for interest rate moderation in a bid to increase investment and consumer purchasing power.\nAnother interest rate hike may be imminent.\u0094 VANGUARDNEWS SECTIONS"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/22/7.html",
            "summary": "Vice President Kashim Shettima (right) with British High Commissioner to Nigeria, Richard Montgomery, at the State House, Abuja yesterday.\nPHOTO: PHILIP OJISU By Terhemba Daka, Abuja British High Commissioner to Nigeria, Richard Montgomery, yesterday, explained why the United Kingdom (UK) government banned international students from bringing family members with them, starting 2024.\nWe\u0092ll have to manage our migration in and out of the UK,\u0094 Montgomery revealed, shortly after he emerged from a closed-door meeting with Vice President Kashim Shettima, at the Presidential Villa, Abuja.\n\u0093That issue was not raised in the meeting (with the Vice President) just now.\nWe either get rid of the fuel subsidy or the fuel subsidy gets rid of the Nigerian nation,\u0094 he said."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/24/24.html",
            "summary": "President Bola Tinubu has called for unity and stability in the country months after the conduct of the 2023 general elections.\nHe reminded Nigerians that he remains the leader of the nation, regardless of the party they voted for during the February 25 presidential election.\nIn a statement on Saturday issued by his spokesman, Dele Alake, the President stated these during an interactive session with members of the Nigerian community living in France on France.\nWhether you voted for me during the elections, or not, I am your President.\nI will work on your behalf to ensure a turning point of prosperity.\u0094Speaking further, Tinubu stated that he let out the giant elephant of fuel subsidy without bringing down the house."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/24/30.html",
            "summary": "Addressing Nigerians in France, Tinubu explained that the Special Adviser on Monetary Policy, Wale Edun and Alake had excluded fuel subsidy removal from his inaugural speech, \u0093but he felt it was expedient to stop the subsidy on the first day\u0094.\nPhoto: State House This marked the first time the President would publicly comment on his May 29 inaugural speech, in which he declared that \u0093fuel subsidy is gone\u0094.\nThis is despite former President Muhammadu Buhari\u0092s early moves to end the payment of fuel subsidy by June.\nPresident Tinubu explained that the fuel subsidy was a \u0093scam\u0094 and disincentive to growth as it rewarded smugglers and reduced the burden of real cost of the commodity for some countries.\nHe said the Special Adviser on Monetary Policy, Wale Edun and Special Adviser on Special Duties, Communication and Strategy, Dele Alake, had excluded fuel subsidy removal in his inaugural speech, but he felt it was expedient to stop the subsidy on the first day."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/24/27.html",
            "summary": "President Bola Ahmed Tinubu has explained why he went off the script to announce the removal of fuel subsidy during his inaugural address to Nigerians on May 29, 2023.\nThe President disclosed this during a meeting with members of the Nigerian community in France on Friday, June 23, 2023.\nTinubu, who described fuel subsidy as a \"scam\" and disincentive to growth, insisted that the policy only rewarded smugglers and reduced the burden of the real cost of the commodity for some countries.\nThis is contained in a statement issued by his Special Adviser on Special Duties, Communication and Strategy, Dele Alake, later on Friday.\nAddressing the Nigerian diaspora in France, the President revealed that his Special Adviser on Monetary Policy, Wale Edun and Alake had expunged fuel subsidy removal from his inaugural speech, \u0093but he felt it was expedient to stop the subsidy on the first day\u0094."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/26/19.html",
            "summary": "Popular Nigerian TV host, Rufai Oseni has reacted to President Bola Tinubu\u0092s statement claiming he announced the removal of fuel subsidy out of courage.\nRecall that Tinubu had stated that his inauguration address on May 29 2023, did not include removal of petroleum subsidy.\nTinubu said that despite the absence of the subsidy removal from his speech, he decided to summon the courage and announce it.\nHe had said, \u0093When I was declared a winner, I fell almost sick with joy.\nSo I asked the question, you asked me to bring this trophy, this victory what do you do with it?"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/27/18.html",
            "summary": "The World Bank has thrown its weight in support of the Federal Government\u0092s subsidy removal and the exchange rate unification.\nThis comes weeks after President Bola Tinubu\u0092s inaugural speech on subsidy removal and the need to unify Nigeria\u0092s exchange rate.\nSpeaking at an event organised by the World Bank to assess the nation\u0092s economy in the last six months on Tuesday, Country Director, Dr Subham Chadhuri, explained that the policy though painful remains key to rebuilding the economy of the nation.\nMr Chadhuri, however, advocated measures that will reduce the impact on the people going forward.\nHe further stated that the World Bank\u0092s concessionary funding to Nigeria currently stands at over ten billion dollars."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/30/28.html",
            "summary": "By Tayo Elegbede A member of the Labour Party/Obi-Datti Presidential Campaign Council for the 2023 election, Prof Chris Nwokobia has said President Bola Tinubu is copying all the planned policies of the party\u0092s presidential candidate, Peter Obi.\nNwokobia, said Tinubu since his inauguration has been executing policies planned by the Labour Party flag bearer, Naija News gathered.\nThe Labour Party chieftain said Obi would have done better if given the chance due to his expertise in politics and economics.\nNwokobia said \u0093All we have seen in the life span, one month of this administration is copycatting the policy programmes of Peter Gregory Obi.\nPeter Gregory Obi would have done better."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/1/310.html",
            "summary": "Former President Buhari\u0092s reported confession regarding the withdrawal of oil subsidy also triggered a wave of public outrage.\nReactionsIn light of President Buhari\u0092s confession, Nigerian leaders from various sectors and civil society organizations have come forward to express their concerns and demand accountability.\nOur democracy cannot thrive if political interests consistently take precedence over the welfare of the people.\nHis (Buhari\u0092s) confession represents a high level of irresponsibility, lack of commitment, and insensitivity to the feelings of the people.\n\u0093We however disagree slightly with Buhari because everyone is aware by now that he never wanted Tinubu to win, and never worked for his victory."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/2/300.html",
            "summary": "Senior pastor of Awaiting The Second Coming Of Christ Ministries, Adewale Giwa, has described those commending President Bola Ahmed Tinubu as hypocrites.\nSpeaking in Akure, while addressing his members, Giwa, said only the enemies of Nigeria would hail President Tinubu at present.\nHe said,\u0094 Those praising the president are gullible enough to believe that selling a litre of petrol at N550 is good for the country where people are surviving without jobs.\n\u0093How many of us can boast that we have jobs that can help us confront these challenges that we face in Nigeria?\n\u0093How can you be praising someone who sacked services chiefs and replaced them with officers that he can work with?"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/2/10.html",
            "summary": "By Tayo ElegbedePresident Bola Tinubu has been admonished to publish the details of what the N400 billion saved so far on the removal of fuel subsidy has been used for.\n\u0093Opacity in the spending of the savings from subsidy removal would have negative impacts on the fundamental interests of the citizens and the public interest.\n\u0093SERAP also urges you to promptly instruct Independent Corrupt Practices and Other Related Offences Commission and Economic and Financial Crimes Commission to monitor the spending of all savings from subsidy removal.\n\u0093Your government has a positive obligation to protect individuals against the threat posed to human rights by the removal of subsidy on petrol.\nYour government also has legal obligations to effectively address the aftermath of subsidy removal."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/7/2.html",
            "summary": "By Chukwuma Muanya Doctors under the aegis of National Association of Resident Doctors (NARD) have reviewed their demand for salary increase from 200 to 550 per cent, to cushion negative impact of fuel subsidy removal.\n\u0093Using current parameters, an upward review, to the tune of 550 per cent, is required.\nThe doctors, nevertheless, further extended the expired ultimatum issued government by two weeks, beginning Wednesday, July 5, 2023.\nThe demands include: immediate payment of 2023 Medical Residency Training Fund (MRTF) as contained in the 2023 budget, in line with various agreements reached.\nThey called on government to pay all outstanding arrears owed members, including hazard allowance; skipping arrears of 2014-2016; and arrears of consequential adjustment of minimum wage."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/13/4.html",
            "summary": "House of representatives By Jimisayo Opanuga with agency report Members of the House of Representatives are demanding raises in their salaries and allowances, citing the removal of fuel subsidies and the state of the economy.\nHowever, speaking anonymously, one of the lawmakers who attended the meeting said the discussion solely revolved around the need for a salary increase rather than the issue of delayed payment.\nHowever, the approval of such an increase is pending the president\u0092s decision and inclusion in the budget.\nThe proposed amendment aims to allocate ?500 billion for the provision of palliatives to cushion the effects of the fuel subsidy removal on Nigerians.\nPresident Tinubu stated that the requested amendment was necessary to ensure the government\u0092s ability to provide support and relief measures to alleviate the impact of the fuel subsidy removal."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/19/34.html",
            "summary": "Nigerian TV news anchor, Rufai Oseni has asked President Bola Tinubu to apologize to Nigerians for misleading them in 2012 over his claims on fuel subsidy during the administration of former president Goodluck Jonathan.\nNaija News recalls that Tinubu, in 2012 had kicked against Jonathan for removing petrol subsidy.\nTinubu had condemned Jonathan\u0092s move in a broadcast titled \u0093Removal of oil subsidy \u0096 President Jonathan breaks social contract with the people.\u0094The publication was dated Wednesday, January 11, 2012, and was an edition of The Nation newspaper.\nFindings reveal that Tinubu made the statement in reaction to the removal of fuel subsidies by the Jonathan-led government.\nHe further described the subsidy removal by the PDP-led government as \u0093Jonathan tax.\u0094"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/19/32.html",
            "summary": "The NNPCL Group Chief Executive Officer, Mele Kyari, in a subsequent statement, attributed the recent rise in petrol pump prices to market forces.\nReacting, however, to the hardship brought upon Nigerians as a result of the latest development, CUPP said fuel subsidy removal by President Tinubu\u0092s administration is now looking like a scam to the citizens.\nCUPP criticized the \u0091crazy and unending fuel price hikes\u0092 which, according to it is driving inflation to the rooftops and making life increasingly unbearable for Nigerians generally.\nIn a press release signed by the group\u0092s national co-spokesperson, Mark Adebayo, on Wednesday, CUPP frowned at the sudden increase barely a month after the fuel price was hiked over 300% on May 29th this year.\n\u0093This subsidy removal scheme is increasingly looking like a scam to cage Nigerians inside a preprogrammed regime of socioeconomic slavery dictated by leadership insensitivity."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/21/22.html",
            "summary": "By Olugbenga Ige The Social Democratic Party (SDP) candidate in the 2023 presidential election, Prince Adewole Adebayo has slammed President Bola Ahmed Tinubu over the removal of fuel subsidy.\nAdebayo described President Tinibu as a hypocrite for opposing former President Goodluck Jonathan when he wanted to remove fuel subsidy in 2011 and went in the opposite direction when he came to power.\nIn an interview with Arise News on Wednesday, Adebayo said Tinubu and his advisers should have provided palliatives and other plans to cushion the effect of fuel subsidy removal for Nigerians before the announcement.\nHypocrisy started with President Tinubu himself who opposed former President Goodluck Jonathan when he had a smaller amount of subsidy adjustment and all of them went on the streets against it.\n\u0093And when they came to power, they went in the opposite direction; finished everything once and for all."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/22/13.html",
            "summary": "President Bola Tinubu By Kingsley Jeremiah, Abuja nless President Tinubu slows down on his economic policies, Nigeria may face drastic economic consequences, the President of the Chartered Institute of Taxation of Nigeria (CITN), Samuel Agbeluyi,said yesterday.\nSpeaking in Abuja at a programmeorganised by the tax body, Agbeluyi said implementation of some of the policies, especially the proposed increase in electricity tariff, fuel subsidy removal and floating of the Naira,may cause economic challenges for the country.\n\u0093In order not to make the shock too drastic, we may need to slow down in the introduction of other policies.\nBut we will like to advice the government to be a little slow and not drastic in some of its decisions.\nFor instance, the impact of the removal of subsidy leading to the current price of petrol is enormous on the citizens,\u0094 he noted."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/23/6.html",
            "summary": "By Editorial BoardConfirmation by the Nigerian Customs Service that petrol is still being smuggled out of the country to neighbouring countries is worrisome.\nTo the consternation of Nigerians, the Acting Comptroller-General of the Nigeria Customs Service (NCS), Adewale Adeniyi said there were still cases of smuggling of petrol at some border stations despite the subsidy removal and rising price of petrol in Nigeria.\nStoppage of subsidy was expected to make smuggling economically unattractive and ultimately stop it, since smuggling persists because the perpetrators are still making high profits from it.\n; have Nigerians been told the whole truth about fuel subsidy in the country?\nThe Federal Government must unravel what has continued to attract people to the illicit trade and stop it, if it must reap the full benefits of subsidy removal and actually stop being a Father Christmas to foreigners."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/23/320.html",
            "summary": "The parents noted that life is being snuffed out of them as a result of such increases in almost all sectors such as fuel, electricity and now school fees.\nThe moment the government increases the fees payable in its schools, others will follow, the state governments and private school owners.\nWhat he needs to do is to encourage the modular refineries.\nHe should address that and set standards for those operating such modular refineries if he is not pleased with what they are doing now.\n\u0093While the modular refineries are working and meeting the people\u0092s needs in their own little ways, then the big ones like the Dangote Refinery can come on stream."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/23/309.html",
            "summary": "Adewale Giwa By Dayo Johnson, Akure The Senior Pastor of Awaiting The Second Coming Of Christ Ministries, Adewale Giwa, has raised the alarm that the policies of President Bola Tinubu within 55 days in office were inflicting hardship on Nigerians.\nThe clergyman man said that majority of Nigerians didn\u0092t vote for Tinubu and instead of endearing himself to the hearts of Nigerian\u0092s he\u0092s doing otherwise.\nGiwa said that the President has started to disappoint those few Nigerians that put their trust in him that he would bring relief.\n\u0094 Tinubu was not the choice of Nigerians in the last presidential election.\n\u0093He knows the majority of Nigerians did not vote for him."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/27/40.html",
            "summary": "By George Oshogwe Ogbolu The Bola Ahmed Tinubu-led federal government has begged the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC) to shelve its planned strike scheduled to start next Wednesday.\nNaija News reports that the FG appealed during a meeting on Wednesday between government representatives and organized labour.\nAsked about the agenda of the meeting, she said: \u0093It involves labour and some parts of government, it\u0092s a steering committee.\nBut we are making progress; we\u0092re trying to address the issues that will prevent a strike.\nIt\u0092s a whole package of issues that we\u0092re rolling out as quickly as possible.\u0094 NAIJANEWSNEWS SECTIONS"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/27/51.html",
            "summary": "According to the communique, the congress noted that Nigerians have lost their peace of mind following the \u0093Subsidy is gone\u0094 comment made by President Boal Tinubu during his May 29, 2023, inauguration.\nThe NLC also said the government has shown enormous disdain and contempt for the Nigerian people and have declared a war of attrition on Nigerian workers and masses.\n\u0093That since Mr. President\u0092s \u0093subsidy is gone forever\u0094 speech at the inauguration day; the peace of mind of Nigerians has gone; decent living gone increasing despair of unimaginable dimensions.\nThat the federal government has continued to treat Nigerians as slaves and conquered people which it treats with impunity without any concern on the consequences.\nWhile declaring its next line of action, the NLC leadership said it had received pressure from Nigerians who have been calling on it to lead a national strike."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/28/24.html",
            "summary": "By Olugbenga Ige The details of the meeting between the United States Vice President, Kamala Harris, and President Bola Tinubu have emerged.\nIn a statement released by the presidential spokesman, Dele Alake, President Tinubu spoke with Harris about the strong ties between the Nigerian and American people.\nThe US vice president also assured Tinubu of her country\u0092s support in increasing private sector investment, digital inclusion, women\u0092s empowerment, and expanding access to clean energy.\nOn Nigeria, President Tinubu craved for more private sector investment, urging the US to lead the way in this regard.\nOther matters that featured in the discussions that lasted about 40 minutes are defending democracy in West Africa and The Sahel and digital inclusion."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/29/12.html",
            "summary": "The Steering Committee was set up by the government to come up with palliatives that would cushion the effect of fuel subsidy removal on the workers.\nBut the meeting could not hold because some members of the Steering Committee said there was no quorum.\nIrked by the development, a member of the Steering Committee from Labour, who craved not to be mentioned, said: \u0093They are not prepared for the meeting.\nIt was gathered that the Labour delegation from the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC) was delayed at the State House entrance gate for clearance.\nThe Organised Labour has already scheduled a nationwide protest for August 2 to press home their demands over the petroleum subsidy removal."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/30/300.html",
            "summary": "By Ezra Ukanwa Nigerians are beginning to experience the gains of subsidy removal on petrol, President Bola Ahmed Tinubu, has said.\nThis is coming despite the widespread suffering and increasing groaning of Nigerians over the effects of subsidy removal on petrol and the snail-pace deployment of palliatives to cushion the effects.\n\u0093The first two policies that I announced during my inauguration, namely the removal of the fuel subsidy and the new forex regime, are already yielding positive results.\nThe expectations of the civil service this year are full; this is so because the expectations of this administration for the civil service are full.\nShe reiterated that Scheme is a globally recognized and accepted practice, which has been institutionalized in the Federal Civil Service as one of the critical deliverables of Pillar Six of the Federal Civil Service Strategy and Implementation Plan 2021-2025 (FCSSIP 25) \u0096 Enhancing Value Proposition for Civil Servants."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/1/28.html",
            "summary": "President Bola Ahmed Tinubu on Monday addressed Nigerians in a nationwide broadcast.\nRead full broadcast below:TEXT OF THE NATIONAL BROADCAST BY PRESIDENT BOLA TINUBU TO NIGERIANS ON CURRENT ECONOMIC CHALLENGES.\nSuch a vast sum of money would have been better spent on public transportation, healthcare, schools, housing and even national security.\nIt diverted money that should have been used to create jobs, build factories and businesses for millions of people.\nWith the fund, our states will become more competitive and on a stronger financial footing to deliver economic prosperity to Nigerians."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/1/48.html",
            "summary": "By Enioluwa Adeniyi In a nationwide address on Monday, President Bola Tinubu declared that the economic flaws he\u0092s striving to rectify only benefitted the wealthy.\nHe cited the removal of fuel subsidy and the implementation of other fiscal policies as part of these corrective measures.\nTinubu said, \u0093I had promised to reform the economy for the long-term good by fighting the major imbalances that had plagued our economy.\n\u0093Thus, the defects in our economy immensely profited a tiny elite, the elite of the elite you might call them.\n\u0093As we moved to fight the flaws in the economy, the people who grow rich from them, predictably, will fight back through every means necessary."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/1/11.html",
            "summary": "It is meant largely to provide infrastructure as a key measure to provide palliatives for the people.\nThe leaders must adopt a new style of governance that will truly make the people reap the benefits of subsidy termination.\nGovernments at all levels must be transparent, creative, prudent, development-focused and accountable in spending windfall from subsidy removal, the pains of which Nigerians are now bearing.\nMany state governments cannot pay pension and gratuity of ex-workers; most painful is the entitlements of those who died in active service.\nThey should initiate policies and projects that will lift residents of their domains from abject poverty into which fuel subsidy removal, bad governance and greed of the leadership have thrown them."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/2/18.html",
            "summary": "The Nigeria Labour Congress (NLC) has rubbished the claims by President Bola Ahmed Tinubu that N1 trillion has been saved since his government ended the era of fuel subsidy payment.\nNaija News reports that President Tinubu, during his nationwide broadcast on Monday, declared that not less than N1 trillion had been saved since the removal of the fuel subsidy.\n\u0093In a little over two months, we have saved over a trillion Naira that would have been squandered on the unproductive fuel subsidy, which only benefitted smugglers and fraudsters.\nHowever, while speaking during the ongoing nationwide protest of organized labour, NLC President, Comrade Joe Ajaero, said no dime had been saved from the latest policy as claimed by the Nigerian leader.\nThe committee when we met, told us that no one kobo has been saved so far."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/2/30.html",
            "summary": "By Richard Ogunsile The Senate has reacted to the ongoing nationwide protest by organized labour, including the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC).\nNaija News reported earlier that the Abuja chapter of organized labour, on Wednesday, stormed the National Assembly complex and, in the process, broke down the entrance gate.\nThe Senate also resolved that it will, in the shortest possible time, meet with the NLC and TUC leadership to find an amicable resolution to the current impasse.\nNdume, alongside two other lawmakers \u0097 Senator Ireti Kingibe and Senator Tony Nwonye \u0097 later met with the protesters at the National Assembly.\nThe Senators were seen engaging Nigeria Labour Congress (NLC) President Joe Ajaero; and his TUC counterpart, Festus Osifo."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/4/13.html",
            "summary": "Mele Kyari By Kingsley Jeremiah and Fehintola Adewale, Abuja As motorists struggle with the high cost of Premium Motor Spirit (PMS) following the removal of subsidy by President Bola Ahmed Tinubu government, Nigerian National Petroleum Company (NNPC) Limited will provide cheaper alternative Compressed Natural Gas (CNG).\nThe development is coming under a new partnership with NIPCO Gas Limited, NNPC group chief executive officer, Mele Kyari disclosed in Abuja.\n\u0093Under the NNPC-NIPCO strategic partnership, 35 state-of-the-art CNG stations will be constructed nationwide, including three Mother stations,\u0094 the statement read.\nNNPC Limited expects further private sector participation by oil marketing companies to broaden CNG penetration and availability.\nKyari said NIPCO Gas Limited is operating 14 CNG stations across Nigeria and has converted over 7,000 vehicles to run on CNG."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/4/45.html",
            "summary": "He stressed that when the subsidy was being paid, Nigerians were not the major beneficiaries as a few individuals hijacked it.\nThe CAN chairman appealed to Nigerians to be patient and support President Bola Tinubu in his quest to build a better country.\nThe CAN chairman appealed to Nigerians to be calm, noting that the nation is already getting out of the woods.\n\u0093The best that can happen to us is what we are experiencing now, though with pain.\n\u0093He wants the best for this nation, he has the interest of this nation at heart, and that is why he has met with the labour unions personally."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/9/24.html",
            "summary": "Mele Kyari By Adamu Abuh, Abuja The chief executive officer of the Nigeria National Petroleum Corporation Limited (NNPCL), Mele Kyari, has been urged to render an account of the cost implications of fixing the nation\u0092s refineries.\n\u0093Let us remind Mr Kyari that no amount of blackmail, intimidation, or diversionary tactics will deter us on this patriotic campaign.\n\u0093We demand for transparency, accountability and we\u0092ll continue to demand that Mr President act to expose the heinous crimes in the petroleum sector\u0094.\n\u0093Why is there never an audited account of NNPC or NNPCL known to the public?\nIt is even a shame for Mele Kyari to boast about declaring those paltry sums as profits, even as the entire claim is in itself unverified."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/13/43.html",
            "summary": "By 'Yomi Ayeleso The Nigerian Medical Association (NMA) has revealed that native doctors would soon be running hospitals in the country due to the neglect and decay of the nation\u0092s health system over the years.\n\u0094 Like I previously said, if nothing deliberate is done to rescue the health sector, native doctors will soon start running our hospitals!\nThe neglect of the health sector is already leading to the proliferation of quacks who are now even brazenly parading themselves as doctors and even conducting graduations to induct their apprentices to the \u0091Medical Profession\u0092.\nIf this is allowed to continue, the nation will be the sore loser!\nThis, coupled with the prohibitive cost of transportation is threatening delivery of qualitative health services as it is becoming increasingly difficult for health workers to commute daily to the hospitals and to keep medical services running uninterruptedly."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/15/800.html",
            "summary": "President Bola Ahmed Tinubu is reportedly considering a temporary subsidy on Premium Motor Spirit (PMS) popularly known as petrol.\nAccording to TheCable, the president is seriously considering to reintroducing fuel subsidy as crude oil prices and foreign exchange rates continue to rise in the international market.\nNaija News reports that Nigerians have continued to groan under harsh economic realities following the removal of petrol subsidy in May 2023.\nFollowing the removal of the fuel subsidy, the price of petrol has gone from N200 to N500/700 in the last three months.\nAlready, the Nigerian Labour Congress (NLC) has threatened to embark on an indefinite strike if the petrol price further surges."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/15/305.html",
            "summary": "The University of Ibadan on Monday directed that work days be reduced from five to three for every worker in the school.\nThis, according to the university management, is following the astronomical increase in fuel pump prices.\nThis was revealed in a statement issued by the institution dated August 14, 2023, and signed by G.O.\nThe statement said, \u0093The astronomical increase in the fuel pump price occasioned by the removal of subsidy by the Federal Government has imposed huge economic difficulties on the generality of Nigerians.\n\u0093After careful consideration of the situation, the University Management recommended a temporary work schedule adjustment for members of staff, which Senate at its meeting of Thursday, 03 August 2023 considered and approved."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/feature/publication/ganago/081523.html",
            "summary": "According to the late Professor Tam David-West, former petroleum Minister, there has never been an oil subsidy in Nigeria, to begin with, as he said the idea of oil subsidy in Nigeria is a fraud.\nIn Professor Tam David-West\u0092s words \"There is no oil subsidy in Nigeria.\nIn making his argument against oil subsidy claims Professor David-West made this analogy : \" Let me introduce you to the basics.\nThe extra N10 the government pays on behalf of the people for them to still buy at N10 is the subsidy paid on that commodity\"Coming to petroleum, there is no oil subsidy.\nThen President Bola Tinubu\u0092s pronouncement of removing a non-existent oil /fuel subsidy amounts to a bogus claim of solving a non-existent problem."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/16/51.html",
            "summary": "By Tayo Elegbede President Bola Tinubu has been told to take cues from Kenya concerning the ongoing crisis surrounding the removal of fuel subsidy on Premium Motor Spirit, popularly called petrol, Naija News learned.\nOil marketers have said the gradual relaxation of the removal of subsidy on the product amidst the forex crisis would be the way to go.\nMarketers have advocated a temporary return of subsidy on petrol for a couple of months for things to be in place.\nThey told the president to emulate the Kenyan government, which returned subsidy on fuel for two months after removing the subsidy that created so much hardship.\n\u0093When he (Tinubu) announced that thing (subsidy removal), we said it was going to bring problems."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/16/7.html",
            "summary": "This came as he assured of a stabilised pricing regime for Premium Motor Spirit (PMS), also known as petrol.\nThe President said his government is poised to take measures to maintain the current pump price of PMS without reversal of its policy on subsidy removal.\nHe affirmed that there will be no increase in price in any part of the country.\nNgelale said the government will address inefficiencies in the midstream and downstream petroleum value chains so that the price can be stabilised.\n\u0093We repeat, the President affirms that there will be no increase in the pump price of PMS."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/17/7.html",
            "summary": "However, this is the time to focus on solutions rather than actions that will invariably complicate and worsen workers\u0092 plight.\nHe went on to unveil a N500 billion package to ease pains of subsidy withdrawal.\nBut he blamed it on a tiny group of rent seekers that benefitted from subsidy payments to the detriment of Nigerians.\nHe then went on to unveil a set of subsidies to cushion the effects of subsidy removal.\nFor Labour, peaceful protests are a welcome option in the campaign for better welfare for citizens and workers."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/17/44.html",
            "summary": "He claims that both American companies and investors as well as other foreign investors have rekindled their interest in Nigeria.\nWe\u0092re already seeing a renewed interest from US businesses and investors, as well as other international investors,\u0094 David Greene noted.\nNigeria is such an economic heavyweight through cross-border expansion and economic integration, including under the African continental free trade area.\nSo, the United States remains committed to an enduring partnership with Nigeria: One centered on our aspirations for shared prosperity and mutual economic growth,\u0094 he added.\nThe U.S. Trade Mission in Africa is concentrating on Nigeria, South Africa, and Ghana because of the vast economic prospects in those nations, according to Marisa Lago, the U.S."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/17/33.html",
            "summary": "Nigeria\u0092s Vice President (VP), Kashim Shettima, on Thursday, chaired the National Economic Council (NEC) meeting at the Council Chamber of the Presidential Villa, Abuja.\nNaija News learnt that journalists were barred from the meeting and were only stationed outside waiting to be briefed on the outcome.\nState governors from across the Federation and other stakeholders are expected to be present at the meeting.\nThere are expectations that issues to be discussed at the week\u0092s NEC meeting may border on the current economic challenges in the country occasioned by the removal of the petrol subsidy."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/17/24.html",
            "summary": "He said Tinubu\u0092s decision to remove fuel subsidy upon assumption of office was a misplaced priority.\nTinubu Should Prioritize Building A Modern Refinery Mainas said the President ought to have prioritized building modern refineries to avoid further woes.\nThat should be his number one priority and not fuel subsidy removal.\nTake a look at when Jonathan was in power, he wanted to remove the fuel subsidy, but the country almost went on fire, and he had no choice but to reverse his decision to remove the fuel subsidy.\nThe President has proved to Nigerians that he is following in Buhari\u0092s footsteps."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/33.html",
            "summary": "By Olugbenga Ige The Independent Petroleum Marketers Association of Nigeria (IPMAN) has said the federal government was secretly paying subsidy on petrol to maintain the current pump price.\nWe have always been clamouring; let the refineries work.\u0094 Also speaking, IPMAN Spokesman, Chief Chinedu Ukadike, insisted that the subsidy on petrol was being returned gradually.\nThis takes us to the importance of domestic refining, which will enable us to check the demand for dollars and importation of petroleum products.\nFor once the dollar is rising, there\u0092s nothing you can do to stop the simultaneous rise in petrol price.\n\u0093If not, it means the Federal Government is subsidising petroleum products, which implies that subsidy has indirectly returned.\u0094 NAIJANEWSNEWS SECTIONS"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/21/37.html",
            "summary": "Popular Nigerian TV host, Rufai Oseni has condemned the impulsive manner President Bola Tinubu announced the removal of fuel subsidy.\nNaija News recalls that in his inauguration speech on May 29, the president announced the removal of the petrol subsidy.\nTinubu later revealed that his aides left out the decision for the removal of petrol subsidy from his inauguration speech.\nAccording to Tinubu, the removal of the petrol subsidy was not contained in his written speech, but he summoned the courage to say \u0093fuel subsidy is gone\u0094.\nRecounting the situation via a post on Twitter, Oseni said that the same people who praised Tinubu over his impulsive and courageous move are now lamenting about hardship in the economy."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/23/304.html",
            "summary": "By Juliet Umeh • Task FG on new policy, incentives to reverse brain drain The stakeholders in the telecommunications sector have called on the Federal Government, FG, to address the brain drain popularly known as \u0091Japa syndrome\u0092 by young talented Nigerians.\nThe Chairman of the Association of Licensed Telecoms Operators of Nigeria, Engr.\n\u0093I think the time has come when the industry has to begin to make preparations for their return.\nSpeaking on the effort to tackle the \u0091Japa Syndrome\u0092, Danbatta, who was represented by the Executive Commissioner, Technical Services, NCC, Engr Ubale Maska, disclosed that a lot of policies have been created to address brain drain in the ICT sector.\nThe trust of the meeting is to ensure that they get value for their innovations,\u0094 Danbatta further explained."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/2/8.html",
            "summary": "\u0093Upon that, schools have increased fees and the cost of books and everything about school has gone up.\nSome parents are thinking of changing their children\u0092s schools, to take them to where school fees are less, though the quality may not be too good.\nHe said: \u0093I was unable to pay school fees of my children last term.\nIn Abuja, 45-year-old mother of three, Roseline Agboola, said she was looking for about N500, 000 to pay school fees of three children.\n\u0093The proprietress of my children\u0092s school called to inform us that their school fees have been doubled."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/6/9.html",
            "summary": "The fund is usually deducted before NNPC makes any remittance into the account meant for the three tiers of government.\nThe crude oil price in July was $78.50 per barrel, it traded for $88.50 per barrel in the last week of August.\nAlso, while the price per litre at the international market in July was $0.641, it stood at $0.792 in the last week of August.\nWith these developments, the average subsidy on every litre is about N200 per litre.\nFormer chairman of the Oil Marketers Association of Nigeria (MOMAN), Tunji Oyebanji had earlier warned proper approach to the subsidy removal was sacrosanct."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/12/30.html",
            "summary": "By Tayo Elegbede Indications have emerged that oil marketers might be losing hope for local refining of fuel soon, as the 650,000 barrels per day Dangote Refinery is yet to commence any local production even after a promised deadline.\nThe situation has sent a not-too-good signal to the oil industry as stakeholders were much expectant, and hopefully, the start of local production by the facility would bring succour to Nigerians.\nA top source among the Major Oil Marketers Association of Nigeria (MOMAN) confirmed this development, saying the NNPCL had indeed cut down importation with the hope of Dangote refinery pushing out some product last month.\nMeanwhile, amidst all this agitation, Dangote Refinery has remained mum over the issue, as officials of the Communications Department of the facility could not give any concrete explanation.\nBut a source at the refinery told The Punch that the management was unsure of when petrol refining would begin at the Ibeju-Lekki facility."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/31/25.html",
            "summary": "After being inaugurated on May 29, 2023, President Bola Ahmed Tinubu has finally moved into the presidential residence in Aso Rock in Abuja.\nNaija News reports that the official residence has been under renovation since April which led to the president operating from his private residence in Asokoro since his inauguration.\nRecall that before President Muhammadu Buhari left office, he and his family moved to the Glass House, usually a transit accommodation, following the renovation of the main residence.\nBut according to TheCable, President Tinubu moved to the Glass House on Sunday night pending the completion of the renovation of the president\u0092s official residence in August."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/18/7.html",
            "summary": "The Athletics Association of Nigeria (AFN) and many other followers of the sport heaved a sigh of relief yesterday when the news broke that 100-metre hurdles women\u0092s world record holder, Oluwatobilola Amusan, has been cleared of the dope charges levelled against her by the Athletics Integrity Unit (AIU) of World Athletics.\nAmusan was suspended provisionally by the AIU pending investigations of her missed whereabout tests early last month.\nThe Nigerian, who broke the 100-metre hurdles record at the last World Championships in Oregon, U.S., was assumed to have committed an offence punishable with at least two years suspension from athletics, as she was said to have dodged antidoping tests by AIU agents.\nBut from the onset, she insisted on her innocence, saying there must have been miscommunication somewhere.\nAccording to reports from Budapest, Hungary, venue of the World Championships, which begin tomorrow, a tribunal of three arbitrators exonerated Amusan from two out of the three test failures when the Nigerian argued that the tester did not do enough to locate her."
        }
    ],
    "Kwara": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/12/14.html",
            "summary": "Kwara State governor, AbdulRahman AbdulRazaq, has approved the deployment of government buses to support movement of students and workers in public tertiary institutions within Ilorin, the capital city, and its environs.\nChief Press Secretary to the governor, Rafiu Ajakaye, said, yesterday, that the initiative is the second phase of measures by the government to cushion effects of fuel subsidy removal.\nThe government had, earlier, reduced workdays for civil servants from five to three, every week, while bureaucrats are expected to work out other measures for workers that are exempted from the policy.\nAccording to a statement, \u0093from Wednesday, June 14, some large buses will be deployed to transport students of public tertiary institutions within the metropolis, including those going to the Kwara State University campus at Malete."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/12/34.html",
            "summary": "By Richard Ogunsile Fulani herders association, Miyetti Allah, has appealed to President Bola Tinubu\u0092s government to consider its people in the ongoing distribution of palliative to cushion the effect of fuel subsidy removal in the country, Naija News reports.\nChairman of Miyetti Allah in Kwara State, Malam Bello Abubakar, appealed yesterday while interacting with journalists in Ilorin, the state capital, saying that the herders were the most affected people during this period.\nAccording to him, most of the herders have no bank accounts where they can easily access funds when in need.\nSuspected Hoodlums Hijack Three Truckloads Of Palliative Rice In Kwara Meanwhile, three truckloads of palliative rice were reportedly hijacked last Friday by suspected hoodlums at the Oja-Oba/Idi-Ape/Isale-Oja areas of Ilorin West and Ilorin East local government areas of Kwara State.\nThey were reportedly passing through the area when they were attacked and hijacked by the suspected hoodlums at around 6:30 p.m. on Friday."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/11/29.html",
            "summary": "Three truckloads of palliative rice were reportedly hijacked by suspected hoodlums at the Oja-Oba/Idi-Ape/Isale-Oja areas of Ilorin West and Ilorin East local government areas of Kwara State.\nNaija News gathered that the Toyota Dana trucks loaded with bags of 10kg of rice were headed for an unknown destination.\nThey were passing through the area when they were attacked and hijacked by the suspected hoodlums at around 6:30 p.m. on Friday.\nSome eyewitnesses told Daily Trist that the incident had happened a few meters from the \u0091C\u0092 division police station.\nStill, this platform gathered that the operatives of the police only got there after the incident."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/8/123.html",
            "summary": "By Ignatius Igwe Tinubu urged the governors to downplay their differences and jointly focus on alleviating the sufferings and pains of the people.\nNigerian governors have backed President Bola Tinubu\u0092s decision to end fuel subsidy payments in the country.\nLed by its Chairman, AbdulRahman AbdulRazaq of Kwara State, the Nigerian Governors\u0092 Forum (NGF) commended President Tinubu for tackling the fuel subsidy behemoth, promising to work with him to ameliorate the short-term impact of the decision.\nIn his remarks, Tinubu urged the governors to downplay their differences and jointly focus on alleviating the sufferings and pains of the people.\nPresident Bola Tinubu meets with Nigerian governors on Wednesday, June 7, 2023."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/8/111.html",
            "summary": "Kwara State Government is set to provide appropriate allowances to support state public workers to cushion the effects of the abolition of fuel subsidy by the Federal government.\nThis is in furtherance of the recently approved reduction in workdays for its civil servants from five to three days.\nA statement by the Chief Press Secretary to the state Head of Service, Murtala Atoyebi in Ilorin on Wednesday, disclosed that \u0093the government was set to provide succor for workers that could not be covered by the reduction in workdays due to peculiar nature of their official duties.\n\u0093To this end, the government is working to provide appropriate allowances to support these categories of workers as a stop-gap measure, pending conclusions on the review of minimum wage.\u0094DAILY POST recalls that the state government had on Monday announced reduction in workdays from five to three days for its civil servants as part of efforts to address the challenges of fuel subsidy removal."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/6/25.html",
            "summary": "The Kwara State government has revoked its directive that reduced working days from five days to three days for civil servants following the removal of fuel subsidy by the federal government.\nThe state government had recently reduced civil servant work days to relieve the impact of the fuel subsidy removal on civil servants in the state.\nHowever, a letter signed by Okedare Adeyinka for the Head of Service, Susan Oluwole, to the state\u0092s heads of Ministries, Departments, and Agencies (MDAs) on Wednesday, June 26, reversed the directive, allowing the federal government and organised labour to work out modalities for more efficient interventions to mitigate the effect of the subsidy removal."
        }
    ],
    "Enugu": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/7/303.html",
            "summary": "The Isi-Uzo Legislature in Enugu State has suspended a Councilor for allegedly embezzling money meant for relief items for the Internally Displaced Persons (IDPs) in his constituency.\nThe lawmaker was suspended during plenary on Thursday.\nMoving a motion for the suspension of the embattled lawmaker, the Majority Leader of the Legislature and Councilor representing Neke Ward 2, Hon.\nNnabuike Ugwu, expressed worry that the fund released for palliatives to ameliorate the sufferings of IDPs in Umualor Community was yet to be released to them by the Councilor many months after the disbursement.\nUgwu also accused the Councilor of divulging matters discussed in a closed door session of the Legislature contrary to Rule 3(e) of Isi-Uzo Legislature."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/9.html",
            "summary": "For instance, the transport fare from Ojota to Alausa Secretariat, which was increased to N300 as a result of fuel subsidy removal, was still N300 two weeks after the governor\u0092s announcement.\nMeanwhile, findings by The Guardian showed that other states, including Delta, Enugu, Abia, Imo and Kaduna are yet to unveil any concrete plan to mitigate the impact of the petrol subsidy removal on vulnerable residents in their domains.\nIn Delta, Governor Sheriff Oborevwori has only promised residents that their sufferings as a result of the removal of petrol subsidy would soon be history.\nAnambra State government is yet to announce to the public its plans and measures to cushion the effect of subsidy removal.\nAlso, residents of Benue State are still waiting for the government to roll out its subsidy palliatives."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/6/12.html",
            "summary": "The Enugu State government has set up palliative distribution committees to oversee the equitable distribution of support in all the 260 wards.\nThe Deputy Governor, Ifeanyi Ossai, also Chairman of the committees, urged members to ensure that the vulnerable in the 260 wards received the relief materials.\nOssai said at the inauguration in Enugu that the ward committees were made public for proper identification and active participation.\nPeter Mbah, has directed that the distribution should be transparent and open to public scrutiny.\n\u0093In every ward in our state, people know the indigent people who are mostly affected by the removal of fuel subsidy and its imminent effects on the living conditions of the citizens."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/3/13.html",
            "summary": "Enugu State governor Peter Mbah By Lawrence Njoku (Enugu) In a bid to cushion the effects of subsidy removal and raise the purchasing power of vulnerable citizens of Enugu State, Governor Peter Mbah, yesterday, inaugurated a committee on Verification and Payment of Outstanding Pensions and Gratuities to State Retirees.\nOthers are the state Chairman of the Trade Union Congress (TUC), Ben Asogwa; state Chairman of the Nigeria Labour Congress (NLC), Fabian Nwigbo, and the Chairman, Public Service Joint Negotiating Council, Ezekiel Omeh.\n\u0093We did say that our vision is to eradicate poverty in the state.\n\u0093We also know that the recent policy fuel subsidy removal will certainly have some impacts on our most vulnerable ones.\n\u0093It is, therefore, the state government\u0092s policy to ensure that we put in place measures, immediate, short, medium and long-term, to address the impact.\u0094 GUARDIANNEWS SECTIONS"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/may/23/11.html",
            "summary": "Second Niger Bridge By Godwin Ijediogor, Asaba Travellers to Enugu, Owerri, Aba and other parts of the South East from Asaba, Delta State, will experience some traffic relief from today as President Muhammadu Buhari commissions the Second Niger Bridge and its access roads.\nAfter almost five decades of failed promises by successive administrations, Buhari has completed the 11.5-kilometre bridge in Onitsha, across the River Niger, connecting Asaba with Ogbaru, in Anambra State, and beyond.\nThe First Niger Bridge was constructed over 60 years ago, and has become too narrow for the volume of traffic from Asaba to Onitsha and vice versa.\nBuilt-in 1965, it had remained the major link between the South West, South East and South South over the years.\nBut excessive axle load and traffic congestion, due to growing economic/commercial activities on that transport corridor, has made construction of the Second Niger Bridge imperative."
        }
    ],
    "Imo": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/12/302.html",
            "summary": "The Senate has resolved to probe the payment of N9.3 trillion by the Federal Government in 30 months, under the petrol subsidy regime.\nThe Red Chamber made the resolution on Tuesday, during the plenary, after a motion moved by the lawmaker representing Imo North, Chiwuba Ndubueze.\nMoving the motion, Ndubueze said the fuel subsidy removal must be investigated after the expenses incurred by the government runs into trillions of naira.\nNdubueze said in 10 years \u0097 2006 to 2015 \u0097 the federal government, through NNPC Ltd, claimed N170 billion as under-recovery.\nThe lawmaker added that the national oil company also expended N843.121 billion on under-recovery between January 2018 and January 2019."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/9.html",
            "summary": "For instance, the transport fare from Ojota to Alausa Secretariat, which was increased to N300 as a result of fuel subsidy removal, was still N300 two weeks after the governor\u0092s announcement.\nMeanwhile, findings by The Guardian showed that other states, including Delta, Enugu, Abia, Imo and Kaduna are yet to unveil any concrete plan to mitigate the impact of the petrol subsidy removal on vulnerable residents in their domains.\nIn Delta, Governor Sheriff Oborevwori has only promised residents that their sufferings as a result of the removal of petrol subsidy would soon be history.\nAnambra State government is yet to announce to the public its plans and measures to cushion the effect of subsidy removal.\nAlso, residents of Benue State are still waiting for the government to roll out its subsidy palliatives."
        }
    ],
    "Rivers": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/23.html",
            "summary": "By Ann Godwin, Port Harcourt Subsidy palliative transport scheme, flagged off by Rivers State government, on Tuesday, has triggered controversies, The state Governor, Siminalayi Fubara, while launching 17 coastal buses, said the scheme was part of his administration\u0092s interventions to cushion the high cost of living caused by fuel subsidy removal.\nBut the opposition political party in the state, the All Progressives Congress (APC) has dismissed the fanfare at the ceremony as mere jamboree.\nThe party claimed that the buses were purchased by former Governor Chibuike Amaechi in 2011 when the state hosted the National Sports Festival, adding that the vehicles were later used to transport civil servants to and from work.\nDuring a visit to the area, some eyewitnesses told The Guardian that they saw when the buses were being refurbished at the RTC mechanic park.\nAlso, The Guardian learnt that some of the buses broke down on the road two days after they were flagged off due to mechanical faults."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/3/814.html",
            "summary": "By George Oshogwe Ogbolu Governor Bala Mohammed of Bauchi State has emerged Chairman of the Peoples Democratic Party (PDP) Governors\u0092 Forum.\nNaija News reports that Adamawa State Governor, Ahmadu Umaru Fintiri, disclosed this shortly after a retreat for elected PDP Governors and Members of National Assembly elect.\nGovernor Siminalayi Fubara of Rivers state emerged the Vice Chairman of the PDP Governors\u0092 Forum.\nMohammed replaced his counterpart, Governor Seyi Makinde of Oyo state, who also attended the PDP retreat.\n\u0093Between 1999 and 2007, the PDP government initiated the petroleum subsidy removal and I chaired the committee,\u0094 Atiku said."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/12/14.html",
            "summary": "Rivers State Governor, Siminalayi Fubara, has flagged off a free transport scheme to ease the challenges faced by residents due to the removal of fuel subsidy.\nSpeaking during Tuesday\u0092s flag-off at the Rivers State Transport Company Complex in Port Harcourt, Fubara, who was represented by his Deputy, Prof. Ngozi Nma Odu, said the government was aware of the effect that the removal of fuel subsidy is having on the people.\nHe said this necessitated the decision to initiate the intervention.\nThe commissioner noted that the introduction of the Free Transport Scheme was in line with the social contract his administration has with the Rivers people.\nHe charged the operators of the buses to be committed and show due diligence to duties while calling on the public who are the end users of the free transport intervention scheme to see it as a gift and treasure it."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/1/1.html",
            "summary": "The Nigeria Labour Congres (NLC) has declared a two-day warning strike which will begin on Tuesday, September 5, 2023.\nNLC and TUC led, during a protest against Subsidy removal and other issues.\nNLC President, Joe Ajaero, made disclosed this on Friday during a press conference at the Labour House in Abuja,According to Ajaero, the two-day warning strike is in protest against the Federal Government for failing to address the challenges caused by the removal of fuel subsidy.\nOn August 2, the NLC held a protest on what it described as the anti-people policies of the current administration.\nThe NLC, Trade Union Congress (TUC) and their affiliate unions demonstrated in Abuja and several states, including Lagos, Abia, Plateau, Kaduna, Kano, Rivers."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/5/43.html",
            "summary": "By Timothy Crown, Friday Okeregbe and Reuben Okwa The two-day warning strike of the Nigeria Labour Congress (NLC) commenced on Tuesday to partial compliance from workers in some parts of the country, including Lagos State, Rivers State, and Abuja.\nSome Lagosians expressed their frustration over the hardship occasioned by the removal of fuel subsidies by President Bola Tinubu.\nBut the industrial action order did not have any effect at the Lagos State Secretariat where workers were seen going about their regular business.\nIn Abuja, the block housing the Federal Ministry of Education at the Federal Secretariat was locked for about five minutes and later opened for civil servants to resume work.\nThe situation was similar at the Rivers State Secretariat as some civil servants were seen at the Secretariat."
        }
    ],
    "Ebonyi": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/7.html",
            "summary": "The Ebonyi State Government has approved a salary increase of N10,000 for the state workers as a palliative to cushion the effect of the removal of subsidy on Premium Motor Spirits (PMS) popularly known as petrol.\nThe Ebonyi Commissioner for Information and Orientation, Engr Jude Okpor disclosed this while briefing Journalists in Abakaliki, the State Capital on Friday.\nOkpor while speaking on the outcome of the State Executive Council Meeting, chaired by the Ebonyi governor, Francis Nwifuru said the government has also approved the recruitment of 1,454 workers in the State.\n\u0093His Excellency the Chairman of Council approved that N10,000 be added to every worker\u0092s salary in the state to cushion the effect of fuel subsidy removal,\u0094 he said.\n\u0093His Excellency also mandated SSG, Professor Grace Umezuruike to look into the finances of the state University (EBSU) to know what comes out and goes into the University to help determine the upwards review of subvention to the institution."
        }
    ],
    "Kaduna": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/14/313.html",
            "summary": "Former Kaduna Central lawmaker, Shehu Sani has reacted to President Bola Tinubu\u0092s plan to pay N8,000 palliatives to 12 million Nigerian families.\nNaija News recalls that in a letter read in the House of Representatives during plenary on Thursday, the Federal Government had announced that 12 million households will get N8,000 for six months to ameliorate the hardships faced by Nigerians as a result of subsidy removal.\nTinubu said the initiative was designed to enable indigent and vulnerable Nigerian people to cope with the cost of meeting basic needs.\nThe President explained that it would have a multiplier effect on about 60 million individuals.\nHe stated that to ascertain the credibility of the process, digital transfers would be made directly to beneficiaries accounts."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/22/302.html",
            "summary": "Former Kaduna lawmaker and socio-political commentator, Shehu Sani has backed Governor Charles Soludo of Anambra state on the distribution of palliative, saying the governors may divert the President Bola Tinubu\u0092s proposed palliatives.\nSani stated this in a statement via his verified Twitter handle on Saturday.\nAccording to the former senator, some state governors might use the funds for palliative to pay contractors, pay backlog of salaries, settle domestic debt, among others.\nHe urged the President Bola Tinubu\u0092s administration to ensure proper checks on the palliative funds.\nSani stated, \u0093Without proper check, some states will use palliative funds to pay contractors they are owing or pay the inherited backlog of salaries and pensions or use it to settle their domestic debts with Banks or use it settle political supporters; Soludo is right, all states are not equal.\u0094"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/9.html",
            "summary": "For instance, the transport fare from Ojota to Alausa Secretariat, which was increased to N300 as a result of fuel subsidy removal, was still N300 two weeks after the governor\u0092s announcement.\nMeanwhile, findings by The Guardian showed that other states, including Delta, Enugu, Abia, Imo and Kaduna are yet to unveil any concrete plan to mitigate the impact of the petrol subsidy removal on vulnerable residents in their domains.\nIn Delta, Governor Sheriff Oborevwori has only promised residents that their sufferings as a result of the removal of petrol subsidy would soon be history.\nAnambra State government is yet to announce to the public its plans and measures to cushion the effect of subsidy removal.\nAlso, residents of Benue State are still waiting for the government to roll out its subsidy palliatives."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/16/323.html",
            "summary": "The removal of fuel subsidy as announced by President Bola Tinubu on May 29, 2023, has reduced the daily consumption of petrol by Nigerians from 65 million to 40 million, Vanguard reports.\nAccording to him, the committee is composed of Governors of Kebbi state, as Chairman, Anambra representing the South East geopolitical zone.\nBenue North Central, Kaduna Northwest, Bauchi, representing the northeast, Cross River, South-South and Oyo state Southwest.\nSpeaking after the meeting, Otti said, \u0093As part of the inaugural national economic council meeting today, the major focus was on the removal of petroleum subsidy and implied the removal of subsidy on foreign exchange, which has led to some convergence of some sort.\nInitially, it had reduced the consumption from about 66, 67 million litres a day to just about 40 million."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/29/2.html",
            "summary": "A trader and businessman, Alhamdu China, who operates a barber\u0092s shop in Barnawa area of Kaduna, said the removal of fuel subsidy had affected businesses in the state.\nThis removal of fuel subsidy has killed businesses, and is even sending many people to their untimely graves.\nTo him, the increase in the pump price of petrol is not a result of removal of fuel subsidy, because there has never been a subsidy on fuel in the country.\n\u0093The prices were not increased irrationally, the government introduced some programmes that cushioned the grave effects of subsidy removal from petrol.\n\u0093The more troubling thing about fuel subsidy politics is that critics say that it is a scam orchestrated by the power elite."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/1/1.html",
            "summary": "The Nigeria Labour Congres (NLC) has declared a two-day warning strike which will begin on Tuesday, September 5, 2023.\nNLC and TUC led, during a protest against Subsidy removal and other issues.\nNLC President, Joe Ajaero, made disclosed this on Friday during a press conference at the Labour House in Abuja,According to Ajaero, the two-day warning strike is in protest against the Federal Government for failing to address the challenges caused by the removal of fuel subsidy.\nOn August 2, the NLC held a protest on what it described as the anti-people policies of the current administration.\nThe NLC, Trade Union Congress (TUC) and their affiliate unions demonstrated in Abuja and several states, including Lagos, Abia, Plateau, Kaduna, Kano, Rivers."
        }
    ],
    "Anambra": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/15/326.html",
            "summary": "He stressed that N8000 to 12 million households was not enough to cushion the effect of the fuel subsidy removal, insisting that almost every parent need the money across the because of the level of poverty in the nation.\n\u0093As a governor of Anambra State, I didn\u0092t really know the difference between the children in public schools and private schools because the children are not private.\nWhen people talk about private schools, I say well, it does not matter to me when I am supplying computers to public schools, I gave to private schools as well.\nHe charged the graduating students to always maintain good character, discipline, be truthful and do the right thing, saying education was what they need to succeed.\nChairman, Pacesetters Schools, Abuja, Barr Kenneth Imansuangbon, on his part charged the graduating students to be good ambassadors of the school, saying the school has given training and moulded them to be of good character."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/22/302.html",
            "summary": "Former Kaduna lawmaker and socio-political commentator, Shehu Sani has backed Governor Charles Soludo of Anambra state on the distribution of palliative, saying the governors may divert the President Bola Tinubu\u0092s proposed palliatives.\nSani stated this in a statement via his verified Twitter handle on Saturday.\nAccording to the former senator, some state governors might use the funds for palliative to pay contractors, pay backlog of salaries, settle domestic debt, among others.\nHe urged the President Bola Tinubu\u0092s administration to ensure proper checks on the palliative funds.\nSani stated, \u0093Without proper check, some states will use palliative funds to pay contractors they are owing or pay the inherited backlog of salaries and pensions or use it to settle their domestic debts with Banks or use it settle political supporters; Soludo is right, all states are not equal.\u0094"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/9.html",
            "summary": "For instance, the transport fare from Ojota to Alausa Secretariat, which was increased to N300 as a result of fuel subsidy removal, was still N300 two weeks after the governor\u0092s announcement.\nMeanwhile, findings by The Guardian showed that other states, including Delta, Enugu, Abia, Imo and Kaduna are yet to unveil any concrete plan to mitigate the impact of the petrol subsidy removal on vulnerable residents in their domains.\nIn Delta, Governor Sheriff Oborevwori has only promised residents that their sufferings as a result of the removal of petrol subsidy would soon be history.\nAnambra State government is yet to announce to the public its plans and measures to cushion the effect of subsidy removal.\nAlso, residents of Benue State are still waiting for the government to roll out its subsidy palliatives."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/24/50.html",
            "summary": "Governor Charles Soludo of Anambra State has disagreed with his Edo State counterpart, Godwin Obaseki, on the federal government\u0092s palliative measures for cushioning the effects of fuel subsidy removal.\nNaija News earlier reported that Obaseki, while speaking with journalists in Benin City on Wednesday, described the federal government\u0092s palliative concept as deceptive and fraudulent.\nHe also expressed shock and fear about the federal government\u0092s inability to plan and effectively respond to the effects of the fuel subsidy removal policy that has further improvised Nigerians.\nBut in a chat with Leadership on Wednesday, Soludo, through his media aide, Christian Aburime, said the federal government\u0092s palliative measures were not fraudulent, and they are capable of cushioning the effect of the fuel subsidy removal.\nSoludo asserted that the recent palliative measures will at least begin to ameliorate the suffering of the masses until a long-term solution is provided."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/8/803.html",
            "summary": "During the unveiling, Dr. Innocent Chukwuma, Chief Executive Officer of IVM, assured Nigerians of the safety of CNG vehicles and the availability of various types of cars.\nCNG vehicles bring a solution to total dependence on one or two kinds of vehicles.\nThe CNG vehicles are a solution, that\u0092s why we produce them.\nWe made space for CNG, LNG, and fuel so that anyone available in an area can be used to drive the vehicles.\nSimilarly, the Governor of Anambra State, represented by the Commissioner for Industry, Anambra State, Mr. Christian Udechukwu, stated that the state is preparing to address the challenges that Nigerians face as a result of the removal of subsidies."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/16/323.html",
            "summary": "The removal of fuel subsidy as announced by President Bola Tinubu on May 29, 2023, has reduced the daily consumption of petrol by Nigerians from 65 million to 40 million, Vanguard reports.\nAccording to him, the committee is composed of Governors of Kebbi state, as Chairman, Anambra representing the South East geopolitical zone.\nBenue North Central, Kaduna Northwest, Bauchi, representing the northeast, Cross River, South-South and Oyo state Southwest.\nSpeaking after the meeting, Otti said, \u0093As part of the inaugural national economic council meeting today, the major focus was on the removal of petroleum subsidy and implied the removal of subsidy on foreign exchange, which has led to some convergence of some sort.\nInitially, it had reduced the consumption from about 66, 67 million litres a day to just about 40 million."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/may/23/11.html",
            "summary": "Second Niger Bridge By Godwin Ijediogor, Asaba Travellers to Enugu, Owerri, Aba and other parts of the South East from Asaba, Delta State, will experience some traffic relief from today as President Muhammadu Buhari commissions the Second Niger Bridge and its access roads.\nAfter almost five decades of failed promises by successive administrations, Buhari has completed the 11.5-kilometre bridge in Onitsha, across the River Niger, connecting Asaba with Ogbaru, in Anambra State, and beyond.\nThe First Niger Bridge was constructed over 60 years ago, and has become too narrow for the volume of traffic from Asaba to Onitsha and vice versa.\nBuilt-in 1965, it had remained the major link between the South West, South East and South South over the years.\nBut excessive axle load and traffic congestion, due to growing economic/commercial activities on that transport corridor, has made construction of the Second Niger Bridge imperative."
        }
    ],
    "Kano": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/15/322.html",
            "summary": "Kano State Deputy Governor, Comr.\nAminu Abdussalam Gwarzo, has vehemently denied and distanced himself and the state government from recent news circulating on various media platforms.\nIn a statement released to journalists on Saturday, Gwarzo\u0092s Press Secretary, Ibrahim Garba Shuaibu, clarified the Deputy Governor\u0092s stance.\nAccording to Shuaibu, Gwarzo had referred to a news segment he watched on Thursday morning featuring Senator Ali Ndume, who expressed concerns about the allocation formula.\n\u0093The Deputy Governor made this reference while receiving a delegation from the Kano Cooperative Society at the state government house, as they commemorated the 2023 International Day of Cooperatives\u0094 Garba disclosed."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/15/313.html",
            "summary": "By Bashir Bello Kano State Governor, Abba Kabir Yusuf has criticized the federal government\u0092s allocation of N500 billion through the Bank of Industry to support small-scale industries across the country\u0092s geopolitical zones.\nGovernor Yusuf, who was represented by his Deputy Comr.\nThe statement further said, \u0093Governor Yusuf announced that the state government would engage Cooperative Societies in designing poverty eradication and sustainable development programs.\n\u0093He highlighted the fact that Kano State has over 2.8 million cooperative members, primarily consisting of young people.\nMairo Audi Danbatta, expressed solidarity with the cooperative movement and encouraged the youth to embrace cooperative business ventures as a means of reducing unemployment in Kano State."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/21.html",
            "summary": "By Olugbenga Ige The Arewa Consultative Forum (ACF) has slammed the Bola Tinubu-led federal government for giving N5 billion as a palliative fund for states to cushion the impact of the petrol subsidy removal.\nReacting in an interview with Daily Trust, ACF Spokesman, Professor Tukur Muhammad-Baba, described the palliatives fund to the state government as shambolic and unscientific.\nMuhammad-Baba said the government was wrong for giving the same amount to Lagos, Oyo, Kano and Bayelsa states, as their populations and statistics of eligible people differ.\nI mean, if you are looking for poor people, are you allocating the same amount to Bayelsa, Lagos, Oyo, and Kano states, and you expect it to make an impact?\nThe number of people suffering from poverty in Lagos, Oyo, and Kano will not be the same as those living in poverty in Bayelsa, Taraba, or Jigawa."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/27/304.html",
            "summary": "The economic crunch occasioned by the removal of fuel subsidy has grossly affected commercial sex workers in Kano State as they groan as a result of low patronage by their customers.\nBenjamin said one round of sex now go for as low as between N500 and N700 for the same services.\n\u0093In this very particular room, I pay N5,000 every day; and I must confess to you that I am owing the management three days debt now because of low patronage.\n\u0093Before fuel subsidy removal, we were enjoying high patronage with good prices.\n\u0093Since the fuel subsidy removal, we have been suffering."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/1/1.html",
            "summary": "The Nigeria Labour Congres (NLC) has declared a two-day warning strike which will begin on Tuesday, September 5, 2023.\nNLC and TUC led, during a protest against Subsidy removal and other issues.\nNLC President, Joe Ajaero, made disclosed this on Friday during a press conference at the Labour House in Abuja,According to Ajaero, the two-day warning strike is in protest against the Federal Government for failing to address the challenges caused by the removal of fuel subsidy.\nOn August 2, the NLC held a protest on what it described as the anti-people policies of the current administration.\nThe NLC, Trade Union Congress (TUC) and their affiliate unions demonstrated in Abuja and several states, including Lagos, Abia, Plateau, Kaduna, Kano, Rivers."
        }
    ],
    "Lagos": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/15/33.html",
            "summary": "The closure is for immediate remedial palliative works by the Lagos State Public Works in conjunction with Federal Ministry of Works and Housing, according to the state government.\nThe Lagos State Government has announced that Eko Bridge inwards the newly re-opened Apongbon Bridge will close for 24 hours on Sunday, 16th July, 2023.\nThe closure is for immediate remedial palliative works by the Lagos State Public Works in conjunction with Federal Ministry of Works and Housing, according to the state government.\nAbdulhafiz Toriola made this statement known on Saturday, saying that the 24 hour closure will allow uninterrupted palliative adjustment of the bridge.\nTorioala, however, confirmed that the Lagos State Traffic Management Authority (LASTMA) Personnel have been deployed to control and manage traffic around C.M.S, Marina, Ijora, and other alternative routes on the Lagos Island and Mainland."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/18/30.html",
            "summary": "In Lagos, the NNPC sold the product for N565 while some other stations sold higher.\nThe product sells higher in Abuja where at least two NNPC stations visited had adjusted their price from N539 to N617 per litre with other stations selling higher.\nThe increase in price is the second significant jump in the price since May 29, when President Bola Ahmed Tinubu announced that the fuel subsidy was gone.\nDeclining Naira, Rising Inflation The fuel price jump had been followed with the free float of the naira in line with President Tinubu\u0092s promise of harmonising various exchange rates.\nThe naira float has seen the currency plunge from below N500 per dollar on the official exchange windows to a record low of above N800 naira."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/21.html",
            "summary": "By Olugbenga Ige The Arewa Consultative Forum (ACF) has slammed the Bola Tinubu-led federal government for giving N5 billion as a palliative fund for states to cushion the impact of the petrol subsidy removal.\nReacting in an interview with Daily Trust, ACF Spokesman, Professor Tukur Muhammad-Baba, described the palliatives fund to the state government as shambolic and unscientific.\nMuhammad-Baba said the government was wrong for giving the same amount to Lagos, Oyo, Kano and Bayelsa states, as their populations and statistics of eligible people differ.\nI mean, if you are looking for poor people, are you allocating the same amount to Bayelsa, Lagos, Oyo, and Kano states, and you expect it to make an impact?\nThe number of people suffering from poverty in Lagos, Oyo, and Kano will not be the same as those living in poverty in Bayelsa, Taraba, or Jigawa."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/14/311.html",
            "summary": "Nigerian singer, Joseph Akinwale, popularly known as Joeboy has announced plans to provide residents of Lagos with free buses to help cushion the effect of the hike in transportation fares.\nThe buses, which according to him will ply some popular routes in Lagos, will be free and run between the hours of 8 am and 5 pm.\nJoeboy said the initiative was borne out of his genuine desire to help cushion the effect of the economic condition which he said was as hard on people.\n\u0093I know the fuel subsidy p is hard on everyone right now so here\u0092s my little way of helping.\nFor the next 3 days, there will be FREE Body & Soul buses along the following routes between 8 am and 5 pm."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/1/102.html",
            "summary": "A chieftain of the All Progressives Congress, APC, in Lagos State, Joe Igbokwe, has cried out over the biting effect of the fuel subsidy removal.\nIgbokwe said he was recently furious and angry after buying a N20,000 worth of fuel, which he said didn\u0092t go half of his vehicle\u0092s tank.\nIn a post via his Facebook page on Friday, the APC chieftain said he has now disciplined himself and chooses wisely before he goes to any place.\nHe wrote, \u0093I bought 20k fuel for my 4-wheel drive and the gauge did not get to half tank.\nI was furious, angry."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/1/44.html",
            "summary": "Tinubu\u0092s speech was hurriedly put together in order to dissuade the suffering masses and the organised labour from embarking on protests.\n\u0093Tinubu also lied when he claimed that he had for years been an advocate of subsidy removal.\nThis was a man who in 2012 described petrol subsidy removal as \u0091the Goodluck Jonathan tax,\u0092 and sponsored protests in Lagos State.\n\u0093Shouldn\u0092t the discussion on the increase of minimum wage have been done prior to subsidy removal?\nSpeaking further, Shaibu insisted that Tinubu\u0092s plan to provide N50,000 grants to small businesses would be undermined by inflation, exchange rate problems and corruption."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/2/7.html",
            "summary": "By Dennis Erezi Nigeria\u0092s labour unions \u0096 the Nigeria Labour Congress (NLC), Trade Union Congress (TUC) and their affiliate unions, started their protest on Wednesday in Abuja, Lagos and other parts of the country.\nProtesters in Abuja on Wednesday who began their demonstration from the Unity Fountain broke down the first gate of the National Assembly complex and forced their way into the premises.\nGovernment representatives led by Tinubu\u0092s chief of staff Femi Gbajabiamila have had meetings with labour unions but were unable to reach an agreement.\nAmid pleas to reconsider the planned protest, Ajero said there was no going back until the government meets their demands.\n\u0093Sadly, there was an unavoidable lag between subsidy removal and these plans coming fully on line."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/2/25.html",
            "summary": "Following the hardship due to fuel subsidy removal, the son of the general overseer of the Redeemed Christian Church of God (RCCG), Pastor Enoch Adeboye, Leke Adeboye, has donated fuel to some worshippers in the church.\nNaija News reports that Adeboye, who is also the lead pastor at the RCCG, LSC The Bridge in Ikeja, Lagos, made the donation on Sunday.\nAccording to a statement on Tuesday, the move was to assist the worshippers amid the hike in the price of premium motor spirit.\nThe statement read, \u0093It was an unusual church service on Sunday for many members of the LSC The Bridge: one of the RCCG\u0092s vibrant youth churches led by Pastor Leke Adeboye.\n\u0093Over 1,000 litres of fuel were contributed to support anyone who came to church on Sunday with their vehicle.\u0094"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/6/12.html",
            "summary": "By Soonest Nathaniel Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Bola Ahmed Tinubu over \u0093the failure to publish spending details of about N400bn so far saved as a result of the removal of subsidy on Premium Motor Spirit (PMS) popularly called petrol.\u0094 The suit followed reports that the Federal Government has saved N400bn within the four weeks following the implementation of the removal of subsidy on petrol policy.\u0094 In the suit number FHC/L/CS/1514/2023 filed last week at the Federal High Court in Lagos, SERAP is seeking: \u0093an order of mandamus to direct and compel President Tinubu to publish details of spending of about N400 billion saved as a result of the removal of subsidy on petrol on 29 May, 2023.\u0094 SERAP is also seeking: \u0093an order of mandamus to direct and compel President Tinubu to provide details of the plans on how the savings from the removal of subsidy on petrol, including specific projects on which the funds would be spent.\u0094 SERAP is also seeking: \u0093an order of mandamus to compel President Tinubu to provide details of the mechanisms that have been put in place to ensure that the savings from the removal of subsidy on petrol are not diverted into private pockets.\u0094 In the suit, SERAP is arguing that: \u0093Nigerians have the right to know how the savings are spent.\nDisclosing the spending details of the savings would reduce the risks of corruption in the spending of the funds.\u0094 SERAP is arguing that, \u0093The Tinubu government has a legal obligation to ensure that the savings from the removal of subsidy on petrol are spent solely for the benefit of the 137 million poor Nigerians who are bearing the brunt of the removal.\u0094 SERAP is also arguing that, \u0093Opacity in the spending of the savings from subsidy removal would have negative impacts on the fundamental interests of the citizens and the public interest.\u0094 According to SERAP, \u0093the savings from subsidy removal may be embezzled, misappropriated or diverted into private pockets.\u0094 The suit filed on behalf of SERAP by its lawyers, Kolawole Oluwadare, Ms Adelanke Aremo, and Ms Valentina Adegoke, read in part: \u0093Transparency would increase public trust and confidence that these savings would be used to benefit Nigerians.\u0094 \u0093The Nigerian Constitution, 1999 [as amended], Freedom of Information Act, and the country\u0092s anti-corruption and human rights obligations rest on the principle that citizens should have access to information regarding their government\u0092s activities.\u0094 \u0093Prevention of corruption in the spending of savings from the removal of subsidy on petrol and preventing and addressing the challenges caused by the removal are serious and legitimate public interests.\u0094 \u0093The Tinubu government has a legal obligation to protect individuals against the threat posed to human rights by the removal of subsidy on petrol, and to effectively address the aftermath of subsidy removal.\u0094 \u0093Unless the government is compelled and directed to publish the spending details of the savings from the removal of subsidy on petrol, the removal will continue to undermine the rights of Nigerians, and increase their vulnerability to poverty.\u0094 \u0093The implementation of the National Social Safety Net Programme (NASSP) and spending on the programme have been mostly shrouded in secrecy.\u0094 \u0093Publishing the details of the spending of the N400bn and other savings from the removal of subsidy would also ensure that persons with public responsibilities are answerable to the people for the performance of their duties.\u0094 \u0093Transparency and accountability in the spending details of the N400bn saved as a result of the removal of subsidy on petrol, and on the spending of subsequent savings from the removal would mean that the savings can help poor Nigerians to overcome the effects of such removal.\u0094 \u0093It would also help to avoid a morally repugnant result of double jeopardy on poor and socially and economically vulnerable Nigerians.\u0094 \u0093The lack of transparency and accountability in the spending of savings from the removal of subsidy on petrol and the resulting human costs would directly threaten fundamental human rights that the government has an obligation to protect.\u0094 \u0093The Tinubu government has the legal obligations to address the effects of subsidy removal on the human rights of 137 million poor Nigerians, and to prevent and address some of the direst consequences that the removal may reap on human rights, especially given the disproportionate impact on these Nigerians.\u0094 \u0093The removal of subsidy on petrol continues to negatively and disproportionately affect poor Nigerians, undermining their right to adequate standard of living.\u0094 \u0093Many years of allegations of corruption and mismanagement in the spending of public funds and entrenched impunity of perpetrators have undermined public trust and confidence in governments at all levels.\u0094 \u0093The Freedom of Information Act, Section 39 of the Nigerian Constitution, article 9 of the African Charter on Human and Peoples\u0092 Rights and a"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/13/301.html",
            "summary": "By Sola Ogundipe As part of the relief measures announced by the Lagos State Government to cushion the effects of fuel subsidy removal on Lagos residents, pregnant women in the state are currently receiving free antenatal care and child delivery services from the Lagos State General Hospitals and Primary Health Centers.\nRecall that as part of the relief measures announced to lessen the burden of the removal of the fuel subsidy on Lagosians, the Governor of Lagos State, Mr. Babajide Sanwo-Olu, directed in July that General Hospitals and PHCs in the state should provide free antenatal care and child delivery services, including normal and Cesarean sections, to expectant mothers.\nThe Permanent Secretary, Lagos State Ministry of Health, Dr. Olusegun Ogboye, said that the implementation of the free health services will help improve maternal and child health indices in Lagos.\n\u0093I am impressed by the level of compliance with Mr. Governor\u0092s free antenatal and child delivery service directive at the health facilities visited.\nOn his part, the Medical Director of Ifako-Ijaiye General Hospital, Dr. Bamidele Mustapha, disclosed that the health institution has implemented free health interventions, providing antenatal and child delivery services to over 30 people at no cost."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/1/1.html",
            "summary": "The Nigeria Labour Congres (NLC) has declared a two-day warning strike which will begin on Tuesday, September 5, 2023.\nNLC and TUC led, during a protest against Subsidy removal and other issues.\nNLC President, Joe Ajaero, made disclosed this on Friday during a press conference at the Labour House in Abuja,According to Ajaero, the two-day warning strike is in protest against the Federal Government for failing to address the challenges caused by the removal of fuel subsidy.\nOn August 2, the NLC held a protest on what it described as the anti-people policies of the current administration.\nThe NLC, Trade Union Congress (TUC) and their affiliate unions demonstrated in Abuja and several states, including Lagos, Abia, Plateau, Kaduna, Kano, Rivers."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/5/43.html",
            "summary": "By Timothy Crown, Friday Okeregbe and Reuben Okwa The two-day warning strike of the Nigeria Labour Congress (NLC) commenced on Tuesday to partial compliance from workers in some parts of the country, including Lagos State, Rivers State, and Abuja.\nSome Lagosians expressed their frustration over the hardship occasioned by the removal of fuel subsidies by President Bola Tinubu.\nBut the industrial action order did not have any effect at the Lagos State Secretariat where workers were seen going about their regular business.\nIn Abuja, the block housing the Federal Ministry of Education at the Federal Secretariat was locked for about five minutes and later opened for civil servants to resume work.\nThe situation was similar at the Rivers State Secretariat as some civil servants were seen at the Secretariat."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/9/33.html",
            "summary": "Eko Bridge By Bola Badmus The long wait for the reopening of Eko Bridge for vehicular traffic in Lagos State ended on Saturday 15 months after it was closed by the Federal Government for a major repair.\nEko Bridge is one of the three bridges linking the mainland to the Island of Lagos.\nWe are reopening the bridge to bring relief to road users, who have endured hardship due to the repair work,\u0094 he said.\n\u0093We have seen the effect which the destruction on Eko Bridge caused the entire city.\nShe said comprehensive maintenance work had already started on Eko Bridge before the fire incident happened, which made the contractor abandon the work to focus on the damaged sections."
        }
    ],
    "FCT": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/18/201.html",
            "summary": "According to him, Tinubu directed \u0093that the N8,000 conditional cash transfer programmed envisaged to bring succour to most vulnerable households be reviewed immediately\u0094.\nThat the N8,000 conditional cash transfer programmed envisaged to bring succour to most vulnerable households be reviewed immediately.\nImmediate release of fertilisers and grains to approximately 50 million farmers and households respectively in all the 36 states and the FCT.\nPresident Bola Tinubu has promised to always prioritize the wellbeing of Nigerians and he is irrevocably committed to the vow.\nI wish to assure Nigerians that President Tinubu will continue to be a listening leader whose ears will not be dull to the views expressed by the citizenry."
        }
    ],
    "Nasarawa": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/22/36.html",
            "summary": "Nasarawa State Governor Abdullahi Sule expressed his disagreement with critics of the proposed N8,000 palliative by the Federal Government, saying, \u0093N8,000 is a lot of money for so many poor families in the country who don\u0092t get to see such an amount in a month.\u0094Governor Sule made these remarks during an appearance on Channels Television\u0092s Politics Today on Friday, where he defended the efficacy of the N8,000 palliative in alleviating the impact of fuel subsidy removal on impoverished Nigerians.\n\u0093We were sharing only N5,000 and believe me there were so many people that were waiting for that N5,000 every month.\nIndeed there were some communities that were able to do some kind of contributions and they were able to do a lot in their various communities,\u0094 the Governor added, referring to the success of the previous N5,000 palliative distribution.\nAccording to Governor Sule, the N8,000 palliative may not appear substantial to certain individuals, but it holds significant value for many less privileged families who struggle to access such financial support regularly."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/21/5.html",
            "summary": "Reacting to the fuel price hike, caused by Tinubu\u0092s announcement of subsidy removal, CNPP described further increment, less than two months after, as a fresh pointer that the All Progressives Congress (APC) government \u0093has never been sincere with Nigerians\u0094 on the subsidy issue.\nPresident of NUJ, Chris Isiguzo, made the call during the Perennial Delegate Congress of NUJ, Nasarawa State Council, in Lafia, yesterday.\nThe leader of journalists in the country congratulated the new officials of Nasarawa NUJ and urged them to live above board in the line of duty.\nThe NUJ president also called on members to support the new officials to succeed.\nIn his acceptance speech, the Chairman of Nasarawa NUJ, Salihu Alkali, commended members of the council for their unwavering support in promoting good journalism practice in the state."
        }
    ],
    "Ogun": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/25/20.html",
            "summary": "Ogun State governor Dapo Abiodun The Ogun government has approved cash palliative of N10,000 for each of its public servants and pensioners, Mr Tokunbo Talabi, the Secretary to the State Government (SSG), has announced.\nTalabi further stated that the state government had approved hazard allowance for all health and medical personnel and peculiar allowance for public servants in the state.\n\u0093Immediate release of letters of promotion in respect of 2021 and 2022, as well as payment of March and April 2023 leave bonuses for public servants in the state, will also begin.\nHe also announced the commencement of conversion to Compressed Natural Gas (CNG) of state-owned mass transit buses, including staff buses and current public transportation buses in circulation.\n\u0093The government will also be acquiring additional new CNG buses to ease transportation in the state, and these buses will be charging fares comparable to what was obtained before the fuel subsidy removal,\u0094 Talabi said."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/8/125.html",
            "summary": "A group of marketers who visited the president on Wednesday, announced their intention to donate between fifty to a hundred 50-seater mass transit buses to help the masses.\nPresident Bola Tinubu has directed the National Economic Council (NEC) led by Vice President Kashim Shettima to device an approach and begin the process of working on interventions to mitigate the impact of subsidy removal on the Nigerians.\nGovernor of Ogun State, Dapo Abiodun, stated this after leading some major oil marketers on a courtesy visit to the president at the State house.\nAddressing correspondents after the meeting, Governor Abiodun who was a former chairman of the Oil marketers association, stated that the marketers expressed solidarity with the President for removing the 4 trillion naira subsidy burden, a move that can enhance the FAAC allocation to states."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/15/2.html",
            "summary": "By Oluyemi ogunseyin President Bola Ahmed Tinubu (BAT) has inaugurated the National Economic Council (NEC) which is headed by the Vice President, H.E Kashim Shettima.\nAccording to a video shared by the Asiwaju Bola Ahmed Media Centre on Twitter on Thursday, Tinubu inaugurated the NEC at the presidential villa in Abuja.\nOgun State governor, Dapo Abiodun said this last Wednesday while briefing State House reporters after leading some major oil marketers on a courtesy call on the president at the Presidential Villa.\nAddressing correspondents after the meeting, Abiodun, who is a former chairman of the oil marketers association, stated that the marketers expressed solidarity with the President for removing the N4trn subsidy burden.\nHe said this is a move that can enhance the Federation Account Allocation Committee (FAAC) allocation to states."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/4/100.html",
            "summary": "To enjoy electricity in their homes, Nigerians resort to alternative power sources, the cheapest of which is the use of power generators of different sizes.\nIn an attempt to beat the amount of money spent on petrol, Nigerians have taken their destiny in their hands by converting their gasoline generators to gas.\nWhile the government recommends CNG for converted vehicles, people use Liquefied Natural Gas (LNG), the same gas they use in cooking, for these power generators.\nAccording to him, he now saves half of what he usually spent on petrol daily for his 6KVa generator.\nExpert speaks A Mechanical Engineer in Ogun, Kolawole Ogunwemimo, said the use of gas for power generators is cheap, but it calls for caution."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/6/39.html",
            "summary": "He noted that the government remained open to parleying with labour to ensure that the rights of the workers of Oyo State are protected.\n\u0093After wide consultations, we have arrived at decisions that we believe will be of the most benefit to the good people of Oyo State.\nSo, we will have buses going from Ibadan to Ibarapa, Ibadan to Ogbomoso, Ibadan to Oke-Ogun and Ibadan to Oyo.\n\u0093Tertiary institution students in Oyo State will board the Omituntun Buses at half price upon showing their school identity card.\nAnd since January 2020, we have paid the minimum wage and consequential adjustments to all cadres of civil servants every month without fail."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/17/21.html",
            "summary": "After years of suffering from lack of portable water, relief finally came the way of the Odo community in Odogbolu Local Council of Ogun State, following the commissioning of a borehole and water reservoir donated to the community.\nSpeaking at the event, the donor, Alhaji Luqmon Idowu, said the gesture was to complement activities of the council administration by empowering members of the community to have access to clean water and prevent waterborne diseases.\nIdowu, a philanthropist and businessman, said he would continue to give to the society, and urged well-meaning Nigerians to do same by contributing to the well-being of the society.\nChairman of Odogbolu Local Council, Ladejobi Shuiab, who was represented by his Special Assistant on Politics and Women Affairs, Taira Adebanjo, commended the gesture, and expressed hope that the borehole and water reservoir would make a positive difference in the lives of the people of Odo community."
        }
    ],
    "Abia": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/9.html",
            "summary": "For instance, the transport fare from Ojota to Alausa Secretariat, which was increased to N300 as a result of fuel subsidy removal, was still N300 two weeks after the governor\u0092s announcement.\nMeanwhile, findings by The Guardian showed that other states, including Delta, Enugu, Abia, Imo and Kaduna are yet to unveil any concrete plan to mitigate the impact of the petrol subsidy removal on vulnerable residents in their domains.\nIn Delta, Governor Sheriff Oborevwori has only promised residents that their sufferings as a result of the removal of petrol subsidy would soon be history.\nAnambra State government is yet to announce to the public its plans and measures to cushion the effect of subsidy removal.\nAlso, residents of Benue State are still waiting for the government to roll out its subsidy palliatives."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/1/1.html",
            "summary": "The Nigeria Labour Congres (NLC) has declared a two-day warning strike which will begin on Tuesday, September 5, 2023.\nNLC and TUC led, during a protest against Subsidy removal and other issues.\nNLC President, Joe Ajaero, made disclosed this on Friday during a press conference at the Labour House in Abuja,According to Ajaero, the two-day warning strike is in protest against the Federal Government for failing to address the challenges caused by the removal of fuel subsidy.\nOn August 2, the NLC held a protest on what it described as the anti-people policies of the current administration.\nThe NLC, Trade Union Congress (TUC) and their affiliate unions demonstrated in Abuja and several states, including Lagos, Abia, Plateau, Kaduna, Kano, Rivers."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/2/35.html",
            "summary": "The governor said the palliatives were only a show of empathy for the people as more sustainable initiatives were being implemented in phases.\nThe Abia State governor, Alex Otti, has commenced the distribution of palliatives to cushion the impact of the fuel subsidy removal in the state.\nAt least 3,000 bags of rice (50 kg) were said to have been shared in the first phase to political wards in the state, while the state has commenced distribution of the 12,600 bags received in the second phase.\nDuring the flag-off event in Micheal Okwara Auditorium in Umuahia, the state capital, Otti said the food relief packages were meant for the poorest of the poor in order to mitigate the effects of the economic hardship on them and no government appointees should receive one grain."
        }
    ],
    "Benue": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/9.html",
            "summary": "For instance, the transport fare from Ojota to Alausa Secretariat, which was increased to N300 as a result of fuel subsidy removal, was still N300 two weeks after the governor\u0092s announcement.\nMeanwhile, findings by The Guardian showed that other states, including Delta, Enugu, Abia, Imo and Kaduna are yet to unveil any concrete plan to mitigate the impact of the petrol subsidy removal on vulnerable residents in their domains.\nIn Delta, Governor Sheriff Oborevwori has only promised residents that their sufferings as a result of the removal of petrol subsidy would soon be history.\nAnambra State government is yet to announce to the public its plans and measures to cushion the effect of subsidy removal.\nAlso, residents of Benue State are still waiting for the government to roll out its subsidy palliatives."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/16/323.html",
            "summary": "The removal of fuel subsidy as announced by President Bola Tinubu on May 29, 2023, has reduced the daily consumption of petrol by Nigerians from 65 million to 40 million, Vanguard reports.\nAccording to him, the committee is composed of Governors of Kebbi state, as Chairman, Anambra representing the South East geopolitical zone.\nBenue North Central, Kaduna Northwest, Bauchi, representing the northeast, Cross River, South-South and Oyo state Southwest.\nSpeaking after the meeting, Otti said, \u0093As part of the inaugural national economic council meeting today, the major focus was on the removal of petroleum subsidy and implied the removal of subsidy on foreign exchange, which has led to some convergence of some sort.\nInitially, it had reduced the consumption from about 66, 67 million litres a day to just about 40 million."
        }
    ],
    "Delta": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/9.html",
            "summary": "For instance, the transport fare from Ojota to Alausa Secretariat, which was increased to N300 as a result of fuel subsidy removal, was still N300 two weeks after the governor\u0092s announcement.\nMeanwhile, findings by The Guardian showed that other states, including Delta, Enugu, Abia, Imo and Kaduna are yet to unveil any concrete plan to mitigate the impact of the petrol subsidy removal on vulnerable residents in their domains.\nIn Delta, Governor Sheriff Oborevwori has only promised residents that their sufferings as a result of the removal of petrol subsidy would soon be history.\nAnambra State government is yet to announce to the public its plans and measures to cushion the effect of subsidy removal.\nAlso, residents of Benue State are still waiting for the government to roll out its subsidy palliatives."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/2/305.html",
            "summary": "Ann-Kio Briggs is a well-known voice on issues of the Niger Delta region.\nSecondly, there is oil theft going on at the highest scale that it cannot be done in any part of the world.\nWhat is your expectation of President Tinubu in the ongoing war against oil theft in the Niger Delta?\nWhich other country in the world that is lifting oil is complaining about oil theft!\nOil theft is so embedded in Nigeria so much that if you remove oil theft, you remove corruption."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/may/23/11.html",
            "summary": "Second Niger Bridge By Godwin Ijediogor, Asaba Travellers to Enugu, Owerri, Aba and other parts of the South East from Asaba, Delta State, will experience some traffic relief from today as President Muhammadu Buhari commissions the Second Niger Bridge and its access roads.\nAfter almost five decades of failed promises by successive administrations, Buhari has completed the 11.5-kilometre bridge in Onitsha, across the River Niger, connecting Asaba with Ogbaru, in Anambra State, and beyond.\nThe First Niger Bridge was constructed over 60 years ago, and has become too narrow for the volume of traffic from Asaba to Onitsha and vice versa.\nBuilt-in 1965, it had remained the major link between the South West, South East and South South over the years.\nBut excessive axle load and traffic congestion, due to growing economic/commercial activities on that transport corridor, has made construction of the Second Niger Bridge imperative."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/20/3.html",
            "summary": "Athletics Federation of Nigeria (AFN) President, Tonobok Okowa, has described as a \u0091big relief\u0092 the clearance of World Record holder in 100m hurdles, Tobi Amusan, to compete in the ongoing Budapest 2023 World Championships.\nA panel of Disciplinary Tribunal cleared Amusan of three whereabouts failures charge on Thursday evening, and the Nigerian is already in Budapest preparing for her event on Tuesday.\nSpeaking with The Guardian, yesterday, Okowa, who is also the president of African Region 2 Athletics body, as well as chairman of Delta Sports Commission, said Amusan\u0092s clearance has lifted the spirit within Team Nigeria\u0092s camp in Budapest.\n\u0093You need to see the excitement in the camp when Tobi Amusan arrived here on Friday,\u0094 Okowa stated.\nHe revealed that Amusan\u0092s presence would ginger other Nigerian athletes to do their best in Budapest."
        }
    ],
    "Bayelsa": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/21.html",
            "summary": "By Olugbenga Ige The Arewa Consultative Forum (ACF) has slammed the Bola Tinubu-led federal government for giving N5 billion as a palliative fund for states to cushion the impact of the petrol subsidy removal.\nReacting in an interview with Daily Trust, ACF Spokesman, Professor Tukur Muhammad-Baba, described the palliatives fund to the state government as shambolic and unscientific.\nMuhammad-Baba said the government was wrong for giving the same amount to Lagos, Oyo, Kano and Bayelsa states, as their populations and statistics of eligible people differ.\nI mean, if you are looking for poor people, are you allocating the same amount to Bayelsa, Lagos, Oyo, and Kano states, and you expect it to make an impact?\nThe number of people suffering from poverty in Lagos, Oyo, and Kano will not be the same as those living in poverty in Bayelsa, Taraba, or Jigawa."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/28/30.html",
            "summary": "Some Bayelsa State citizens have reportedly forced their way into a warehouse where palliatives were kept to be distributed to some group of persons.\nNaija News learnt that the warehouse located along Isaac Boro Expressway in Yenagoa, the state capital, was raided on Sunday.\nAccording to SaharaReporters, the people were angered due to the hardship in the country occasioned by the removal of subsidy on Premium Motor Spirit, otherwise known as petrol.\nIt is, however, unclear if the warehouse looted housed food items distributed to states as promised by President Bola Tinubu\u0091s administration to cushion the effect of fuel subsidy removal."
        }
    ],
    "Jigawa": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/21.html",
            "summary": "By Olugbenga Ige The Arewa Consultative Forum (ACF) has slammed the Bola Tinubu-led federal government for giving N5 billion as a palliative fund for states to cushion the impact of the petrol subsidy removal.\nReacting in an interview with Daily Trust, ACF Spokesman, Professor Tukur Muhammad-Baba, described the palliatives fund to the state government as shambolic and unscientific.\nMuhammad-Baba said the government was wrong for giving the same amount to Lagos, Oyo, Kano and Bayelsa states, as their populations and statistics of eligible people differ.\nI mean, if you are looking for poor people, are you allocating the same amount to Bayelsa, Lagos, Oyo, and Kano states, and you expect it to make an impact?\nThe number of people suffering from poverty in Lagos, Oyo, and Kano will not be the same as those living in poverty in Bayelsa, Taraba, or Jigawa."
        }
    ],
    "Oyo": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/21.html",
            "summary": "By Olugbenga Ige The Arewa Consultative Forum (ACF) has slammed the Bola Tinubu-led federal government for giving N5 billion as a palliative fund for states to cushion the impact of the petrol subsidy removal.\nReacting in an interview with Daily Trust, ACF Spokesman, Professor Tukur Muhammad-Baba, described the palliatives fund to the state government as shambolic and unscientific.\nMuhammad-Baba said the government was wrong for giving the same amount to Lagos, Oyo, Kano and Bayelsa states, as their populations and statistics of eligible people differ.\nI mean, if you are looking for poor people, are you allocating the same amount to Bayelsa, Lagos, Oyo, and Kano states, and you expect it to make an impact?\nThe number of people suffering from poverty in Lagos, Oyo, and Kano will not be the same as those living in poverty in Bayelsa, Taraba, or Jigawa."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/3/814.html",
            "summary": "By George Oshogwe Ogbolu Governor Bala Mohammed of Bauchi State has emerged Chairman of the Peoples Democratic Party (PDP) Governors\u0092 Forum.\nNaija News reports that Adamawa State Governor, Ahmadu Umaru Fintiri, disclosed this shortly after a retreat for elected PDP Governors and Members of National Assembly elect.\nGovernor Siminalayi Fubara of Rivers state emerged the Vice Chairman of the PDP Governors\u0092 Forum.\nMohammed replaced his counterpart, Governor Seyi Makinde of Oyo state, who also attended the PDP retreat.\n\u0093Between 1999 and 2007, the PDP government initiated the petroleum subsidy removal and I chaired the committee,\u0094 Atiku said."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/14/12.html",
            "summary": "By Collins Olayinka (Geneva, Switzerland) and Seye Olumide (Ibadan) • Expresses doubt over govt\u0092s resolve on fuel subsidy Minimum wage negotiations between organised labour, Nigerian Employers\u0092 Consultative Association (NECA), and the Federal Government will resume in the last quarter of this year.\nHe said: \u0093When labour meets the Federal Government\u0092s negotiation team on Monday, June 19, 2023, the minimum wage will not be on the table.\nThe current minimum wage will expire in February, next year.\nHe said: \u0093Our governors have made a mockery of what a national minimum wage ought to be, by reducing it to their own definition of what they are willing to pay workers.\nTherefore, ignorance is the bane of the Nigerian minimum wage implementation.\u0094 Meanwhile, Oyo State NLC chapter, yesterday, said it was sceptical of Federal Government\u0092s determination to remove fuel subsidy."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/16/323.html",
            "summary": "The removal of fuel subsidy as announced by President Bola Tinubu on May 29, 2023, has reduced the daily consumption of petrol by Nigerians from 65 million to 40 million, Vanguard reports.\nAccording to him, the committee is composed of Governors of Kebbi state, as Chairman, Anambra representing the South East geopolitical zone.\nBenue North Central, Kaduna Northwest, Bauchi, representing the northeast, Cross River, South-South and Oyo state Southwest.\nSpeaking after the meeting, Otti said, \u0093As part of the inaugural national economic council meeting today, the major focus was on the removal of petroleum subsidy and implied the removal of subsidy on foreign exchange, which has led to some convergence of some sort.\nInitially, it had reduced the consumption from about 66, 67 million litres a day to just about 40 million."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/6/39.html",
            "summary": "He noted that the government remained open to parleying with labour to ensure that the rights of the workers of Oyo State are protected.\n\u0093After wide consultations, we have arrived at decisions that we believe will be of the most benefit to the good people of Oyo State.\nSo, we will have buses going from Ibadan to Ibarapa, Ibadan to Ogbomoso, Ibadan to Oke-Ogun and Ibadan to Oyo.\n\u0093Tertiary institution students in Oyo State will board the Omituntun Buses at half price upon showing their school identity card.\nAnd since January 2020, we have paid the minimum wage and consequential adjustments to all cadres of civil servants every month without fail."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/15/109.html",
            "summary": "By Musliudeen Adebayo The University of Ibadan, Oyo State, has directed its staff to work for three days a week.\nThe institution made this disclosure through a special release number, 4642, dated 14 August 2023 and signed by G.O.\nIt explained that the decision was taken in view of the recent removal of subsidy on Premium Motor Spirit (PMS), also known as petrol.\nHe added that after a careful consideration of the situation, management of the institution has recommended a temporary work schedule adjustment for members of staff.\nAccordingly, members of staff are now expected to work on site for three (3) days in rotation per week, with effect from Monday, 14 August, 2073."
        }
    ],
    "Taraba": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/19/21.html",
            "summary": "By Olugbenga Ige The Arewa Consultative Forum (ACF) has slammed the Bola Tinubu-led federal government for giving N5 billion as a palliative fund for states to cushion the impact of the petrol subsidy removal.\nReacting in an interview with Daily Trust, ACF Spokesman, Professor Tukur Muhammad-Baba, described the palliatives fund to the state government as shambolic and unscientific.\nMuhammad-Baba said the government was wrong for giving the same amount to Lagos, Oyo, Kano and Bayelsa states, as their populations and statistics of eligible people differ.\nI mean, if you are looking for poor people, are you allocating the same amount to Bayelsa, Lagos, Oyo, and Kano states, and you expect it to make an impact?\nThe number of people suffering from poverty in Lagos, Oyo, and Kano will not be the same as those living in poverty in Bayelsa, Taraba, or Jigawa."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/7/40.html",
            "summary": "The Taraba State Governor, Agbu Kefas, has declared free education in all primary and secondary schools with effect from the next academic session.\nNaija News reports that the governor stated that this is to cushion the effects of the removal of subsidy on Premium Motor Spirit known as petrol.\nKefas\u0092s decision is coming barely 48 hours after announcing the reduction of university school fees by 50 per cent to cushion the current hardship in the country.\nSpeaking at the Ebenezer Primary School in Wukari as part of his assessment tour, he said primary and secondary education in Taraba State would be free starting from the next academic session.\nAccording to him, it was the responsibility of the government to bear the expenses and students should not be subjected to any fees."
        }
    ],
    "Sokoto": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/20/1.html",
            "summary": "The committees were given eight weeks to conclude their assignment to hasten the implementation of the framework in cushioning the effect of petrol subsidy removal on Nigerians.\nThis was a fall-out of President Tinubu\u0092s closed-door session with the leadership of the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC) during a nationwide protest by the organised labour.\nThe grant is to, among other things, be used in procurement of grains as well as five trucks of rice to each state as palliatives.\nIn a swift reaction, organised labour kicked against the Federal Government doling of N5 billion palliative grant to states to cushion the impact of the subsidy removal.\nTake a state like Sokoto, for example, they have over seven million people by the latest National Population Commission estimate."
        }
    ],
    "Edo": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/24/50.html",
            "summary": "Governor Charles Soludo of Anambra State has disagreed with his Edo State counterpart, Godwin Obaseki, on the federal government\u0092s palliative measures for cushioning the effects of fuel subsidy removal.\nNaija News earlier reported that Obaseki, while speaking with journalists in Benin City on Wednesday, described the federal government\u0092s palliative concept as deceptive and fraudulent.\nHe also expressed shock and fear about the federal government\u0092s inability to plan and effectively respond to the effects of the fuel subsidy removal policy that has further improvised Nigerians.\nBut in a chat with Leadership on Wednesday, Soludo, through his media aide, Christian Aburime, said the federal government\u0092s palliative measures were not fraudulent, and they are capable of cushioning the effect of the fuel subsidy removal.\nSoludo asserted that the recent palliative measures will at least begin to ameliorate the suffering of the masses until a long-term solution is provided."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/24/20.html",
            "summary": "Edo State Governor, Obaseki.\n\u0093I am shocked that people who campaigned around the country, saying that they will remove subsidies, had no clear plans on what to do after subsidy removal.\nThey don\u0092t know what to do and how to support those who will be victims of the removal.\nReaffirming his government\u0092s commitment to the welfare and well-being of Edo people, the governor said: \u0093For us in Edo, we would not abandon you.\nWe don\u0092t like the word palliative, because it is deceitful, as we would rather use the word \u0091support.\u0092 We would support those who are already victims of this policy measure.\u0094 GUARDIANNEWS SECTIONS"
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/27/10.html",
            "summary": "Naija News recalls that Obaseki, while speaking with journalists in Benin City on Wednesday, described the federal government\u0092s palliative concept as deceptive and fraudulent.\nHe also expressed shock and fear about the federal government\u0092s inability to plan and effectively respond to the effects of the fuel subsidy removal policy that has further improvised Nigerians.\nIdris stated that he was not surprised by the statement credited to the Edo State Governor.\nBut in a statement to Naija News on Sunday, Edo State Commissioner for Communication and Orientation, Chris Osa Nehikhare, expressed displeasure with the Minister\u0092s statement.\n\u0093Records of Edo State Government\u0092s performance are also available for Nigerias to verify."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/2/807.html",
            "summary": "By afolabi The Edo Civil Society Organisations on Thursday trooped to the street to protest the removal of fuel subsidy which has led to a hike in the pump price of fuel.\nThe protest, which was at different locations in the state, hindered commercial activities and vehicular movements with commuters trekking long distances to their destinations.\nHe said, \u0093We are protesting because of the increase in petrol pump price which started on Wednesday.\nIt is sad that the president will make a pronouncement on subsidy and the marketers will move the price from N210 to over N500.\nWe were shocked to see that even NNPC Limited fixed the price for or over N500 as the pump price."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/7/132.html",
            "summary": "Hence, Governor Godwin Obaseki of Edo State announced on Tuesday that civil and public servants would have to commute to their workplaces from five days to three days a week in order to reduce expenses and hardship.\nGovernor Obaseki in a statement made available to newsmen in Benin, said the measure was part of efforts to ease the sufferings currently faced by the people occasioned by the fuel subsidy removal.\nHe said \u0093The Edo State Government shares the pains of our people and wants to assure everyone that we are standing with them in these very challenging times.\n\u0093As a proactive government, we have since taken the step to increase the minimum wage paid to workers in Edo State from the approved N30,000 to N40,000.\n\u0093Therefore, the Edo State Government is hereby reducing the number of work days that civil and public servants will have to commute to their workplaces from five days to three days a week till further notice."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/7/114.html",
            "summary": "The Edo State Government has increased the minimum wage for workers in the state from N30,000 to N40,000.\nThis was confirmed in a statement released on Tuesday by Governor Godwin Obaseki.\nObaseki also announced the reduction of working days from five to three, as residents continue to battle with the effect of the petrol subsidy removal.\nHe assured that his administration would stand with workers \u0093in these very challenging times\u0094.\nObaseki also said his administration would do all within its power to ameliorate the sufferings of residents."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/4/310.html",
            "summary": "Edo has resumed the payment of outstanding gratuities to its pensioners 17 years after it stopped the exercise.\nMr Crusoe Osagie, Special Adviser on Media projects to Edo government made this known in Benin on Thursday.\nHe told newsmen that one of the reasons for the resumption of payment was to cushion the effect of fuel subsidy removal on pensioners.\nHe said government was working out modalities to ensure that all outstanding gratuities were paid.\nThe News Agency of Nigeria (NAN) reports that the last time Edo paid gratuities was in 2006 during Chief Lucky Igbenedion\u0092s administration."
        }
    ],
    "Gombe": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/24/44.html",
            "summary": "By Tayo Elegbede Gombe State Governor, Muhammadu Yahaya, had admonished the state\u0092s residents to embrace agriculture instead of the expectations placed on the federal government\u0092s N5 billion palliative to the state.\nThe governor had inaugurated a distribution committee headed by the chairman of Gombe State Emergency Management Agency last week to handle the distribution of the palliative grains.\nHe has toured around the nine LGAs sharing palliatives across households and polling units.\nThe deputy governor will take charge of ensuring we implement the Federal Government palliatives so that it gets to the right persons.\nI\u0092m not happy that we are sharing palliatives."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/1/104.html",
            "summary": "By Nsikak Nseyen The Gombe State Government, on Friday, announced an increment in workers\u0092 salary by N10,000 across board to cushion the effect of fuel subsidy removal.\nBriefing newsmen in Gombe, the Deputy Governor of Gombe, Malam Manassah Jatau said it was part of the measures taken to reduce the economic impact of the subsidy removal on workers.\nInuwa Yahaya is concerned about the welfare of civil servants and residents of the state through various interventions since the COVID-19 pandemic.\nHe said since the fuel subsidy removal, the state government had taken measures towards cushioning its effects on citizens of the state by distributing palliatives to 30,000 beneficiaries across the state.\nAccording to him, the N10,000 is for both the state and the local government workers in the state, and it will take effect in August."
        }
    ],
    "Ondo": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/27/32.html",
            "summary": "Prince Leke Adegbite, Chairman, Nigeria Union of Journalists, Ondo State Chapter, said the palliatives could not go far in addressing the hard times occasioned by the fuel subsidy removal.\n\u0093And it is even obvious that nothing has been dedicated for federal workers from all these palliatives,\u0094 he said.\n\u0093Our refineries should be revamped so that Nigerians, especially federal workers, can heave a sigh of relief.\n\u0093It is not easy at all; cost of transportation, cost of living and other services have gone beyond our reach, and nothing was added to our salary to cushion the effect.\n\u0093There is urgent need for government to increase workers salaries in the face of the present economic realities for them to live a decent life,\u0094 he said."
        }
    ],
    "Osun": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/29/34.html",
            "summary": "The Osun State government has begun the distribution of the subsidized rice palliative received from the Federal government to cushion the effect of fuel subsidy removal.\nThe Commissioner for Information and Public Enlightenment, Kolapo Alimi, made this known in a statement on Tuesday in Osogbo, the state capital.\nAlimi stated that the Palliative Committee set up by Governor Ademola Adeleke has finalized the mode of sharing, adding that the distribution starts today, Tuesday, August 29, 2023.\nAccording to the commissioner, beneficiaries will begin to receive the rice palliatives according to the timetable prepared to capture everyone."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/30/305.html",
            "summary": "Gov Adeleke By Shina Abubakar, Osogbo Osun State Governor, Ademola Adeleke has disclosed that his administration will soon introduce free bus rides and adjust working days for public servants to cushion the effect of fuel subsidy removal.\n\u0093We (Osun Government) will soon introduce public transport buses.\nAddressing party stakeholders, the governor said he will run an inclusive government that leaves no one behind, saying \u0093We will all be accommodated.\nThey all stressed the need for love, unity and focus among party stakeholders to sustain the current quality leadership stride in the state.\nThe meeting was attended by party stakeholders across the state, including elected lawmakers at the state and National Assembly, and party stalwarts across local and state."
        }
    ],
    "Bauchi": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/3/814.html",
            "summary": "By George Oshogwe Ogbolu Governor Bala Mohammed of Bauchi State has emerged Chairman of the Peoples Democratic Party (PDP) Governors\u0092 Forum.\nNaija News reports that Adamawa State Governor, Ahmadu Umaru Fintiri, disclosed this shortly after a retreat for elected PDP Governors and Members of National Assembly elect.\nGovernor Siminalayi Fubara of Rivers state emerged the Vice Chairman of the PDP Governors\u0092 Forum.\nMohammed replaced his counterpart, Governor Seyi Makinde of Oyo state, who also attended the PDP retreat.\n\u0093Between 1999 and 2007, the PDP government initiated the petroleum subsidy removal and I chaired the committee,\u0094 Atiku said."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/3/310.html",
            "summary": "Presidential candidate of the Peoples Democratic Party, PDP, Atiku Abubakar, said the PDP government while he was the Vice President initiated subsidy removal in two phases after providing palliatives for the affected sector of the economy.\nAtiku stated this while speaking at the PDP Retreat for elected officials held in Bauchi state on Saturday.\nRecall that President Bola Tinubu declared in his inauguration speech that \u0093petrol subsidy is gone.\u0094Following the President\u0092s announcement, however, filling stations across the country increased pump prices from N185 to over N500.\nThe decision was first taken by former President Muhammadu Buhari in 2022.\nThe policy received the backing of Tinubu, Atiku, and several other 2023 presidential candidates, who sought to end the subsidy regime if elected."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/16/323.html",
            "summary": "The removal of fuel subsidy as announced by President Bola Tinubu on May 29, 2023, has reduced the daily consumption of petrol by Nigerians from 65 million to 40 million, Vanguard reports.\nAccording to him, the committee is composed of Governors of Kebbi state, as Chairman, Anambra representing the South East geopolitical zone.\nBenue North Central, Kaduna Northwest, Bauchi, representing the northeast, Cross River, South-South and Oyo state Southwest.\nSpeaking after the meeting, Otti said, \u0093As part of the inaugural national economic council meeting today, the major focus was on the removal of petroleum subsidy and implied the removal of subsidy on foreign exchange, which has led to some convergence of some sort.\nInitially, it had reduced the consumption from about 66, 67 million litres a day to just about 40 million."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/26/31.html",
            "summary": "Former Governor of Bauchi State, Isa Yuguda, on Monday said that up until the time of its removal, the fuel subsidy has mostly been a scam run by the Nigerian National Petroleum Company (NNPC) in conjunction with marketers and other stakeholders in the oil sector.\nYuguda who also was former minister of state for transport, disclosed this when he appeared as a guest on Channels Television\u0092s Sunrise Daily.\nAccording to him, he was privileged to serve as the chairman of a subcommittee between 2008 and 2009 under the economic meltdown period and he chaired the committee on subsidy where everything about the scam from the initiative was discovered.\n\u0093I am sad to let Nigerians know what I saw; we came across situations where subsidy was claimed on pipelines that never existed,\u0094 Yuguda maintained.\nThe former minister further explained that \u0093They (NNPC and Marketers) just claim that they have pumped X amount of either finished products or crude."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/7/307.html",
            "summary": "Alhaji Sadiq Ibrahim, Chairman, Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN) Bauchi State, has lamented the drop in cattle business, following the removal of fuel subsidies and increase in the price of petroleum products across the state.\nIbrahim disclosed this to the News Agency of Nigeria (NAN) on Thursday in Bauchi, saying cattle supply has suffered in both daily and weekly livestock markets across the state.\nHe said pastoralists always moved from one place to another to buy and sell cattle as a means of their livelihood.\n\u0093Buying and selling in cattle markets has dropped drastically with about 70 per cent, business activities are not like before.\n\u0093Therefore, the business is suffering in the markets; dealers and rearers complain of hike in transportation fare and operating on a loss,\u0094 he said."
        }
    ],
    "Cross River": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/7/301.html",
            "summary": "By Ike Uchechukwu, CALABAR Bolt Drivers in Calabar, the Cross River state capital on Wednesday embarked on a 72-hour strike to demand an increment in their commission as well as an increased rate for their fares amongst other things in a bid to meet up with unfolding realities.\nMike Neji described what the mobility app company is doing to drivers as unfair.\n\u0093We are being charged for a lot of things, fuel has increased, engine oil has increased, car maintenance generally has increased, yet they are adding only 100 or thereabout to the fare which is not in any way commensurate.\n\u0093They are robbing us mercilessly, because at the end of the day is like we are working for them, in fact it\u0092s modern slavery.\n\u0093It is high time other stakeholders in the mobility app market come into Calabar, we need alternatives because we are supposed to be partners but the relationship we have with the company is like Masters\u0092s servant relationship."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/16/323.html",
            "summary": "The removal of fuel subsidy as announced by President Bola Tinubu on May 29, 2023, has reduced the daily consumption of petrol by Nigerians from 65 million to 40 million, Vanguard reports.\nAccording to him, the committee is composed of Governors of Kebbi state, as Chairman, Anambra representing the South East geopolitical zone.\nBenue North Central, Kaduna Northwest, Bauchi, representing the northeast, Cross River, South-South and Oyo state Southwest.\nSpeaking after the meeting, Otti said, \u0093As part of the inaugural national economic council meeting today, the major focus was on the removal of petroleum subsidy and implied the removal of subsidy on foreign exchange, which has led to some convergence of some sort.\nInitially, it had reduced the consumption from about 66, 67 million litres a day to just about 40 million."
        }
    ],
    "Kebbi": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/16/323.html",
            "summary": "The removal of fuel subsidy as announced by President Bola Tinubu on May 29, 2023, has reduced the daily consumption of petrol by Nigerians from 65 million to 40 million, Vanguard reports.\nAccording to him, the committee is composed of Governors of Kebbi state, as Chairman, Anambra representing the South East geopolitical zone.\nBenue North Central, Kaduna Northwest, Bauchi, representing the northeast, Cross River, South-South and Oyo state Southwest.\nSpeaking after the meeting, Otti said, \u0093As part of the inaugural national economic council meeting today, the major focus was on the removal of petroleum subsidy and implied the removal of subsidy on foreign exchange, which has led to some convergence of some sort.\nInitially, it had reduced the consumption from about 66, 67 million litres a day to just about 40 million."
        }
    ],
    "Borno": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/5/13.html",
            "summary": "Governor Babagana Zulum of Borno State has launched 80 buses, tricycles and pick-up vans for free transportation of residents in Maiduguri Metropolis and Jere Local Council.\nAccording to him, the state government hired 30 pick-up vans for the \u0091free and safe\u0092 commuting of farmers to their farmlands.\nAt the flag-off, yesterday, in Molai Community, the governor said: \u0093The release of the 80 buses, pick-up vans and tricycles, was to reduce the high cost of living caused by the recent withdrawal of petrol subsidy by President Bola Tinubu.\u0094He disclosed that 50 luxurious buses were released from the fleet of Borno Express Corporation, the state\u0092s transport company.\n\u0093The 30 pick-up vans will be hired in launching today\u0092s free transportation of our farmers to their farmlands within a radius of 10 kilometres from Maiduguri,\u0094 he noted.\nZulum, therefore, urged the farmers to cooperate with troops of Operation Hadin Kai (OPHK)."
        }
    ],
    "Akwa Ibom": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/21/29.html",
            "summary": "By Rachel Okporu Fadoju The Akwa Ibom State Governor, Umo Eno, has earned public accolades over the measure taken to cushion the effect of fuel subsidy removal.\nNaija News reports that Umo, in a post via Twitter page, announced that his administration is partnering with Innoson Motors to provide palliatives, especially on transportation, due to the economic hardship caused by the removal of fuel subsidy.\nHe wrote: \u0093I\u0092m excited to partner with @innosonvehicles, Nigeria\u0092s first indigenous auto manufacturing company led by Chairman, Chief Innocent Chukwuma, CON.\nOur collaboration aims to provide palliatives, especially in transportation, for our citizens affected by the removal of fuel subsidy.\nThat is exactly what I suggested here\u0094 @jude_ukaigwe wrote: \u0093Good partnership sir."
        }
    ],
    "Ekiti": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/27/23.html",
            "summary": "By 'Yomi Ayeleso The Nigeria Baptist Convention has called on President Bola Tinubu to be decisive and proactive in ameliorating the sufferings of the citizens occasioned by the removal of subsidy on petrol.\nThe church knows that the common language is that subsidy is a fraud and thanking God for the courage of the new government to remove the fuel subsidy.\nWe know that if this country must move forward, that subsidy must go.\nThey are earning more revenue through this fuel subsidy removal.\n\u0093This is the 25th annual session of Ekiti Baptist."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/5/311.html",
            "summary": "Former Governor of Ekiti State, Kayode Fayemi The immediate past governor of Ekiti State, Dr Kayode Fayemi has revealed that the protest launched against the fuel subsidy removal during the administration of former President Goodluck Jonathan in 2012 was mere politics.\nFayemi stated this while delivering his keynote address at a national dialogue organised to celebrate the 60th birthday of the founding National Secretary of Alliance for Democracy (AD), Professor Udenta Udenta, in Abuja, on Tuesday.\nOther parties that antagonised Jonathan\u0092s administration included the All Nigeria Peoples Party (ANPP) and the All Progressive Grand Alliance (APGA).\n\u0093All political parties in the country agreed and they even put in their manifesto that subsidy must be removed.\nBut we in ACN at the time in 2012, we know the truth sir but it is all politics."
        }
    ],
    "Plateau": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/1/1.html",
            "summary": "The Nigeria Labour Congres (NLC) has declared a two-day warning strike which will begin on Tuesday, September 5, 2023.\nNLC and TUC led, during a protest against Subsidy removal and other issues.\nNLC President, Joe Ajaero, made disclosed this on Friday during a press conference at the Labour House in Abuja,According to Ajaero, the two-day warning strike is in protest against the Federal Government for failing to address the challenges caused by the removal of fuel subsidy.\nOn August 2, the NLC held a protest on what it described as the anti-people policies of the current administration.\nThe NLC, Trade Union Congress (TUC) and their affiliate unions demonstrated in Abuja and several states, including Lagos, Abia, Plateau, Kaduna, Kano, Rivers."
        }
    ],
    "Niger": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/2/305.html",
            "summary": "Ann-Kio Briggs is a well-known voice on issues of the Niger Delta region.\nSecondly, there is oil theft going on at the highest scale that it cannot be done in any part of the world.\nWhat is your expectation of President Tinubu in the ongoing war against oil theft in the Niger Delta?\nWhich other country in the world that is lifting oil is complaining about oil theft!\nOil theft is so embedded in Nigeria so much that if you remove oil theft, you remove corruption."
        },
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/may/23/11.html",
            "summary": "Second Niger Bridge By Godwin Ijediogor, Asaba Travellers to Enugu, Owerri, Aba and other parts of the South East from Asaba, Delta State, will experience some traffic relief from today as President Muhammadu Buhari commissions the Second Niger Bridge and its access roads.\nAfter almost five decades of failed promises by successive administrations, Buhari has completed the 11.5-kilometre bridge in Onitsha, across the River Niger, connecting Asaba with Ogbaru, in Anambra State, and beyond.\nThe First Niger Bridge was constructed over 60 years ago, and has become too narrow for the volume of traffic from Asaba to Onitsha and vice versa.\nBuilt-in 1965, it had remained the major link between the South West, South East and South South over the years.\nBut excessive axle load and traffic congestion, due to growing economic/commercial activities on that transport corridor, has made construction of the Second Niger Bridge imperative."
        }
    ],
    "Zamfara": [
        {
            "url": "https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/4/8.html",
            "summary": "Sen. Sahabi Ya\u0092u (APC-Zamfara) has sponsored free surgeries and treatment for 3,000 eye patients.\nThe News Agency of Nigeria (NAN) reports that the lawmaker had recently flagged off the free medical outreach targeting over 5,000 vulnerable persons.\nThe head of medical team to the outreach, Dr Kamal Umar, disclosed this while addressing newsmen on Monday at General Hospital Kaura-Namoda, in Kaura-Namoda Local Government Area, venue of the outreach.\nUmar said 3,000 eye patients, mainly aged vulnerable persons, women and children, benefitted from the medical treatment, surgeries and drugs.\n\u0093The beneficiaries were drawn from Kaura-Namoda, Birnin-Magaji, Shinkafi and Zurmi LGAs"
        }
    ]
}