{
    "NO LOCATION": [
        {
            "url": "https://nigerianobservernews.com/2023/06/fuel-subsidy-removal-fg-looks-to-world-bank-aid-for-cheaper-transportation/",
            "summary": "It is the concensus of experts, however, that both the removal of the fuel subsidy and the exchange rate unification, are vital to restoring the health of the Nigerian economy in the long run and will yield good fruit if properly managed.\nKyari added that the structural plan, which he described as a work in progress, was part of the President’s petroleum products subsidy removal palliative measures for citizens.\nOn average, fuel costs for LNG trucks are about 48 percent lower than for diesel trucks.\nThere is a budding use of CNG and LNG in Nigeria, especially for heavy duty/mass transit vehicles and industries.\nSince transit buses can carry more passengers, they have the potential to achieve a higher passenger-mile per gallon."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/subsidy-removal-government-looks-to-cheaper-fuels-for-transportation/",
            "summary": "…CNG, LNG in focus…fuel costs for LNG trucks 48% lower than for diesel trucks…Vehicle conversion a snagPresident Bola Tinubu is working on plans to make available cheaper fuels, through Compressed Natural Gas (CNG) and Liquefied Natural Gas (LNG), Mele Kyari, Group CEO of the Nigerian National Petroleum Company Limited (NNPC) has said.\nKyari, spoke of the quest for cheaper fuels on Wednesday, after a meeting with President Tinubu at State House, Abuja.\nSpeaking with State House correspondents after the meeting, Kyari said the Compressed Natural Gas (CNG) and Liquefied Natural Gas (LNG) fuels transportation intervention project plans would be rolled out soon.\nCNG and LNG are significantly cheaper than petrol and are being increasingly used across the world, to power mass transit buses, trucks and trains, as cost effective and more environment friendly fuels.\nThere is a budding use of CNG and LNG in Nigeria, especially for heavy duty/mass transit vehicles and industries."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/oil-marketers-to-donate-n10bn-cng-run-mass-transit-buses-to-fg/",
            "summary": "The President’s parley with the oil marketers comes amid the controversy and protests trailing the removal of subsidy on Premium Motor Spirit known as petrol.\nFIPL optimizes local capacity for enhanced power generationFirst Independent Power Limited (FIPL), a Sahara Group Company has restated its commitment to increasing power generation and sustainability impact in the sector through robust local capacity optimization.\nAccording to him, the Act symbolizes the intention of the nation towards growing local capacity.\nThe Nigerian National Petroleum Company Limited met with oil marketers to agree on indicative pricing.\nOil refining capacity in India, the world’s third biggest oil importer and consumer, is at about 5.2 million bpd."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/nlc-to-begin-nationwide-protest-against-subsidy-removal-june-7/",
            "summary": "The Nigeria Labour Congess (NLC) has declared a nationwide protest from Wednesday, June 7.\nThis comes amid fuel shortages across the country occasioned by President Bola Tinubu’s inaugural speech in which he declared that “fuel subsidy is gone”.\nNLC President Joe Ajaero made the announcement after an emergency meeting of the union’s National Executive Council (NEC) in Abuja.\n“The fuel subsidy is gone,” Tinubu said.\nOn the organised labour’s side, the NLC National President, Joe Ajaero; and the President of the Trade Union Congress of Nigeria (TUC), Festus Osifo, were present."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/fg-nlc-fuel-subsidy-meeting-ends-in-deadlock/",
            "summary": "The meeting between the Federal Government and the Nigerian Labour Congress (NLC) over fuel subsidy removal has ended without a consensus.\n“The fuel subsidy is gone,” Tinubu said.\nAjaero, on Tuesday, kicked against Tinubu’s announcement confirming the removal of fuel subsidy.\nThe NLC president described the development as not well planned, saying Nigerians feel betrayed by the move.\n“By his insensitive decision, President Tinubu on his inauguration day brought tears and sorrow to millions of Nigerians instead of hope."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/shettima-36-govs-meet-over-subsidy-removal/",
            "summary": "The National Economic Council (NEC) meeting is in session at the Council Chambers of the State House in Abuja on Thursday.\nChairing the meeting is Vice President Kashim Shettima.\nHowever, following a series of criticisms from the Organised Labour, Tinubu ordered a review of the proposed palliative.\nAmong other issues, the review by the President should be top on the NEC meeting agenda on Thursday.\nIt is expected that resolutions from the meeting will be communicated to the press forthwith."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/fuel-subsidy-removal-mr-president-rev-the-railways/",
            "summary": "There are already some ironies arising from the removal of the ‘subsidy on fuel importation’.\nBut perhaps what demonstrates that the present administration appears bereft of ideas with which to tackle many of the fallouts of the fuel subsidy removal was the speech by Mr President on Monday, 31st July 2023.\nOver the weekend, I visited the Idu train station in Abuja.\nHe should have revved the trains before suspending payment of fuel subsidy.\nWith one trillion naira saved from suspension of payment for fuel subsidies, Mr Tinubu can invest more in getting the trains to work instead of buying CNG buses."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/functional-refineries-as-solution-to-economic-woes/",
            "summary": "An economic expert, Mr. Yusha’u Aliyu, says Nigerians are expecting functional refineries to cushion the effects of subsidy removal on petrol.\nAliyu said this in an interview with the News Agency of Nigeria in Abuja, in reaction to President Bola Tinubu’s live broadcast on Monday, on the country’s economic situation.\nAliyu said functional refineries would have solved all the contending issues surrounding the general inefficiency of the oil sector, but on the contrary, nothing of such was mentioned.\nHe, however, said the simple terms required should have been functional refineries for lasting solution.\nHence goods and services skyrocketed as nothing was on ground to cushion the effect of the subsidy removal."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/fuel-subsidy-fg-labour-unions-meet-amid-looming-strike/",
            "summary": "Organized Labour has insisted on going ahead with Wednesday’s scheduled strike to protest against increasing hardship and rising costs of living due to the removal of petrol subsidy.\n“In the same vein, we are also working in collaboration with the Labour unions to introduce a new national minimum wage for workers.\n“Once we agree on the new minimum wage and general upward review, we will make budget provision for it for immediate implementation,” Tinubu said.\nOn this note, the Presidential Steering Committee on Palliatives held another marathon meeting with representatives of the Organised Labour, comprising Nigeria Labour Congress (NLC) and Trade Union Congress (TUC) at the Aso Rock Presidential Villa, Abuja.\nThey allayed the fears that the peaceful protest could be hijacked over by hoodlums, saying that security agencies were responsible for safeguarding workers in such exercises."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/subsidy-removal-fg-labour-meeting-botched/",
            "summary": "A meeting scheduled between the Federal Government and the labour unions, failed to hold on Friday, the News Agency of Nigeria (NAN) reports.\nThe meeting was to discuss proposals for appropriate palliatives to soften the impact of fuel subsidy removal on Nigerians and other matters.\nAfter a meeting on Wednesday, Festus Osifo, Trade Union Congress (appropriate palliatives) president, said that the talks would continue on Friday.\nThe meeting was scheduled to hold in the conference room of the office of the Chief of Staff to the President.\nNAN reports that the Federal Government had pledged to continue to work out measures to ameliorate the effect of the fuel subsidy removal on Nigerians."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/fuel-subsidy-removal-can-urges-fg-to-soften-impact-on-masses/",
            "summary": "The Christian Association of Nigeria (CAN) has lent its voice to appeals to the Federal Government to move quickly and affectively to soften the pains of the fuel subsidy removal on Nigerians.\nCAN President, Archbishop Daniel Okoh, said that though the removal of fuel subsidy had become inevitable if the Nigerian economy is to experience sustainable growth, it must be done in a way that Nigerians won’t be subjected to untold hardship.\nCAN advised the government to focus on diversifying the economy, reducing dependency on volatile commodities, and promoting investments in sectors.\nThe fuel subsidy palliatives being considered by government should go beyond cash transfers to consider introducing mass transport across the states, to reduce the cost of transportation.\n“Government should take measures to reduce the price of fuel."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/updated-subsidy-removal-im-shocked-scared-of-fgs-lack-of-plan-for-nigerians-laments-obaseki/",
            "summary": "The governor said, “I have always warned.\n“Now the subsidy is gone; the exchange rate is being aligned.\nThey don’t know what to do and how to support those who will be victims of subsidy removal.\nWe don’t like the word palliative because it is deceitful as we would rather use the word ‘support’.\nWe would support those who are already victims of this policy measure.”"
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/fuel-subsidy-removal-fgs-n5bn-to-states-not-enough-says-nlc/",
            "summary": "Speaking on the Channels Television’s ‘Politics Today’ programme on Friday, Ajaero said the N5bn would amount to less thanN1,500 per person.\nHe further said that the Federal Government did not say whether the money was a loan or a palliative to the states or to Nigerians.\n“The [National] Bureau of Statistics (NBS) has come out to say that over 133 million Nigerians are multidimensionally poor.\nYou start to wonder about the impact of N185 billion to 133 million people by their admittance.\n“If it is N5 billion, I think the organised labour would want anybody to do the calculation and tell us how it is going to impact Nigerians on what is happening currently."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/subsidy-removal-nlc-lauds-obasekis-intervention-requests-for-more-modular-refineries-licence-in-edo/",
            "summary": "Olaye said the State Governor, Mr. Godwin Obaseki, has set the right example by making the state a conducive environment for investment in the oil and gas sector, noting that two modular refineries are operational in the state.\nHailing the governor for his worker-friendly policies, Olaye said, “The removal of fuel subsidy has caused hardship to all the citizens of the nation.\nGovernor for reducing the working days of civil servants to three days in a week.\nWe appeal to the President of Nigeria to allow Nigerians to breathe.\nHe hailed the governor’s plan to allocate N500 million as the state’s palliative package to cushion the effect of the subsidy removal, noting that the governor’s efforts are well intended."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/rmafc-calls-for-palliatives-to-cushion-effects-of-fuel-subsidy-removal/",
            "summary": "The Revenue Mobilisation Allocation and Fiscal Commission (RMAFC) has reiterated its support for the recent subsidy removal announced by President Bola Ahmed Tinubu during his inaugural address, describing it as long overdue and a major challenge to the economic growth and development of the country.\nThe chairman described the 29th May 2023 pronouncement of the removal of fuel subsidy due to the non-budgetary provision for subsidy as a master stroke that broke the jinx, stating emphatically that it is the appropriate step in the right direction.\n“The country can no longer sustain fuel subsidies whose demerits far outweigh their benefits to the citizenry.\nAliko Dangote, believing that when it becomes operational, the country will witness a glorious dawn in hassle-free oil production and distribution in the absence of subsidy regime.\nWhile commending Tinubu for his uncommon courage and political will in doing away with the issue of fuel subsidy, he urged the new administration to work out strategies that would cushion the attendant effect of the new policy."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/tinubu-orders-palliatives-to-mitigate-impact-of-petrol-subsidy-removal/",
            "summary": "President Bola Ahmed Tinubu has stated that palliatives would be put in place to mitigate the adverse ripple effects of the petrol subsidy removal on Nigerians.\nKyari noted that there is no reversal on the petrol subsidy removal because the government can no longer afford to fund subsidy.\nMeanwhile, Amnesty International, in a statement on Thursday by its acting director, Isa Sanusi, said the petrol subsidy removal must not worsen poverty in Nigeria.\nEarlier on Thursday, the Nigeria Labour Congress (NLC) said it had no plan to hold any nationwide protest today, Friday, against the petrol subsidy removal.\nHowever, the Coalition of Northern Groups (CNG) knocked the NLC over its “slow reaction” to the petrol subsidy removal."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/the-palliatives-nigerians-need/",
            "summary": "Following his assumption of office seven weeks ago, President Bola Ahmed Tinubu’s first policy announcement was the removal of the contentious fuel subsidy regime.\nPresident Tinubu, in a swift and decisive move on inauguration, knocked off the fuel subsidy, promising to hedge the anticipated effects.\nThe N500 billion palliatives proposal has since generated much controversy in the country.\nDays back, the Nigeria Labour Congress rejected the Federal Government’s planned N500 billion palliatives to cushion the effect of fuel subsidy removal.\nAll said, fuel subsidy removal is aimed at achieving long-term economic sustainability."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/nlc-rejects-palliative-cash-transfers-accuses-govt-of-robbing-the-poor-to-pay-the-rich/",
            "summary": "Comrade Joe Ajaero, president of the Nigeria Labour Congress (NLC), in a scathing response to the Federal Government’s proposed palliative cash transfers to the underprivileged, says the venture is structured such that it robs the poor to feed the rich.\nThe NLC also expresses concerns over the lack of transparency in the process, especially regarding the data for the purported 12 million poorest households and the mechanisms for distributing the cash transfers.\nThis delay, coupled with the government’s continued borrowing spree, raises suspicions among the NLC and the Nigerian public, regarding the government’s true intentions.\nThe proposed palliative cash transfers have stirred controversy and sparked debate over the government’s commitment to social dialogue and the equitable distribution of resources.\nAs the situation unfolds, Nigerians await the government’s response and the NLC’s potential next steps in addressing this critical issue."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/tinubu-promises-palliatives-to-relieve-subsidy-removal/",
            "summary": "President Bola Ahmed Tinubu Wednesday in Abuja assured Nigerians that the framework for palliatives to remedy the effects of fuel subsidy removal was being worked out, assuring that the decision was in the best interest of the country, especially in guaranteeing future prosperity.\nNigeria is reborn already with fuel subsidy removal.\nIt is a rebirth of the country for the largest number over a few smugglers.\nI never thought I was going to be here as President, but God Almighty has brought me,’’ President Tinubu stated.\nThe President assured the governors and Nigerians that he will work towards “unity, equity, stability, and prosperity of the country’’."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/subsidy-removal-were-working-out-framework-for-palliatives-tinubu-assures-nigerians/",
            "summary": "Nigeria’s President Bola Ahmed Tinubu on Wednesday assured citizens that the framework for palliatives to remedy the effects of fuel subsidy removal was being worked out, assuring that the decision was in the best interest of the country, especially in guaranteeing future prosperity.\nNigeria is reborn already with fuel subsidy removal.\nIt is a rebirth of the country for the largest number over a few smugglers.\nI never thought I was going to be here as President, but God Almighty has brought me,’’ he said.\nThe President assured the governors and Nigerians that he will work towards “unity, equity, stability, and prosperity of the country’’."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/fuel-subsidy-palliatives-committee-to-deliver-report-in-8-weeks/",
            "summary": "A steering committee set up by Government on Monday, to facilitate the delivery of palliatives to cushion the impact of fuel subsidy removal on Nigerians, has eight weeks to conclude its work.\nThis committee is made up of representatives of Government, the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC).\nFollowing a meeting with Government at State House, Abuja, Monday, Organised Labour announced that it has agreed to participate in the steering committee to receive reports from other sub- committees.\nThe objective is to determine the nature of palliatives to be delivered to Nigerians, in the short, medium and long term.\nOrganised Labour had on June 5 suspended its planned nationwide strike over fuel subsidy removal, following the agreement reached with the Federal Government."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/land-of-palliative-exploring-uncharted-lands/",
            "summary": ""
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/fg-in-frantic-fence-mending-effort-with-labour/",
            "summary": "The Nigerian Labour Congress (NLC) was conspicuously absent from the meeting.\nAt the meeting, the TUC presented a list of demands before government, as a basis for initial understanding and cooperation.\nThese included an increase in the minimum wage, tax holidays for certain categories of people, as well as reverting to status quo on oil subsidy.\nThis, it hopes would open a window of relief to President Tinubu, who is eight days in office, today, Monday June 5, and is faced with major headwinds in the take-off of his administration.\nFurther relieved will come to teeming Nigerians and businesses that could be saved the pains and losses that accompany labour strikes."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/full-text-of-president-tinubus-broadcast-to-nigerians/",
            "summary": "TEXT OF THE NATIONAL BROADCAST BY PRESIDENT BOLA TINUBU TO NIGERIANS ON CURRENT ECONOMIC CHALLENGES.\nSuch a vast sum of money would have been better spent on public transportation, healthcare, schools, housing and even national security.\nIt diverted money that should have been used to create jobs, build factories and businesses for millions of people.\nWith the fund, our states will become more competitive and on a stronger financial footing to deliver economic prosperity to Nigerians.\nNo Nigerian student will have to abandon his or her education because of lack of money."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/court-restrains-labour-from-strike-action-says-fg/",
            "summary": "The Federal Government is bringing a new dimension to bear in its bid to dissuade the Nigeria Labour Congress (NLC) from embarking on a proposed nationwide strike slated to kick-off Tuesday.\nThe NLC, on Wednesday, served a seven-day notice on the Federal Government, asking it to reverse all “anti-poor” and “insensitive” policies, failing which labour would call a nationwide strike.\nLabour had kicked against government’s removal of petrol subsidy, which it said came without adequate buffers.\nLabour likewise frowned upon the recent increases in educational bills in universities and secondary schools, including those run by the Federal Government.\n“The NLC has submitted to the jurisdiction of the court and is being represented by the reputable law firm of Femi Falana, SAN."
        },
        {
            "url": "https://nigerianobservernews.com/2023/09/red-cross-mobilises-relief-materials-to-libya-after-disastrous-flood/",
            "summary": "The International Committee of Red Cross (ICRC) has mobilised medicines, food items, body bags, first aid kits and other household items to Libya towards assisting thousands of families devastated by the flood that ravaged the country recently.\nIt should be recalled that this week, Storm Daneil hit Derna city in Libya resulting in devastating flood that left woes and anguish among the people of Libya.\nBefore the flood, the city was said to have about 125,000 inhabitants.\nAccording to Yann Fridez, the head of ICRC’s Libya delegation, “This disaster was violent and brutal.\nThe city faces immense emotional trauma,” adding that the team in Derna will support families with micro-economic activities."
        },
        {
            "url": "https://nigerianobservernews.com/2023/03/cash-crunch-relief-comes-as-cbn-floods-banks-with-old-notes/",
            "summary": "…weekend service speeds up supplyAs at Monday, Nigerians are getting significant relief from the cash crunch which followed the invalidation of the old N1,000 and N500 denomination of currency notes in the wake of a currency redesign exercise January 31.\nThe said currency notes previously invalidated by the CBN had been revalidated by the Supreme Court in a ruling but some silence and poorly perceived messages had the publics apparently confused and in doubt.\nCustomers thronged commercial banks and ATMs across the country through the weekend and into Monday and received their cash in incremental volumes, larger than the previous pittances of between N2,000 and N5,000 of weeks and days past.\nBy Monday, banks were dispensing from as little as N5,000 to as much as N200,000 in the old notes, especially across the counter.\nAlso customer turn-around time and cash collection success rate at the banks had improved significantly, despite the long queues."
        },
        {
            "url": "https://nigerianobservernews.com/2023/02/relief-for-lp-others-as-court-bars-inec-from-using-mc-oluomo-for-electoral-items-distribution/",
            "summary": "The court also granted the plea by the applicants’ counsel for abridgement of time to hear the substantive suit because of the fast approaching elections and adjourned hearing to Wednesday, February 22.\nMC Oluomo is believed to be loyal to the presidential candidate of the ruling All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu.\nThe order of interlocutory injunction is hereby granted.”Thereafter, the applicants’ counsel pleaded for an abridgement of time to hear the substantive suit, which was also granted.\nINEC, the only defendant in the suit, was reportedly absent at the proceedings, though the applicants’ counsel told the court that the electoral commission was served with the court papers.\nJustice Aneke, in granting the application for abridgement of time, ordered that all the processes in the suit be served on INEC."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/subsidy-price-of-petrol-will-come-down-kyari/",
            "summary": "The Nigerian National Petroleum Company Limited, Group Chief Executive Officer, Mele Kyari has told Nigerians not to panic about the rising prices of petrol across the country.\nKyari said on Thursday that competition among major players in the oil sector would force down the price of petrol as against the upward trends that have caused panic in the country.\nThis, he said, would ensure healthy competition which would ultimately lead to a downward review of pump prices of petroleum across the country.\nIt could be noted that queues returned to fuel stations across the country following the recent increase in the petrol pump price occasioned by the discontinuance of petroleum subsidy.\nTalks between the Federal Government and organised labour over the removal of fuel subsidy ended in a deadlock on Wednesday as they failed to reach a consensus following the hike in petrol pump prices by oil marketers."
        },
        {
            "url": "https://nigerianobservernews.com/2023/05/fear-grips-ughelli-residents-over-subsidy-removal-announcement/",
            "summary": "Long queues could be seen in the few petrol stations that were selling the product, while some residents could be seen milling about carrying jerrycans to buy fuel.\nOne of the residents, Mrs. Ejiro Egone complained that she was taken unaware by the announcement as she could not buy fuel at home before the spike in price.\nShe lamented that the subsidy removal would compound the economic hardship introduced by the Buhari maladministration.\nPastor Philip Ojakorotu who spoke to journalists about the subsidy removal, asked if the situation would spike the prices of petroleum products.\nContinuing, Ojakorotu said the subsidy removal was too hasty, saying that the price of foodstuff and transportation would increase astronomically."
        },
        {
            "url": "https://nigerianobservernews.com/2023/05/subsidy-removal-to-save-nigeria-15bn-in-twelve-months/",
            "summary": "The decision to remove subsidy on petroleum products by President Bola Ahmed Tinubu-led federal government is expected to save Nigeria $7.32 billion from July to December 2023, and by at least $15 billion in 2024, the Nigerian Observer has estimated.\n“Subsidy payment of circa N400 bn per month is a cancer in Nigeria’s economic blood.\nHowever, the decision to remove subsidy has garnered different reactions immediately after President Tinubu declared during his inaugural speech that “Subsidy is gone”.\nThe nation’s flagship oil and gas company, NNPC Limited, has welcomed the decision of the federal government to remove subsidy on petroleum products.\n“NNPC Limited welcomes the decision by the Federal Government to remove subsidy on PMS."
        },
        {
            "url": "https://nigerianobservernews.com/2023/05/subsidy-removal-will-not-take-immediate-effect-fg/",
            "summary": "The Federal Government has said Nigerians should stop the ongoing panic buying of petrol by consumers across the country, saying that subsidy removal will not end up until July 2023.\n“The public is advised to note that President Bola Tinubu’s declaration that “subsidy is gone” is neither a new development nor an action of his new administration.\nHe was merely communicating the status quo, considering that the previous administration’s budget for fuel subsidy was planned and approved to last for only the first half of the year.\n“Effectively, this means that by the end of June, the Federal Government will be without funds to continue the subsidy regime, translating to its termination.\nThe panic-buying that has ensued as a result of the communication is needless; it will not take immediate effect."
        },
        {
            "url": "https://nigerianobservernews.com/2023/05/fuel-subsidy-is-gone-tinubu/",
            "summary": "Subsidy can no longer be justified, given the ever-increasing cost,” President Tinubu said today in his inaugural speech to unveil his programme for a four-year tenure as Nigeria’s 16th president.\nPresident Tinubu latest comment aligns with his manifesto, christened “Renewed Hope” as he indicated that the only way to ensure steady supply of petroleum products in Nigeria was through the removal of fuel subsidy.\n“We shall phase out the fuel subsidy yet maintain the underlying social contract between government and the people.\nOn Nigeria’s multiple exchange rate regime, President Tinubu said the Central Bank of Nigeria must work towards a unified exchange rate.\nPresident Tinubu reiterated his commitment to his 1000 jobs creation promise, adding that his administration will continue from where former President Muhammadu Buhari stopped on infrastructure."
        },
        {
            "url": "https://nigerianobservernews.com/2023/05/high-court-orders-cbn-to-disclose-fx-subsidy-information/",
            "summary": "The court’s decision, based on suit number FHC/ABJ/CS/1622/2020, comes after the CBN denied HEDA Resource Centre’s Freedom of Information (FoI) request to disclose information on foreign exchange management.\nUnfortunately, the CBN did not respond to the FoI request, prompting HEDA Resource Centre to pursue legal action to challenge the CBN’s denial.\nThe CBN later submitted a counter-affidavit on February 2, 2022, denying possession of the requested information.\nConsequently, the court has issued a compelling order to the CBN, a public institution, to disclose the information requested by HEDA in their FoI request.\nThe court deemed the CBN’s failure to provide the information as unlawful, resulting in an order of mandamus to release the requested information outlined in HEDA’s FoI request dated October 14, 2020."
        },
        {
            "url": "https://nigerianobservernews.com/2023/05/fuel-subsidy-buhari-seeks-senate-approval-for-800m-world-bank-loan/",
            "summary": "In quest of an $800 million loan from the World Bank to soften the impact of fuel subsidy removal on the economy, President Muhammadu Buhari has written a letter to the Senate, seeking approval for the application.\nIt will be recalled that the Federal Government had announced plans to access an $800 million World Bank grant targeting 50 million vulnerable Nigerians or ten million households, as part of its subsidy palliative measures.\nZainab Ahmed, Minister of Finance, Budget and National Planning said the disbursement is planned at cushioning the intended subsidy removal slated for June 2023.\nAuwal Musa-Rafsanjani, Executive Director of CISLAC, ,queried the Federal Government over the loan request, adding that borrowing to fund post-fuel subsidy removal palliatives was ill informed.\nThe finance minister, who announced the decision, stated that the council concluded in its recently concluded meeting that it was not a favourable time for the action."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/fuel-subsidy-removal-edo-govt-empathizes-with-citizens/",
            "summary": ""
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/benin-residents-lament-as-petrol-subsidy-removal-takes-toll/",
            "summary": "Mrs Vivian, a trader, complained that the sudden increase in the cost of transportation has affected the cost of foodstuff.\nA Bolt driver in Benin metropolis, who does not want his name mentioned, said the subsidy removal has put him in dilemma as it has practically wiped off his profit.\nEven then, the trader who resides at Upper Mission Extension said he spends nothing less than N1,200 to and from his shop daily since the removal of the petrol subsidy.\nThe Nigeria Labour Congress (NLC) and its associates, following the petrol subsidy removal, had threatened to go on strike, though they later suspended the plan.\nBut the presidential candidate of the Labour Party, Mr Peter Obi, while supporting subsidy removal, said he disagreed with the manner in which the Federal Government went about the implementation of the policy."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/judiciary-workers-declare-nationwide-strike-over-petrol-subsidy-removal/",
            "summary": "Judiciary Staff Union of Nigeria (JUSUN) has declared a nationwide strike to protest the federal government’s removal of petrol subsidy.\nPresident Bola Ahmed Tinubu’s announcement of subsidy removal on May 29 engineered all Nigerian oil marketers, including government-owned Nigerian National Petroleum Company Limited (NNPCL), to increase pump price of the product above expectations.\nThe subsidy removal has resulted in about 176 percent increase in the price of petrol from N194 to about N537 per litre.\nNLC and its affiliates had announced plan to commence strike by Wednesday to register their rejection of the subsidy removal.\nLabour is aggrieved that the federal government hurriedly removed subsidy on petrol without consultation with relevant stakeholders on how to manage the fallouts."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/benin-republic-petrol-prices-soar-as-nigeria-moves-to-end-subsidy/",
            "summary": "Petrol prices have almost doubled in the neighbouring Republic of Benin after it was announced that fuel subsidies would be scrapped in Nigeria, the BBC reports.\nGovernment had said that the cost of the fuel subsidy was too high and had become unsustainable.\nThe Nigerian National Petroleum Company Limited (NNPCL) had announced in February that the country was spending over N400 billion monthly on petroleum subsidy.\nThe Nigeria Labour Congress (NLC) irked by government announcement to end the fuel subsidy has declared a nationwide strike from next Wednesday.\nAjaero said the government, particularly the Nigerian National Petroleum Company (NNPC) Limited had up until Wednesday to revert to the old price of Premium Motor Spirit (PMS) otherwise referred to as petrol."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/subsidy-removal-forex-unification-painful-but-key-to-rebuilding-economy-world-bank/",
            "summary": "The World Bank has thrown its weight in support of the Federal Government’s subsidy removal and the exchange rate unification.\nSpeaking at an event organised by the World Bank to assess Nigeria’s economy in the last six months on Tuesday, Country Director, Dr Subham Chadhuri, explained that the policy though painful remains key to rebuilding the economy of the nation.\nAlso speaking, a lead economist at the World Bank, Alex Seinart, said the removal of the fuel subsidy is projected to achieve estimated fiscal gains of about N3.9 trillion in 2023.\nThe economist further projects that the petroleum subsidy removal is likely to lead to an increase in inflation in the upcoming months before contributing to disinflation in the medium term.\nOn the exchange rate, the senior economist at the World Bank said that the previous foreign exchange management approach impeded investment and growth, contributed to inflation and undermined the efficacy of monetary and fiscal policies."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/subsidy-removal-with-5600-cng-vehicles-in-benin-obaseki-urges-increased-gas-investments/",
            "summary": "The governor, who made the call while speaking to journalists in Benin City, noted that the State has the largest deposit of on-shore gas in the country.\nData from NIPCO Gas, a joint-venture company between NIPCO and Nigeria Gas Company Limited (NGC), indicate that over 5,600 vehicles in Benin City run on Compressed Natural Gas after the initiative was rolled out in 2007 and commissioned in 2009.\n“NIPCO Gas has established 15 CNG running stations in Benin to provide an alternative for the Gasoline run automobiles.\nPresently it is in the process of constructing further 15 stations in and around Benin City.\nMore than 5,600 vehicles have been converted to CNG for motorists in and around Benin City,” the company said on its website."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/subsidy-removal-tinubu-says-nigeria-cant-continue-to-be-father-christmas-to-others/",
            "summary": "President Bola Tinubu says his administration took the right decision by removing the subsidy on premium motor spirit (PMS), popularly known as petrol.\n“You have paid attention to the subsidy removal.\nPetrol from Nigeria is regularly smuggled into nearby countries including Cameroon, Ghana, Benin Republic, and as far as Sudan.\nAnd following the announcement of petrol subsidy removal in Nigeria, the product was sold for 700 CFA or 800 CFA in Benin Republic — up from a previous price of 450 CFA.\nThe Cable also reported that motorcyclists in Cameroon recently protested Nigeria’s subsidy removal, saying the development has adversely affected their businesses."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/cartoon-a-short-story-on-fuel-subsidy-removal/",
            "summary": ""
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/the-issue-of-fuel-subsidy-in-nigeria/",
            "summary": "During his inaugural speech, President Tinubu announced the removal of the fuel subsidy which increased the pump price of petrol from N194 to over N550 with variations in most states.\nPresident Tinubu said the 2023 budget does not have provision for fuel subsidy regime.\nPresident Tinubu said the education sector must be improved as part of effort to reduce poverty.\nIn order to successfully drive the subsidy removal policy through, more than anything, the Tinubu government needs to gain the people’s trust.\nA newspaper report recently puts Nigeria’s spending on its fuel subsidy regime in the last 18 years at about N21.7 trillion, based on figures sourced from NEITI."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/effect-of-removal-of-fuel-subsidy/",
            "summary": "On May 29, 2023, the Fuel Subsidy was removed.\nThe negative effect of the removal of fuel subsidy has affected the masses gravely.\nThe removal of the subsidy has affected the cost of transportation due to the increase of fuel price, as well as the price of food.\nThe removal of the fuel subsidy also affects many individuals in different positions and some sectors.\nThe masses hope and believe for a rapid change to these issues of the fuel subsidy removal affecting them."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/unraveling-the-impact-of-subsidy-removal-on-nigerians/",
            "summary": "Subsidy removal entails the removal of government subsidies on essential commodities such as fuel, resulting in increased prices.\nThis article aims to unravel the effects of subsidy removal on Nigerians and explore potential solutions to alleviate the burden on the general populace.\nRising Cost of LivingOne of the immediate consequences of subsidy removal is the significant increase in the cost of living.\nWith the removal of subsidies, transportation costs have skyrocketed leading to a surge in prices of food, rent and other daily necessities.\nPotential solutionsTo alleviate the burden on Nigerians the government should consider implementing measures to cushion the effects of subsidy removal."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/fx-unification-subsidy-removal-done-to-block-leakages-heal-economy-tinubu/",
            "summary": "President Bola Tinubu says he chose to unify Nigeria’s official and parallel market foreign exchange rates to save the country from further financial bleeding.\nThe president added that he could have maintained the existing multiple foreign exchange rate regime and even benefit from it.\nHe said his decisions to unify the exchange rates and remove fuel subsidy were taken to block financial leakages and put the country on the path to economic recovery.\nPresident Tinubu said he took the decision in the nation’s best interest just like he did with fuel subsidy removal.\nHe said the decisions on fuel subsidy removal and exchange rate unification had to be taken early and firmly, as matters of principle and decisiveness, with the long term benefits to the nation’s economy in view."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/conoil-reaps-n6bn-on-subsidy-removal-as-half-year-profit-rises-245/",
            "summary": "Revenue for the half-year period ended June 2023 rose by 54.9 percent to N87.14 billion in contrast with N56.24 billion as of June 2022.\nIn 2022, Conoil made N5.56 billion while in 2023, revenue from lubricants fell to N2.86 billion at half year 2023.\nLubricants’ market share fell to 3 percent at half year 2023 as against 10 percent as of June 2022.\nTotal liabilities rose to N50.01 billion at half year 2023 as against N40.89 billion at half year 2022.\nIn reflection of market realities, the retail price of petrol rose from an average of N250 per litre to N511."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/effects-of-fuel-subsidy-on-goods-and-services-in-nigeria-today/",
            "summary": "Fuel subsidy is a measure taken by the government to lower the price of petrol or diesel for the general public.\nIt entails offering monetary aid or incentives by the government to lessen the burden of fuel consumption prices on individuals (paying about 40% of the price of imported fuel).\nHowever, by the early 1990s, petrol output wassufficiently short of the growing domestic demand leading to the requirement that the Nigerian National Petroleum Company still refined some petrol abroad.\nAnother advantage of fuel subsidy is the increase in purchasing power for of the consumers as the ability to purchase the petrol is there because of its cheap rate.\nUntil the present President of the Federal Republic of Nigeria, Bola Ahmed Tinubu who on his day of inauguration gave a speech and said, “Subsidy is gone”."
        }
    ],
    "Delta": [
        {
            "url": "https://nigerianobservernews.com/2023/06/oborevwori-cautions-lg-chairmen-against-multiple-taxations/",
            "summary": "Delta State Governor, Rt.\nSheriff Oborevwori has urged Local Government Council Chairmen to check the activities of revenue collectors to reduce the burden of fuel subsidy removal on the people.\nOborevwori made the call when the Association of Local Governments of Nigeria ALGON, Delta State Chapter led by Hon.\nOborevwori said; “funding remains a challenge in our local government councils.\nIt is our hope that with the removal of the fuel subsidy, more monies will be accrued to the local governments and states."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/fuel-subsidy-removal-delta-algon-approves-palliatives-for-lg-workers/",
            "summary": "Chairman of the Association of Local Governments of Nigeria (ALGON), Delta State Chapter, Barr.\nVictor Ebonka, says workers in the 25 local government councils in the state would receive the same palliative packages approved for workers in the state public service by Governor Sheriff Oborevwori.\n“The workers will also be placed under a work schedule (shifting) similar to that of the state workers to help reduce their burden of the fuel subsidy removal on them.\n“For the loan facility sort by ALGON for payment of local government pensioners, we have perfected all that is necessary.\n“The teachers recruitment exercise is already on going and soon those qualified will be invited for interviews."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/fuel-subsidy-oborevwori-rolls-out-palliatives-for-delta-workers/",
            "summary": "As part of measures to cushion the impact of fuel subsidy removal, Governor Sheriff Oborevwori of Delta State, on Tuesday, rolled out palliatives for workers in the state with each set to receive N10,000 monthly as support from the government.\nGovernor Oborevwori disclosed this in Asaba shortly after he swore-in 26 Commissioners as members of the State Executive Council.\nHe said the payment to support the workers would commence in August and last for three months.\nHe said: “As you are aware, local government workers are not under the administration of the state.\n“I expect us to roll out palliatives for these categories of people as soon as the committee submits its report."
        }
    ],
    "Bauchi": [
        {
            "url": "https://nigerianobservernews.com/2023/06/bala-mohammed-steps-in-as-pdp-governors-chairman/",
            "summary": "Bauchi State Governor, Bala Mohammed, has been elected as the chairman of Peoples Democratic Party’s governors’ forum to replace Oyo State Governor Seyi Makinde as chairman of the forum.\nSenator Mohammed was elected today, Saturday at a retreat for elected PDP officials in Bauchi State.\n“Between 1999 and 2007, the PDP government initiated the petroleum subsidy removal and I chaired the committee.\nWe achieved subsidy removal in two phases but only after providing palliatives to those most affected by the subsidy removal,” Atiku said.\nAlso, acting national chairman of the PDP, Umar Damagun, urged members of the party to work together as one family."
        }
    ],
    "Oyo": [
        {
            "url": "https://nigerianobservernews.com/2023/06/bala-mohammed-steps-in-as-pdp-governors-chairman/",
            "summary": "Bauchi State Governor, Bala Mohammed, has been elected as the chairman of Peoples Democratic Party’s governors’ forum to replace Oyo State Governor Seyi Makinde as chairman of the forum.\nSenator Mohammed was elected today, Saturday at a retreat for elected PDP officials in Bauchi State.\n“Between 1999 and 2007, the PDP government initiated the petroleum subsidy removal and I chaired the committee.\nWe achieved subsidy removal in two phases but only after providing palliatives to those most affected by the subsidy removal,” Atiku said.\nAlso, acting national chairman of the PDP, Umar Damagun, urged members of the party to work together as one family."
        }
    ],
    "Edo": [
        {
            "url": "https://nigerianobservernews.com/2023/05/breaking-news-nnpc-confirms-petrol-price-hike/",
            "summary": "Hours after Nigerians woke up to find a petrol price hike of over 100 percent at Nigerian National Petroleum Corporation (NNPC) petrol stations across the country Wednesday morning , the organisation has come out with an official announcement of the price hike.\nThe new price of a litre of PMS in petrol stations in Benin City aligns with a document being circulated on social media which put the minimum price of a litre of PMS at N488 and the highest price at N557.\nWhile the authenticity of the document could not be verified as at the time of filing this report, The Nigerian Observer visited two petrol stations in Benin City-Buvel and NNPC.\nAt Buvel, a litre of petrol was sold for N511 while it was N520 at the NNPC station.\nThe unverified document stated that a litre of petrol is to be sold at N511 in Edo State starting from May 31, 2023."
        },
        {
            "url": "https://nigerianobservernews.com/2023/05/discordant-tunes-as-petrol-price-jumps-100-across-nigeria/",
            "summary": "…N488 in Lagos; Borno- N557Less than 48 hours after President Tinubu announced that “Subsidy is gone”, pump prices of the Premium Motor Spirit (PMS) popularly known as petrol, have been hiked by over 100 percent across most petrol stations in Nigeria.\nThe new price of a litre of PMS in petrol stations in Benin City aligns with a document being circulated on social media which put the minimum price of a litre of PMS at N488 and the highest price at N557.\nWhile the authenticity of the document could not be verified as at the time of filing this report, The Nigerian Observer visited two petrol stations in Benin City-Buvel and NNPC.\nAt Buvel, a litre of petrol was sold for N511 while it was N520 at the NNPC station.\nThe unverified document stated that a litre of petrol is to be sold at N511 in Edo State starting from May 31, 2023."
        },
        {
            "url": "https://nigerianobservernews.com/2023/09/obaseki-flags-off-free-bus-service-to-cushion-impact-of-subsidy-removal/",
            "summary": "The free transport scheme is expected to cover intra-city and intercity routes including Auchi – Igarra – Ibillo–Ososo; Uzebba–Ikhin – Otuo, and Abudu-Ubiaja, Abudu-Urhonigbe and Ewohirin to Ewatto.\nThe intra-city routes are Ramat–Kingsquare; New Benin–Kingsquare; Kingsquare – Ekenwan Road; Kingsquare–Airport Road; Kingsquare–Sapele Road and Kingsquare – Adesuwa, Kingsquare–Ogida; New Benin – Upper Mission; Kingsquare–Ugbowo; Kingsquare–Agbor Road; Kingsquare–Upper Sokponba; New Benin – Ugbowo and New Benin–Aduwawa.\nHe stated, “We call on all Edo people to use this service effectively and ensure they use it regularly as it benefits all of us.\n“This free transportation will return money back to parents to enable them to take care of some other family needs.\nECTS before now has been offering free rides to school children and now to all Edo people."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/fuel-subsidy-removal-edo-govt-to-give-households-n20000-monthly-as-palliative/",
            "summary": "Come September, Edo State Government will provide N20,000 monthly to about 314,000 households comprised of people living below the acceptable poverty line, believed to have been captured in an authentic, credible database that details the essence of social registration.\nChris Nehikhare, and the Special Adviser on Media Projects to Edo State Governor, Mr. Crusoe Osagie, at the end of the State’s Exco meeting.\n“We are recommissioning them to make sure that they think like law enforcement agents and this is for the security of Edo people.\nWe want Edo State to be one of the safest states in the country.\n“I don’t know what his motives were or what his motive is, but as politicians, we will never shut the door.”"
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/nlc-protest-obaseki-charges-workers-to-reject-fgs-fraudulent-palliative-offers-n500m-monthly-package/",
            "summary": "The so-called money for palliative should be given to the local government which is closer to the people to take care of their people.\nI call on the Nigerian Labour Congress to reject the Federal Government’s palliative.\nWe are suffering too much in Nigeria and the Federal Government is insensitive to the plight of the people.\nIn Edo State, we are labour-friendly and have increased our minimum wage two years ago N40, 000).\nHe said, “We, the NLC are here today to register our displeasure over the economic hardship in the country."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/provide-palliatives-like-edo-and-kwara-falana-urges-state-govts-lgs/",
            "summary": "Local and state governments across Nigeria should emulate the Edo and Kwara state governments in taking urgent measures to alleviate the effects of fuel subsidy removal on their constituents, Femi Falana, a Senior Advocate of Nigeria (SAN) and rights activist has urged.\nHe cited the cases of Edo and Kwara states, where work days and school days, respectively, have been reduced from five to three days per week.\nState governments must intervene decisively.\nMeanwhile, the Edo State Governor, Godwin Obaseki, moved ahead of the pack in bringing relief to citizens.\nSo did his Kwara State counterpart, Abdulrahman Abdulrazak."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/obasekis-fuel-subsidy-palliative-and-lessons-for-other-state-governors/",
            "summary": "It is pedestrian information that in his effort to cushion the effects of the rising cost of living in the country, triggered by the recent removal of subsidy on petroleum products , the Edo state governor, Godwin Obaseki , raised the minimum wage for workers on its payroll from N30,000 to N40,000.\nOur governor must internalise as well as recognise that ‘power properly understood is nothing but the ability to achieve a purpose.\nWhat is also needed is a realisation that power without love is reckless and abusive, and love without power is sentimental and anaemic.\nThis fact becomes overwhelmingly valid when one remembers that this is not his first impressive and exemplary people-focused leadership provision.\nThe time is ripe for Nigerians to reject the false and horrendous reasons being offered to them by their clueless state governors as an explanation for why their states are not yet developed."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/edo-govt-debunks-fraudulent-subsidy-palliative-portal/",
            "summary": "The Edo State Government has cautioned members of the public to disregard antics by fraudsters who are operating a portal to obtain details of unsuspecting members of the public to perpetrate a scam scheme.\nThe Edo State Commissioner for Communication and Orientation, Chris Nehikhare, in a statement, discredited the scheme.\nAccording to him: “The attention of the Edo State Government has been drawn to a link to a portal which is being used to obtain details of unsuspecting members of the public to defraud.\n“The link is being circulated on WhatsApp messaging platform and is intended to scam unsuspecting persons.\nPlease kindly disregard the link.”"
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/subsidy-palliatives-fg-must-not-gag-elected-officials-when-they-speak-truth-to-power-edo-govt/",
            "summary": "The Edo State Government wishes to express its displeasure on the recent press statement credited to the Minister of Information and National Orientation, Muhammed Idris, over Governor Godwin Obaseki’s comments regarding the Federal Government’s handling of the resultant effects of the removal of fuel subsidy.\nIt is unfortunate and sad that the Federal Government now wants to gag citizens and even a popularly elected governor from speaking truth to power and expressing himself in the light of the perilous times we have fallen into.\nThe claim that Governor Godwin Obaseki failed to attend the National Economic Council (NEC) meetings is blatantly false.\nThe governor has attended all NEC meetings since the onset of this administration and records are there to prove this fact.\nRecords of Edo State Government’s performance are also available for Nigerians to verify."
        },
        {
            "url": "https://nigerianobservernews.com/2023/09/labour-kicks-off-two-day-warning-strike/",
            "summary": "…banks, courts, MDA’s closedThe Nigeria Labour Congress (NLC) has kicked-off a two-day warning strike, protesting the hardship caused the populace by the removal of fuel subsidy and the failure of the Federal Government to adequately address the matter.\nLabour further says government broke off negotiations on the matter and failed to put in place some relief measures previously agreed upon.\nThe NLC in Edo State reportedly shut the gates to the State High Court premises in line with the declared strike.\nAlso in Benin, the most noticeable manifestation of the strike was the closure of commercial banks.\nPolaris Bank, GT Bank, Access Bank, First Bank, UBA, Zenith Bank and other bank branches on Ekehuan Road were closed."
        },
        {
            "url": "https://nigerianobservernews.com/2023/04/fire-incident-edo-govt-distributes-relief-materials-to-communities-in-ekpoma-owan-others/",
            "summary": "The Edo State Government, on Wednesday, presented relief materials to victims of a fire incident in Ekpoma, Esan West Local Government Area (LGA) and Owan Community, in Ovia North-East (LGA), among others.\nAnother fire disaster was recorded in Owan Community, Ovia North-East.\n“We have come today to support the affected communities with relief materials to the affected victims and remind Edo residents that His Excellency, Mr. Godwin Obaseki will always respond to the needy in the society.\n“This year alone, we have provided emergency and relief materials to flood victims in Etsako Central, Owan West, Ovia North-East, Ovia South-West, Ikpoba-Okha, and Esan South-East LGAs, among others.\nWe got the call to come to get our relief materials today which came as a huge surprise.”"
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/fuel-subsidy-removal-edo-govt-empathizes-with-citizens-cuts-down-workdays-to-thrice-a-week/",
            "summary": "In the wake of fuel subsidy removal by the Federal Government, fuel prices have increased astronomically leading to rise in prices of goods and services and overall cost of living.\nThe Edo State Government shares the pains of our people and wants to assure everyone that we are standing with them in these very challenging times.\nAs a proactive government, we have since taken the step to increase the minimum wage paid to workers in Edo State from the approved N30, 000 to N40, 000, the highest in the country today.\nTherefore, the Edo State Government is hereby reducing the number of work days that civil and public servants will have to commute to their work places from five days a week to three days a week.\nSimilarly, fibre optic connections are being made available to help our people work remotely, thereby reducing their cost of transportation."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/fuel-subsidy-removal-edo-launches-24-hour-unlimited-free-internet-service-in-mdas-other-public-places-for-workers/",
            "summary": "…School of Nursing, Pensions Bureau, Victor Uwaifo Centre, others covered in free Wi-Fi serviceThe Edo State Government is providing 24-hour free Wi-Fi service in various Ministries, Departments and Agencies (MDAs) and other public places in the State to ensure unlimited internet access to workers in the wake of the three-day weekly work schedule for civil and public servants as part of efforts to cushion the effect of the fuel subsidy removal by the Federal Government.\nIn a statement, the Edo State Head of Service, Anthony Okungbowa Esq., said the government is committed to ensuring optimal productivity and efficiency amid the new work schedule, noting that the free Wi-Fi service will guarantee free internet access to workers and others who need internet connectivity to perform their duties and reside in proximity to the designated locations covered by the Wi-Fi service.\nAccording to the Head of Service, the locations with installed free Wi-Fi include the School of Nursing, Limit Road/Sapele Road; Pensions Bureau, Ring Road Roundabout; Victor Uwaifo Centre, Airport Road; Civil Service Commission, Sapele Road, and the John Odigie Oyegun Publilc Service Academy (JOOPSA), Central area Road/Igbinedion Road.\nOkungbowa further stated that each of the sites offers approximately 180 degrees coverage from the point of presence, which are the above listed public places.\n“Therefore, we have taken the step to provide free WiFi service, which guarantees internet connectivity to workers and others who rely on the internet to perform their tasks and reside in proximity to the designated locations covered under this service."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/fuel-subsidy-removal-edos-new-work-policy-wont-affect-productivity-efficiency-okungbowa-assures/",
            "summary": "According to the HOS, “This reduction of work days in Edo State will in no way affect our performance and productivity negatively.\nThe Edo State became effectively an e-governance State on November 1, 2021.\nThe shuttle bus will leave every hour of the workday to help reduce the stress of workers in the State.\nThe buses will pick up workers from these routes to the Secretariat and to other places they work.\n“The governor is very much interested in the welfare of Edo workers and the State is the first State to implement the 13th month salary and that will be paid to Edo workers by December."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/fuel-subsidy-removal-edo-roles-out-modalities-for-implementation-of-thrice-a-week-workdays-for-civil-public-servants/",
            "summary": "In a meeting with Permanent Secretaries as well as heads of Ministries, Departments and Agencies (MDAs), the Edo State Head of Service, Anthony Okungbowa Esq., said the reduced office workdays will not affect the productivity and efficiency of the Service.\nPeople should continue to visit government offices as the offices are open for business.\nThe shuttle bus will leave every hour of the workday to help reduce the stress of workers in the State.\n“The governor is very much interested in the welfare of Edo workers and the State is the first State to implement the 13th month salary and that will be paid to Edo workers by December.\nFor administrative reasons, we have chosen the first three days of the week as students will come to school for the first three days of the week."
        },
        {
            "url": "https://nigerianobservernews.com/2023/09/fuel-subsidy-removal-over-23500-passengers-benefit-from-obasekis-free-transport-service-in-24-hours/",
            "summary": "… over 23,500 passengers benefited in first 24 hoursOver 23,500 residents of Edo State have benefited from the free transport service of the Edo State Governor, Mr. Godwin Obaseki, in the first 24 hours of the commencement of the scheme, aimed at cushioning the effect of the fuel subsidy removal by the Federal Government on the people of the State.\nThe free transport scheme, which is for initial two months, operates between 6am and 7pm daily, covering all ECTS operational routes, both intra-city and inter-city routes, including Auchi – Igarra – Ibillo–Ososo; Uzebba–Ikhin – Otuo, and Abudu-Ubiaja, Abudu-Urhonigbe and Ewohirin to Ewatto.\nThe intra-city routes are Ramat–Kingsquare; New Benin–Kingsquare; Kingsquare – Ekenwan Road; Kingsquare–Airport Road; Kingsquare–Sapele Road and Kingsquare – Adesuwa, Kingsquare–Ogida; New Benin – Upper Mission; Kingsquare–Ugbowo; Kingsquare–Agbor Road; Kingsquare–Upper Sokponba; New Benin – Ugbowo and New Benin–Aduwawa.\nBriefing journalists in Benin City, the Edo State capital, the Managing Director/Chief Executive Officer of Edo State Transport Authority, Edugie Agbonlahor, said the state-owned transport company has witnessed a surge in commuters as a result of the free bus service, noting that about 23,652 passengers have benefitted from the service in the last 24 hours.\nAccording to her, “We are glad with the positive impact being made through the free bus service of the Edo State Governor, Mr. Godwin Obaseki, to cushion the effect of the fuel subsidy removal on Edo people."
        },
        {
            "url": "https://nigerianobservernews.com/2023/09/fuel-subsidy-removal-obaseki-begins-free-transport-service-across-edo-sept-11/",
            "summary": "The Edo State Governor, Mr. Godwin Obaseki, has approved free transport service for passengers across all Edo City Transport Ltd (ECTS) routes to cushion theeffect of the fuel subsidy removal by the Federal Government on people of the State.\nThe free bus service will kick off on Monday, September 11, 2023, and will run between 6.30 am to 7 pm daily.\nIn a statement, Chief Press Secretary to the Edo State Governor, Andrew Okungbowa, said the free transport service is aimed at significantly reducing the citizens’ mobility problems and improving their welfare amid the hardship caused by the Federal Government’s subsidy removal policy.\nThe statement reads: “His Excellency, the Executive Governor of Edo State, Mr. Godwin Nogheghase Obaseki, has directed the State-owned transport company, Edo City Transport Ltd (ECTS), to commence free bus services to all passengers on all their routes with effect from 11th September 2023.\n“The free bus service which spans an initial two-month period covers commuting within the Benin metropolis and from Benin- City to the major cities in the three senatorial districts.”According to Okungbowa, “The Governor’s compassionate approval is aimed at providing succour to the people of Edo State in the light of the numerous challenges arising from the removal of the fuel subsidy."
        }
    ],
    "Borno": [
        {
            "url": "https://nigerianobservernews.com/2023/05/discordant-tunes-as-petrol-price-jumps-100-across-nigeria/",
            "summary": "…N488 in Lagos; Borno- N557Less than 48 hours after President Tinubu announced that “Subsidy is gone”, pump prices of the Premium Motor Spirit (PMS) popularly known as petrol, have been hiked by over 100 percent across most petrol stations in Nigeria.\nThe new price of a litre of PMS in petrol stations in Benin City aligns with a document being circulated on social media which put the minimum price of a litre of PMS at N488 and the highest price at N557.\nWhile the authenticity of the document could not be verified as at the time of filing this report, The Nigerian Observer visited two petrol stations in Benin City-Buvel and NNPC.\nAt Buvel, a litre of petrol was sold for N511 while it was N520 at the NNPC station.\nThe unverified document stated that a litre of petrol is to be sold at N511 in Edo State starting from May 31, 2023."
        },
        {
            "url": "https://nigerianobservernews.com/2023/08/fg-approves-5bn-each-as-palliative-for-36-states-fct/",
            "summary": "The Federal Government has approved N5bn for each state and the Federal Capital Territory (FCT) to enable them to procure food items for distribution to the poor.\nBabagana Zulum, Governor of Borno State disclosed this at the Presidential Villa, Abuja, shortly after the National Economic Council (NEC) meeting.\nIn addition to the fund, Zulum said the Federal Government also released five trucks of rice each to the 36 state governors.\nAsides from the economic difficulties facing Nigeria in the wake of the subsidy removal, NEC also discussed security issues, especially recent attacks in the northern parts of the country.\nMembers of NEC have been deliberating on measures to cushion the impact of the subsidy removal."
        },
        {
            "url": "https://nigerianobservernews.com/2014/12/agency-donates-relief-materials-to-displaced-persons/",
            "summary": "JALINGO – The National Biotechnology Development Agency has donated relief Materials to displaced persons from Madagali, Mubi and other places in Borno and Adamawa states, who are camping in Jalingo.\nThe Director General of the agency, Prof. Lucy Ogbadu, presented the items to the victims on Sunday in Jalingo.\nShe said the agency was deeply concerned about the plight of the victims and prayed to God to intervene in their situation.\nResponding on behalf of the displaced persons, Rev.\nZaphanial Manyi, thanked the agency for identifying with them at the most trying moment of their lives."
        }
    ],
    "Lagos": [
        {
            "url": "https://nigerianobservernews.com/2023/05/discordant-tunes-as-petrol-price-jumps-100-across-nigeria/",
            "summary": "…N488 in Lagos; Borno- N557Less than 48 hours after President Tinubu announced that “Subsidy is gone”, pump prices of the Premium Motor Spirit (PMS) popularly known as petrol, have been hiked by over 100 percent across most petrol stations in Nigeria.\nThe new price of a litre of PMS in petrol stations in Benin City aligns with a document being circulated on social media which put the minimum price of a litre of PMS at N488 and the highest price at N557.\nWhile the authenticity of the document could not be verified as at the time of filing this report, The Nigerian Observer visited two petrol stations in Benin City-Buvel and NNPC.\nAt Buvel, a litre of petrol was sold for N511 while it was N520 at the NNPC station.\nThe unverified document stated that a litre of petrol is to be sold at N511 in Edo State starting from May 31, 2023."
        },
        {
            "url": "https://nigerianobservernews.com/2023/05/queues-return-to-lagos-abuja-after-tinubus-petrol-subsidy-removal-speech/",
            "summary": "Shortly after President Bola Tinubu announced the cancellation of petrol subsidy, queues for the product have resurfaced in parts of the country.\n“On fuel subsidy, unfortunately, the budget before I assumed office is that no provision is there for fuel subsidy.\nAt BlocOil filling station, Satellite Town, Lagos, customers were seen waiting their turn to buy the product.\nA resident who preferred anonymity told TheCable that most filling stations decided to stop selling when they were informed of Tinubu’s speech on petrol subsidy removal.\n“Some of the fuel stations only heard about the subsidy removal and just stopped selling,” the resident said."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/inter-state-transport-fares-spike-in-benin-city-on-subsidy-removal/",
            "summary": "Research team from the Nigerian Observer visited a number of transport companies in Benin City in the last few days, to evaluate the impact of fuel subsidy removal on transport fares, and in the process, interacted with passengers and managers of those transport firms.\nThe study was done through visitations to different motor parks in Benin City.\nThe places visited include Faith Motors, Big Joe Motors, Ameosa Motors, Peace Mass Transit, Osarodion Motors, God is Good Motors (GIGM), among others.\nOur company is not the only one affected.”We computed the increase in transport fares by routes and company wise.\nGod is Good Motors travels from Benin City to Lagos and has about a 25.3% increment in their transport fare."
        }
    ],
    "Bayelsa": [
        {
            "url": "https://nigerianobservernews.com/2023/07/fuel-subsidy-diri-unveils-106-vehicles/",
            "summary": "Governor of Bayelsa State, Senator Douye Diri, has unveiled a new transport scheme in a bid to alleviate the suffering of commuters in the state occasioned by the Federal Government’s removal of fuel subsidy.\nGovernor Diri, who inaugurated 100 cabs and six luxury buses at the DSP Alamieyeseigha Banquet Hall premises on Wednesday, said the initiative was his administration’s palliative to boost the transportation sector.\nThe governor in a statement by his Chief Press Secretary, Mr. Daniel Alabrah, acknowledged the hardship on Bayelsans due to the removal of the subsidy on petrol.\nGovernor Diri, who said his Prosperity Administration had completed and inaugurated the Bayelsa State Transport Terminal started by his predecessor, stressed that the launch of the transport scheme will make the terminal functional.\nHis words: “This is another historic day as we launch this fleet of transport vehicles to alleviate the suffering of our people."
        }
    ],
    "Ogun": [
        {
            "url": "https://nigerianobservernews.com/2023/06/tinubu-directs-nec-to-work-on-fuel-subsidy-palliatives/",
            "summary": "President Bola Tinubu has directed the National Economic Council (NEC) led by Vice President Kashim Shettima to device an approach and begin the process of working on interventions to mitigate the impact of subsidy removal on the Nigerians.\nGovernor of Ogun State, Dapo Abiodun, stated this after leading some major oil marketers on a courtesy visit to the president at the State House.\nThe group of marketers who visited the president on Wednesday, announced their intention to donate mass transport buses which sit between 50 and 100 passengers to help alleviate the pains of fuel subsidy removal on the masses.\nThis is expected to cost about a N100 million each and N10 billion cumulatively.\nThe marketers expressed the hope that other corporate bodies would emulate their action."
        }
    ],
    "Kwara": [
        {
            "url": "https://nigerianobservernews.com/2023/07/fuel-subsidy-kwara-gov-approves-multimillion-sectoral-palliatives-to-cushion-effects/",
            "summary": "Kwara State Governor AbdulRahman AbdulRazaq has approved a multibillion-naira palliatives to cushion the effects of recent removal of fuel subsidy, cutting across different sectors and demographics of the state.\nHe added that Abdulrazaq had also approved a new regime of allowances for nurses working for the state government.\n“The Governor has also endorsed immediate cash-backing of 2019 and 2020 promotion for Teaching Service Commission’s workers.\nThis is a policy response to the yearnings of SUBEB workers since 2016 when SUBEB workers no longer had steps.\nThis is to boost farming outputs and food security in the state."
        },
        {
            "url": "https://nigerianobservernews.com/2023/07/provide-palliatives-like-edo-and-kwara-falana-urges-state-govts-lgs/",
            "summary": "Local and state governments across Nigeria should emulate the Edo and Kwara state governments in taking urgent measures to alleviate the effects of fuel subsidy removal on their constituents, Femi Falana, a Senior Advocate of Nigeria (SAN) and rights activist has urged.\nHe cited the cases of Edo and Kwara states, where work days and school days, respectively, have been reduced from five to three days per week.\nState governments must intervene decisively.\nMeanwhile, the Edo State Governor, Godwin Obaseki, moved ahead of the pack in bringing relief to citizens.\nSo did his Kwara State counterpart, Abdulrahman Abdulrazak."
        }
    ],
    "Yobe": [
        {
            "url": "https://nigerianobservernews.com/2023/08/former-senate-president-to-distribute-9000-bags-of-grains-as-palliative-to-constituents/",
            "summary": "To cushion the effect of the fuel subsidy removal on his constituents, former Senate President Ahmad Lawan is set to distribute 9,000 bags of grains to his constituents.\nThe intervention will be undertaken by the Senator Ahmad Ibrahim Lawan (SAIL) Empowerment Foundation across the 60 wards in Yobe North Senatorial District.\nThe event, which is scheduled for Saturday, will take place at Filin Katuzu, Gashua, Bade Local Government Area of Yobe State.\nThe grains to be distributed include 6,000 bags of rice and 3,000 bags of millet.\nBeneficiaries are from the six local government areas of Yobe North Senatorial District – Bade, Nguru, Jakusko, Karasuwa, Yusufari and Machina."
        }
    ],
    "Federal Capital Territory": [
        {
            "url": "https://nigerianobservernews.com/2023/08/fg-approves-5bn-each-as-palliative-for-36-states-fct/",
            "summary": "The Federal Government has approved N5bn for each state and the Federal Capital Territory (FCT) to enable them to procure food items for distribution to the poor.\nBabagana Zulum, Governor of Borno State disclosed this at the Presidential Villa, Abuja, shortly after the National Economic Council (NEC) meeting.\nIn addition to the fund, Zulum said the Federal Government also released five trucks of rice each to the 36 state governors.\nAsides from the economic difficulties facing Nigeria in the wake of the subsidy removal, NEC also discussed security issues, especially recent attacks in the northern parts of the country.\nMembers of NEC have been deliberating on measures to cushion the impact of the subsidy removal."
        },
        {
            "url": "https://nigerianobservernews.com/2023/06/subsidy-fcta-to-begin-mass-development-of-bicycle-lanes/",
            "summary": "Federal Capital Territory Administration (FCTA) has said it will soon commence the recovery and construction of bicycle lanes in Abuja as a response to request by some residents of the city.\nFCTA Permanent Secretary Olusade Adesola made the disclosure at the flag-off of the 5th United Nations World Bicycle Day event organised by Ochenuel Mobility and its partners in Abuja, Nigeria.\nHe said this means that transport will become increasingly difficult, hence cycling will be a credible alternative.\nThe Indian High Commissioner to Nigeria, Shri Balasubramanian, while speaking at the event, appreciated Ochenuel Mobility and the Cycling Federation of Nigeria for sustaining the initiative of hosting this event which aligns with the high commission’s eco-friendly initiative.\nHe stated that the high commission has been part of the collaboration since the start of the World Bicycle Day in 2018 and will continue to do so."
        }
    ],
    "FCT": [
        {
            "url": "https://nigerianobservernews.com/2023/08/fg-approves-5bn-each-as-palliative-for-36-states-fct/",
            "summary": "The Federal Government has approved N5bn for each state and the Federal Capital Territory (FCT) to enable them to procure food items for distribution to the poor.\nBabagana Zulum, Governor of Borno State disclosed this at the Presidential Villa, Abuja, shortly after the National Economic Council (NEC) meeting.\nIn addition to the fund, Zulum said the Federal Government also released five trucks of rice each to the 36 state governors.\nAsides from the economic difficulties facing Nigeria in the wake of the subsidy removal, NEC also discussed security issues, especially recent attacks in the northern parts of the country.\nMembers of NEC have been deliberating on measures to cushion the impact of the subsidy removal."
        }
    ],
    "Ekiti": [
        {
            "url": "https://nigerianobservernews.com/2023/07/subsidy-removal-fg-ready-to-review-workers-salary-akpabi/",
            "summary": "President of the Senate, Godswill Akpabio, has assured Nigerian workers of the readiness of the Federal Government to review the salaries of its workers as a move towards cushioning the effect of the removal of fuel subsidy.\nAkpabio also noted that the removal of fuel subsidy by the President Bola Ahmed Tinubu-led administration was to address corruption in the Petroleum sector.\nHe said the removal of fuel subsidy was the beginning of fighting corruption in the system.\nWe will work with Ekiti State for the overall benefit of Nigerians,” he declared.\nSpeaking earlier, the Ekiti State Governor, Abiodun Oyebanji, commended the President of the Senate for his achievements in office in the period of one month going."
        }
    ],
    "Imo": [
        {
            "url": "https://nigerianobservernews.com/2023/07/senate-probes-subsidy-frowns-at-n9-3-trn-spent-in-30-months/",
            "summary": "…seeks ‘living wage’ for workers, 3 functional refineries for local productionThe Nigerian Senate Tuesday, decided to probe oil subsidy and under recovery regime operated by the federal government till May 29, 2023 when subsidy was eventually removed as it specifically frowned at N9.3 trillion expended on the subsidy regime by the federal government from January 2021 to June 2023.\nThese resolutions were sequel to a motion sponsored by Senator Chiwuba Ndubueze (APC Imo North).\nHe specifically submitted that while within 10 years (2006 – 2015), federal government through NNPCL, claimed N170 billion as under recovery, it expended whopping N843.121billion on under recovery between January 2018 and January 2019.\n“Very worrisome of the expenses made on subsidy/ under recovery by NNPCL during period under review, particularly from January 2021 to June 2023, was N9.3 trillion claimed to have been spent.\nThe Senate accordingly resolved that its standing committees on Petroleum (Downstream), Petroleum (Upstream) and Finance, should when constituted, carry out holistic investigation on all controversies surrounding subsidy and under recovery regime."
        }
    ],
    "Kano": [
        {
            "url": "https://nigerianobservernews.com/2023/07/fuel-subsidy-senate-appeals-to-nlc-to-avert-planned-strike/",
            "summary": "The Nigerian Senate has appealed to the Nigeria Labour Congress (NLC) to avert the strike it intends to embark on over the removal of fuel subsidy and continue negotiation with the Federal Government.\nThe motion titled “Urgent Need to Avert the Intending Strike of the Nigeria Labour Congress” was sponsored by Sen. Kawu Suleiman (NNPP Kano).\nHe said the strike threat by the NLC, if not averted, could plunge Nigeria into deeper economic woes, dislocate businesses, and cause hunger and frustration.\nHe said that the society always bears the brunt of strikes as an idle hand is the devil’s workshop.\nFollowing support of senators on the motion, the Senate mandated its leadership to interface between the NLC and the Federal Government to avert the impending strike of the NLC."
        }
    ]
}