[["https://newsdiaryonline.com/efcc-arraigns-two-fuel-subsidy-suspects-over-n963m-fraud/", "Counsel to the accused person, Wale Ilesanmi told the court that he had submitted an application for bail dated 30October, 2012.\nHe said the application was supported by a written address urging the court to grant the accused person bail on liberal terms.\nAlso, the accused person will henceforth be reporting at the end of every month at a stipulated date and time to the office of the EFCC.\nProsecution counsel, Mrs F. T Giwa prayed the count to give a trial date and remand the accused person in prison custody.\nShe also ordered that the accused person be remanded in prison custody."], ["https://newsdiaryonline.com/n1-1bn-scam-ajuyah-alaothree-others-forged-shore-certificate-for-subsidy-claims/", "EFCC’s witness in the case, Mohammed Ali Adedapo, told the court that the shore certificate did not originate from his company as alleged by the defendants.\nAccording to the witness, though his name and signature were contained in the shore certificate presented by the defendants, he neither issued the certificate nor appended his signature on it.\nThe shore certificate showed that 15, 000 metric tons of fuel were discharged instead of the 4,000 metric tons which Adedapo witnessed discharged.\nAdedapo also disowned an empty tank certificate showed to him in court saying that he never prepared an empty tank certificate or signed any as the tank was not empty to his knowledge.\nHe further said that some fuel was in the tank while on board “and an empty tank certificate cannot be issued except the tank is empty”."], ["https://newsdiaryonline.com/uganda-probes-un-relief-food-after-3-deaths-police/", "Uganda is investigating a supply of food from the World Food Programme (WFP) after three people died and more than 150 others became sick in recent days, police said.\nThe food was part of a community feeding programme in northeast Karamoja region, a semi-arid area where the UN food agency has long provided food aid for people facing poor harvests.\nPeople suffered diarrhoea, nose bleeds and other health problems after eating the food, police said in a statement.\nPolice are “actively investigating the death of three people…from eating adulterated or poisonous food supplied by the WFP,” according to the statement.\nThe food agency said on Saturday it had suspended distribution of Super Cereal – a fortified blended food – at all its operations in Uganda."], ["https://nigerianpilot.news/2023/06/07/subsidy-develop-functional-partnership-with-organise-labour-lukman-tells-tinubu/", "However, beyond the suspension of the planned strike action, APC and the government of President Tinubu must consider developing functional partnership with organise labour.\n“The partnership must be strategically to facilitate consultations between organised labour, APC as a party and the governments it controls both at federal and state levels.\nWhat exists today as Labour Party is a corrupt representation of the Labour Party envisioned by the NLC in 2002.\nThis is what produced Mr. Peter Obi as the Presidential candidate of the Labour Party in the 2023 elections.\n“Developing a functional partnership relationship with organised labour, and by extension other groups, require deeper political reforms in the country."], ["https://guardian.ng/apo-press-releases/tanzanias-victory-over-marburg-virus-a-breath-of-relief-and-a-path-of-hope/", "“We have officially ended Marburg Outbreak in Kagera Region.\nTherefore, Kagera is Marburg free, Tanzania is Marburg free.\n“Indeed, the swift and efficient response to the Marburg virus outbreak needs the utmost recognition.\nTanzania declared an end to the MVD outbreak, over two months after the first case was confirmed.\nSurvivor monitoring and support are currently ongoing in line with the National MVD Survivor Programme Guide developed during the outbreak."], ["https://www.naijanews.com/2023/07/16/palliative-of-n110bn-for-nass-members-is-illegal-outrageous-falana/", "Prominent human rights lawyer, Femi Falana, has described the decision of the National Assembly to allocate N110 billion as palliatives for its members as illegal and contemptuous.\nHe stressed that the judgments remain valid and binding, and the National Assembly’s actions are therefore illegal and contemptuous.\nThe senior lawyer, therefore, called on the leadership and members of the National Assembly to reverse the controversial allowances and the purchase of luxury vehicles.\nIn the event that these actions are not promptly rectified, Falana urged the RMAFC to take immediate measures to prevent further usurpation of its constitutional functions.\nHe warned that failure to do so would result in contempt proceedings against the Chairman of the RMAFC and the leaders of both chambers of the National Assembly."], ["https://guardian.ng/features/lemu-shares-n80m-zakat-proceeds-among-400-beneficiaries/", "“People are having more trust in the zakat committee.\nWe not only received zakat from Lekki Muslim residents but from Muslims residing elsewhere” .\nDr. Kamoru Omotosho, the immediate Past President of Lekki Muslim Ummah, LEMU, on his part, thanked the stakeholders for making the LEMU Zakat committee realize its dream.\nHe said, “I want to thank three categories of people here, first is the zakat committee and its chairman.\nMr. Mukhtar Abdullahi, one of the two beneficiaries of a tricycle (Keke) was full of praises for LEMU and the zakat donors."], ["https://guardian.ng/news/subsidy-kwara-approves-n10000-monthly-for-workers-other-palliatives/", "also approved palliatives worth billions of naira, across different sectors and demographics of the state.\nThe staggered work plan will not cover “essential workers”, the CPS clarified.\nAccording to Ajakaye, the governor has also endorsed immediate cash-backing of 2019 and 2020 promotion for Teaching Service Commission (TESCOM) workers.\n“The administration had earlier cash-backed arrears of TESCOM promotion for years 2015 to 2018.\n“In the same vein, he has approved cash-backing for 2021 promotion exercise of teaching and non-teaching staff of SUBEB and restoration of steps to all of them."], ["https://nigerianobservernews.com/2023/08/land-of-palliative-exploring-uncharted-lands/", ""], ["https://guardian.ng/apo-press-releases/president-el-sisi-speaks-with-emir-of-the-state-of-qatar/", "Download logoToday, President Abdel Fattah El-Sisi spoke by phone with the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al Thani.\nThe call touched on ways to strengthen, support and develop bilateral relations across various fields, in addition to reviewing the latest regional and international developments, especially in Sudan.\nThe Spokesman for the Presidency, Counselor Ahmed Fahmy, said the two leaders stressed the importance of intensive work to contain the humanitarian situation in Sudan, facilitate the flow of relief aid and spare civilians the repercussions of the fighting.\nIn this context, the two leaders agreed to launch a joint initiative to support and provide relief to the Sudanese people so as to alleviate the effects and repercussions of the current crisis on the Sudanese people, especially the refugees, by providing them with humanitarian and relief services, provided that the concerned authorities in the two countries develop frameworks and mechanisms for implementation.\nDistributed by APO Group on behalf of The Presidency, The Arab Republic of Egypt."], ["https://guardian.ng/apo-press-releases/namibia-presidents-emergency-plan-for-aids-relief-pepfar-invests-n840-million-in-new-united-states-agency-for-international-development-usaid-program-to-provide-health-services-to-vulne/", "Download logoThe U.S. President’s Emergency Plan for AIDS Relief (PEPFAR) will invest approximately N$840 million (US$45 million) in providing health and social services to vulnerable children, adolescents, and youth in Namibia.\nThis was announced by the PEPFAR Namibia Deputy Principal for USAID, Ms. Tamara Cox, who is currently visiting the Land of the Brave.\nThe five-year “Reach Namibia” program operates in eight regions where 80% of the population reside.\nThe Reach Namibia program will be managed by the United States Agency for International Development (USAID) and implemented by two local organizations: Project HOPE Namibia operating in Khomas, Oshana, Omusati, Ohangwena, Oshikoto and Zambezi regions, and Intrahealth Namibia operating in Kavango East and West.\nThe United States Government through USAID has been supporting Namibia since independence, specifically in the health, education, economic, energy and environment sectors."], ["https://newsdiaryonline.com/from-relief-to-resilience/", "To provide help that has lasting impact, we must expand our focus from relief to resilience — from responding after emergencies to preparing communities in advance and helping them prevail afterwards.\nAt a meeting in Nairobi, Kenya, in April, we committed to do just that by joining with African leaders and our international donor partners to create the Global Alliance for Action for Drought Resilience and Growth.\nThe alliance is working to ensure that resilience programming is a core component of dry-land programs in the Horn of Africa.\nUltimately, when we talk about resilience, we are talking about dignity.\nIf the international community focuses on resilience — not just relief — then we can do our part to support them."], ["https://guardian.ng/apo-press-releases/south-africa-member-of-executive-council-mec-tertuis-simmers-hands-over-rent-to-own-mill-park-development-to-first-time-homebuyers/", "Download logoOn Tuesday, first-time homebuyers at the Mill Park Development in Bredasdorp received their house keys.\nOfficiating the handover was the provincial MEC of Infrastructure, Tertuis Simmers, and the Cape Agulhas Executive Mayor, Paul Swart.\nIn attendance were beneficiaries of this pilot project who applied through the rent-to-own option.\nIn addition, the Mill Park project supports prospective but financially impaired home buyers by offering the Housing Consumer Education Programme.\nThe provincial MEC commended the innovative collaboration with the Cape Agulhas Municipality in implementing this pilot project."], ["https://newsdiaryonline.com/n5-8b-relief-materials-nema-rescued-chinese-rice-donation-say-port-terminal-operators/", "She however said the arrival of NEMA over the issue led to negotiations of N511,899m as the demurrage.\n“When the Committee inquire if the Federal Ministry of Agricultural and NEMA both paid for the demurrage.\n“NEMA paid for the demurrage but the receipt was issued to the consignee which is Ministry of Agriculture.\nThe total demurrage paid to our company was a little below N400m broken down into the bill of laden as N71.9m, N93.3m, N67.5, N100.097 and N57.026 totaling N389,781m.\nRepresented by Director Funds, Mohammed Usman, the AGF said, “N5.8b was released to five companies and N829m to NEMA for logistics."], ["https://newsdiaryonline.com/court-dismisses-certificate-forgery-charge-against-lawmaker/", "An Abuja Area Court in Karmo on Friday dismissed the case of certificate forgery filed against Rep. Ahmed Ndakene, representing Idu/Moro/Pategi Federal Constituency.\nNdakene was brought before the court in direct a criminal complaint on the alleged criminal breach of section 88(1), 89(3) and 109c of the Administrative Criminal Justice Act ( ACJA) 2015.\nThe nominal complainant, Mahmud Babako, a candidate of the Peoples Democratic Party ( PDP) in the election that Ndakene emerged as the winner, under the All Progressive Congress ( APC), alleged that he (Ndakene) forged his certificates.\nJibril held that the decision of the court was based on the police report earlier read by the court clerk.\nThe report concluded that WAEC issued a certificate after Ndakene claimed he lost his original statement of result in Aug. 21,2012 and was issued attestation of result with number: 00002218 by WAEC."], ["https://newsdiaryonline.com/hullabaloo-of-nigerias-democratic-transitions/", "I recall in our recent democratic journey a governor that had won a second term, after being sworn in, blamed his predecessor for huge debts and unpaid salaries…and more.\nTruth is that they do not know, or better still they know but cannot explain what these terms means.\nIt also is an indictment reflective of the faulty planning by those in charge, that’s if they plan at all.\nOver two dozen fuel price increases since 1978, five times it was reduced minimally but hiked back almost immediately.\nAll the best explanations of the government until it is seen to be done is more of hullabaloo."], ["https://www.naijanews.com/2023/08/26/house-of-rep-members-to-get-n150-million-each-for-constituency-projects/", "The leadership of the House of Representatives has set aside N150 million for each member to carry out projects in their constituencies, totalling N54 billion.\nThe lawmaker said the constituency allowances are part of the few privileges available to lawmakers to impact their various constituencies directly.\nHe said, “In the House of Reps, our constituency allowance is N150m.\nThis is the only opportunity we have to help our constituencies with one or more projects.\nMany of us often use our money to do all the projects that we do for our constituencies."], ["https://newsdiaryonline.com/fuel-subsidy-drop-worries-nigerians/", "Chibok girl’s Mother In Face-off with Buhari’s Aide As Police Stops Protest To Villa"], ["https://newsdiaryonline.com/subsidy-fraud-witness-reveals-eternal-oil-md-others-forged-30-documents-defraud-fg/", "In his ruling, Justice Oshodi had dismissed the application and upheld the argument of the prosecution.\nIn his response, the prosecution counsel, Rotimi Jacobs, SAN, however, submitted that he did not have to show the defence if he had the fiat of the AGF to prosecute them.\nJustice Oshodi upheld the argument of the prosecution counsel, thereby setting the stage for the prosecution witness, Bawa, to give his evidence against the accused.\nHe said: “The claimed MT Emirates has a bill of lading dated 28 April, 2011 which gave Eternal a loading cost of about N151.\n“The government, acting on forged importation documents indicating MT Emirates Star, paid Eternal about N3.3bn instead of N2.9bn."], ["https://www.naijanews.com/2023/08/04/fuel-subsidy-president-tinubus-aide-speaks-on-how-much-would-be-paid-as-minimum-wage/", "The media and publicity adviser to President Bola Tinubu, Ajuri Ngelale has assured workers of a significant salary increase with the implementation of the new minimum wage.\nDuring an interview on Channels TV’s Politics Today, Ngelale stated that workers should expect their current salaries to at least double once the new minimum wage comes into effect.\nI mean doubling of the current minimum wage.\n“As of June 36 states have received N300 billion more than they had received in any previous month in the last two years.\nStates have all agreed during the last NEC meeting that they would support the new minimum wage.”"], ["https://newsdiaryonline.com/efcc-docks-four-over-n1-05-billion-subsidy-fraud-arraigns-abraham-walson-over-n10m-employment-scam/", "Unnah ( Counsel for 1st and 3rd accused) and Ajibola Oluyede (Counsel for 2nd and 4th accused) prayed the court to grant the accused persons bail.\nProsecution counsel, Sylvanus Tahir did not oppose the application but urged the court to impose stringent conditions which will ensure that the accused persons are available for trial.\nJustice Banjoko granted bail to each of the accused in the sum of N10million and two sureties in like sum.\nIn addition, the accused persons must deposit their international passport and three passport photographs each with the court.\nB. Akinsola (Mrs.) urged the court to strike out the names of the second and third accused persons from the charge as they were unavailable in court."], ["https://newsdiaryonline.com/ksrelief-launches-together-for-education-in-yemen/", "By Abdallah el-Kurebe, EditorThe King Salman Humanitarian Aid and Relief Centre (KSrelief) in Saudi Arabia with the Coalition Forces supporting legitimacy in Yemen and the Saudi Ministry of Education on Sunday launched “Together for Education in Yemen” program to support education sector in Yemen.\n“This positive role contributed in facilitating the access of humanitarian aid into Yemen through land, sea and air, as well as ports of entry in Yemen.\nKSrelief has also implemented 330 projects in all regions of Yemen at a total cost of more than $2 billion.\nIn addition, education in Yemen received great attention from KSrelief, where many projects have already been implemented, with an amount of more than $65,291,000.\nThe Minister of Education of Yemen, Dr. Abdullah Lemmles praised the efforts of the Center in supporting the Yemeni people in various sectors, including the educational sector."], ["https://www.ripplesnigeria.com/fuel-subsidy-climate-change-the-future-of-electric-vehicles-in-the-mobility-industry/", "CNG-Powered Mobility vs. Electric Options: A Glimpse into the FutureThe remarks made by the VP shed light on the ongoing debate over the choice between CNG-powered vehicles and electric alternatives.\nIt is undeniable that electric vehicles represent a significant leap towards a sustainable and environmentally friendly future.\nReviewing the Mobility Industry: The Long-Term Triumph of Electric VehiclesIn the face of mounting environmental concerns and increasingly stringent emission regulations, the mobility industry is at a critical juncture.\nThe signs indicate that electric vehicles are destined to be the long-term winners in this race.\nAs a result, the electric vehicle ecosystem has become a dynamic and robust landscape, well-positioned to revolutionize the mobility industry."], ["https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/23/320.html", "The parents noted that life is being snuffed out of them as a result of such increases in almost all sectors such as fuel, electricity and now school fees.\nThe moment the government increases the fees payable in its schools, others will follow, the state governments and private school owners.\nWhat he needs to do is to encourage the modular refineries.\nHe should address that and set standards for those operating such modular refineries if he is not pleased with what they are doing now.\n\u0093While the modular refineries are working and meeting the people\u0092s needs in their own little ways, then the big ones like the Dangote Refinery can come on stream."], ["https://saharareporters.com/2023/08/02/distribute-n110billion-kept-lawmakers-exotic-cars-360-federal-constituencies-alleviate", "Human rights lawyer, Femi Falana, SAN, has stated that the N110billion being proposed for exotic cars and pallaitives for National Assemblies should be distributed to the country’s 360 federal constituencies.\n“Former Senate President, Dr. Ahmad Lawan defended the renovation fund, stating that the National Assembly building had not been renovated for 20 years.\nAccording to him, when the 9th National Assembly resumed, it was discovered that some parts of the property had become dilapidated.\n“We have confirmed that the N37 billion face-lift of the complex has not been completed.\n“Therefore, the total sum of N110 billion should be distributed to the 360 federal constituencies in the country."], ["https://newsdiaryonline.com/firs-decries-pioneer-tax-relief-racket/", "The Federal Inland Revenue Service (FIRS) has decried a systemic abuse of the pioneer incentive scheme instituted by the Federal Government, which has led to tax revenue leakages for the three tiers of government.\nConsequently, the FIRS vowed to plug this tax revenue leakage in order to generate more revenue for the three tiers of government.\nHe stated that this development has led to loss of considerable tax revenue to the three tiers of government.\nThe Executive Chairman emphasised the need to diversify the economy in order to create more sources of taxable income and increase tax revenue for the nation.\nMr. Olofu assured that the states were looking forward to working closely with FIRS in order to generate more tax revenue for the country."], ["https://newsdiaryonline.com/terrorism-nema-takes-relief-materials-chibok/", "The National Emergency Management Agency (NEMA) has again distributed relief materials in large quantities to members of the Chibok community traumatised by activities of terrorists rampaging most of the North East parts of the country.\nHe added that the Director General of the agency Mohammed Sani-sidi spearheaded distribution of relief materials to critical communities to motivate other emergency officers to render support in crisis zones.\nTo strengthen volunteerism in disaster management, NEMA has sustained the recruitment, training and utilization of the Executive Volunteers, NYSC Emergency Vanguard and Grass Roots Emergency Management Volunteer Corps (GEMVC).\nThe disaster management skills given to them is to enable them provide assistance at all phases of disaster management which include prevention, mitigation, preparedness, response and recovery.\nIt means that all that is required for the building to have fire safety devices are embedded."], ["https://guardian.ng/news/subsidy-pregnant-women-newborn-face-survival-threat-as-poverty-bites-in-northeast/", "Pregnant women who require a balanced diet for child brain development go to bed hungry.\nHealth experts believe that the first 1,000 days in the life of a child determine survival and brain development.\nHe added that a child who completes all immunisations and proper child care is likely to survive the first 1,000 days.\n“Window of greatest contact with the health system for women mothers, newborns and children.\nPeriod of greatest health risk and vulnerability for adverse health for women, mothers, newborns and children."], ["https://newsdiaryonline.com/implementing-the-recommendations-of-the-fuel-subsidy-probe-report-challenges-and-opportunities-by-mohammed-bougei-attah/", "Thus, the Report is an outcome of a review in a public procurement dealings covered under Section 55 of the Public Procurement Act.\nThe greater the perceived risk, the more oversight and independent project conformity assessment system would typically be.\nWhile the National Conformity Assessment Principles of some countries identify inspection as an activity which is distinct from other types of conformity assessment practices, most other activities involve inspection to some degree.\nThe relevant sections of the 2007 Public Procurement Act that deals with these issues are Sections 5 (p) of the Public Procurement Act 2007 in addition to Sections , 31, 5,53 38,53 and 54.\nThe Role of Federal High Court in the Resolution of Public Procurement Audit Disputes includes two major areas: Primary Jurisdiction on Criminal Public Procurement Offences and Appellate Jurisdiction on Civil Procurement Offences."], ["https://newsdiaryonline.com/n2-6bn-subsidy-scam-court-fines-adbulahi-alao-counsels-absence-court/", "Oluwatosin Dawodu who held brief for Osipitan, prayed the court to adjourn to a later date, explaining that Osipitan was absent because he had to attend a conference.\nBut the prosecuting counsel, Rotimi Oyedepo, immediately prayed the court not to grant the application.\n“This application is intended to put wool in the eye of my Lord, I therefore urge my Lord to use the sledge hammer of justice to prevent that from happening.\nAnd that the cost of transportation of the witness be taken over by the defence counsel,” he said.\nShare this:TweetPrintEmailTelegramWhatsApp"], ["https://nigerianobservernews.com/2023/09/red-cross-mobilises-relief-materials-to-libya-after-disastrous-flood/", "The International Committee of Red Cross (ICRC) has mobilised medicines, food items, body bags, first aid kits and other household items to Libya towards assisting thousands of families devastated by the flood that ravaged the country recently.\nIt should be recalled that this week, Storm Daneil hit Derna city in Libya resulting in devastating flood that left woes and anguish among the people of Libya.\nBefore the flood, the city was said to have about 125,000 inhabitants.\nAccording to Yann Fridez, the head of ICRC’s Libya delegation, “This disaster was violent and brutal.\nThe city faces immense emotional trauma,” adding that the team in Derna will support families with micro-economic activities."], ["https://nigerianpilot.news/2023/07/13/tinubus-palliative-of-n53-per-day-an-avenue-to-divert-public-funds-buy-votes-atikus/", "The Special Assistant on Public Communications to Atiku Abubakar, Mr. Phrank Shaibu, has described President Bola Tinubu’s plan to hand out N8,000 to 12 million households for six months as a brazen attempt to divert public funds.\nSo, with Tinubu’s uninspiring plan, each individual in a household will get N1,600 per month or N53 per day.\nThis must be a joke or a more sinister attempt to divert public funds.\n“The so-called palliatives that Tinubu seeks to share to the poor are just another avenue to divert public funds.\n“The scheme is nothing but a means to use public funds to prosecute political campaigns and objectives."], ["https://newsdiaryonline.com/okomu-oil-donate-relief-materials-to-victims-of-owan-fire-incident/", "Relief materials worth millions of naira have been donated to the victims of the November 18th 2022 fire disaster in Owan community, Ovia North East Local Government Area by the management of Okomu Oil Palm Company PLC.\nThe fire incident occurred when a tanker carrying petroleum product fell in the community and went into flame destroying shops and buildings.\nPresenting the relief materials to the Odionwere of the community, the Managing Director, Okomu Oil Palm Company PLC, Dr. Graham Hefer said the gesture was in fulfillment of management’s promise to come to the aid of the victims of the fire disaster.\nDuring our last visit in December, we promised to assist victims of the fire disaster and this is the fulfillment of that promise”.\nIt would be recalled that the fire incident which would have caused a major disaster in the community was averted by men of the Okomu Oil Palm Company PLC fire service unit."], ["https://nigerianobservernews.com/2023/07/conoil-reaps-n6bn-on-subsidy-removal-as-half-year-profit-rises-245/", "Revenue for the half-year period ended June 2023 rose by 54.9 percent to N87.14 billion in contrast with N56.24 billion as of June 2022.\nIn 2022, Conoil made N5.56 billion while in 2023, revenue from lubricants fell to N2.86 billion at half year 2023.\nLubricants’ market share fell to 3 percent at half year 2023 as against 10 percent as of June 2022.\nTotal liabilities rose to N50.01 billion at half year 2023 as against N40.89 billion at half year 2022.\nIn reflection of market realities, the retail price of petrol rose from an average of N250 per litre to N511."], ["https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/sep/2/8.html", "\u0093Upon that, schools have increased fees and the cost of books and everything about school has gone up.\nSome parents are thinking of changing their children\u0092s schools, to take them to where school fees are less, though the quality may not be too good.\nHe said: \u0093I was unable to pay school fees of my children last term.\nIn Abuja, 45-year-old mother of three, Roseline Agboola, said she was looking for about N500, 000 to pay school fees of three children.\n\u0093The proprietress of my children\u0092s school called to inform us that their school fees have been doubled."], ["https://newsdiaryonline.com/subsidy-debt-depot-owners-suspend-shutdown-operations-give-5-day-grace/", "The Depot and Petroleum Products Marketers Association (DAPPMA) has suspended its planned shutdown of depots across the country from loading petroleum products effective from 12-midnight on Sunday, Dec. 9.\nAdewole said: “Recalls the association had issued a shut down directive to our members following the continuing indebtedness of the Federal Government to the petroleum marketers.\n“DAPPMA depots are, therefore, advised to commence loading operations immediately and await further notification in respect of our long overdue payment,” he said.\nThe association explained that the decision of government to pay the N236 billion through promissory notes was equally rejected by the oil marketers.\nBased on this, when you approach the banks with the instrument, you don’t get the actual value on it."], ["https://newsdiaryonline.com/icpc-draws-up-guidelines-for-ptf-management-of-covid-19-relief-funds/", "Reconciliations of the accounts and books maintained shall be submitted to the Chairman, PTF monthly.\nThe guidelines also require all cash advances to be subject to the Financial Regulations (FR) and Public Service Rules (PSR).\nPetty cash advances may be made to an officer for petty cash transactions as approved by the Chairman, PTF.\nOfficials who receive such advances shall be personally accountable and financially liable for the custody and management of the advances.\nThe guidelines shall not apply to donations and receipts from the private sector unless they are given to the Task Force to manage."], ["https://newsdiaryonline.com/n1-9bn-oil-subsidy-fraud-wagbatsama-others-lose-bid-stop-trial/", "The accused persons had through their counsel, approached the court with an application seeking a stay of proceedings pending the Court of Appeal decision on their action challenging the ruling of the trial court, which had earlier rejected their no-case submission.\nProsecuting counsel, Rotimi Jacobs, SAN, had urged the court to throw out the application for stay as it negate the spirit of the provisions of sections 40 of the EFCC Act and 273 of the 1999 Constitution.\nIn her ruling, Justice Okunnu upheld the prosecution’s argument and struck out the application.\nJustice Okunnu adjourned the case to 24, 25 and 27 February, 2015 for continuation of trial.\nShare this:TweetPrintEmailTelegramWhatsApp"], ["https://newsdiaryonline.com/federal-high-court-orders-cbn-to-disclose-foreign-exchange-subsidy-information-in-response-to-request-from-heda/", "The court’s decision, based on suit number FHC/ABJ/CS/1622/2020, comes after the CBN denied HEDA Resource Centre’s Freedom of Information (FoI) request.\nUnfortunately, the CBN did not respond to the FoI request, prompting HEDA Resource Centre to pursue legal action to challenge the CBN’s denial.\nThe CBN later submitted a counter-affidavit on February 2, 2022, denying possession of the requested information.\nUpon examination, the court deemed these exhibits as substantial evidence supporting HEDA Resource Centre’s claim that the CBN had indeed been providing foreign exchange subsidies.\nConsequently, the court has issued a compelling order to the CBN, a public institution, to disclose the information requested by HEDA in their FoI request."], ["https://newsdiaryonline.com/fuel-subsidy-jokes-episode-four-occupy-nigeria-comedy/", "Chibok girl’s Mother In Face-off with Buhari’s Aide As Police Stops Protest To Villa"], ["https://saharareporters.com/2023/07/14/exclusive-senate-president-akpabio-others-pad-president-tinubus-palliative-budget-over", "Senate President Godswill Akpabio and some of his colleagues have used the amendment of the 2022 Supplementary Appropriation Act as an opportunity to pad the budget by over N200 billion.\nBudget padding is making the budget larger than the original estimates by inflating the value of items or introducing new items into the budget.\nThe N500 billion will be taken from the N819 billion Supplementary Appropriation Act.\n“Akpabio and Adeola Yayi inserted over N200 billion into Tinubu’s palliative budget.\nThey padded in more than N200 billion in the amended 2022 supplementary budget,” one of the sources in the Senate told SaharaReporters."], ["https://saharareporters.com/2023/06/05/what-exactly-wrong-our-own-subsidies-agba-jalingo", "The US still pay Export subsidies, Agriculture subsidies, Housing subsidies, Healthcare subsidies and Oil subsidies.\nThe Environmental and Energy Study Institute found that the US government alone spends $20 billion every year on direct fossil fuel subsidies.\n£2.4billion was spent on the Sustainable Farming Incentive, with £1.65billion in direct subsidies awarded to farmers in 2021/22.\nIn 2019, Germany alone spent approximately €5.4billion, on fossil fuel subsidies.\nAnd in 2021, EU member States, collectively spent approximately €4billion on fossil fuel subsidies and approximately €3.5billion on same in 2020."], ["https://newsdiaryonline.com/global-initiative-on-debt-relief-buhari-confers-with-pakistani-pm/", "President Muhammadu Buhari and the Prime Minister of the Islamic Republic of Pakistan, Mr Imran Khan, on Thursday had a phone conversation on the Global Initiative on Debt Relief canvassed by leaders of the Non-Aligned Movement Contact Group.\nThe leaders also believed that the debt relief would also help to address the unprecedented health and socioeconomic challenges facing most of the member countries of the Non-Aligned Movement Coontact Group.\nBuhari had on Monday in Abuja during a virtual Summit of Heads of State and Government of the Non-Aligned Movement (NAM), said national, regional and global strategies would be required to tackle the Coronavirus pandemic.\nHe urged international financial institutions to assist member states in cushioning the negative impact of the pandemic in the spirit of solidarity.\n“Within the spirit of South-South cooperation, we must also assist one another, particularly the less developed and less endowed member states with technical, medical and financial assistance."], ["https://guardian.ng/news/fuel-subsidy-no-plans-to-reduce-work-days-says-fg/", "Yemi-Esan said this on Tuesday in Abuja during a parley with media executives as part of activities marking the 2023 Civil Service Week.\n“We don’t have any plans to reduce working days for civil servants in view of the hike in PMS and cost of transportation.\n“The committee is currently working on getting gas-powered buses to convey civil servants to and fro.\nAlso, the minimum wage is also being reviewed.”She said the ongoing verification exercise for civil servants across the MDAs had captured 69,854 officers across the six geopolitical zones.\nAlso, she disclosed that the verification exercise had led to the detection of 1,618 fake or illegal employment letters and the subsequent suspension of the officers."], ["https://guardian.ng/apo-press-releases/united-states-u-s-global-aids-coordinator-ambassador-dr-john-nkengasong-visits-namibia-to-celebrate-20-years-of-presidents-emergency-plan-for-aids-relief-pepfar-globally/", "Download logoThe United States Global AIDS Coordinator, Ambassador Dr. John Nkengasong, visited Namibia from June 17 – 20 to celebrate 20 years of The United States President’s Emergency Plan for AIDS Relief (PEPFAR) and 18 years of saving lives in Namibia.\nAmbassador Nkengasong met with Deputy Prime Minister, Honorable Netumbo Nandi-Ndaitwah, where they discussed health financing, HIV programming, and sustainability.\nIn 2023, PEPFAR will provide US$88 million, which is over N$1.6 billion in funding to support the national HIV/TB response.\nAmbassador Nkengasong also engaged with Namibian Adolescent Treatment Supporters (NATS).\nThe Ambassador congratulated Namibia on its progress to end HIV as a public health threat by 2030."], ["https://nigerianobservernews.com/2023/02/relief-for-lp-others-as-court-bars-inec-from-using-mc-oluomo-for-electoral-items-distribution/", "The court also granted the plea by the applicants’ counsel for abridgement of time to hear the substantive suit because of the fast approaching elections and adjourned hearing to Wednesday, February 22.\nMC Oluomo is believed to be loyal to the presidential candidate of the ruling All Progressives Congress (APC), Asiwaju Bola Ahmed Tinubu.\nThe order of interlocutory injunction is hereby granted.”Thereafter, the applicants’ counsel pleaded for an abridgement of time to hear the substantive suit, which was also granted.\nINEC, the only defendant in the suit, was reportedly absent at the proceedings, though the applicants’ counsel told the court that the electoral commission was served with the court papers.\nJustice Aneke, in granting the application for abridgement of time, ordered that all the processes in the suit be served on INEC."], ["https://saharareporters.com/2023/06/12/fuel-subsidy-removal-has-imposed-extra-burden-nigerian-masses-president-tinubu-admits", "Tinubu stated this in his maiden Democracy Day speech, while hailing the winner of the June 12, 1993 presidential election, Chief MKO Abiola.\n“I admit that the decision will impose an extra burden on the masses of our people.\nPainfully, I have asked you, my compatriots, to sacrifice a little more for the survival of our country.\n“For your trust and belief in us, I assure you that your sacrifice shall not be in vain.\nHours after Tinubu’s announcement, the petrol pump prices skyrocketed from N195 to N537 nationwide, alongside an ancillary price increase."], ["https://guardian.ng/news/alake-says-media-not-seen-as-adversary-to-govt-calls-for-constructive-criticism/", "Alake, current Special Adviser to President Bola Tinubu on Special Duties, Communications and Strategy, made this known at a meeting with media executives on Friday in Abuja.\nThis said at the end of the day, both the media and government operate in the same society.\n“If we are practising adversary journalism and we create problems in our society, where are we going to practise,” Alake asked.\nAlake explained that government did not see the media as enemy because of its criticism, saying that criticism was part of democracy.\n“Criticism you must do because it is an integral part of democracy; however, what is obnoxious is destructive criticism, you have to engage in constructive criticism."], ["https://newsdiaryonline.com/apata-fire-victims-urge-makinde-to-investigate-disbursement-of-n10m-palliative/", "Seyi Makinde to investigate the disbursement of the N10 million palliative he donated to them.\nThe victims, armed with placards with various inscriptions, appealed to the governor to investigate the disbursement and retrieve the victims’ money from the imposter.\nThey appeal to the governor to investigate the disbursement of the money and retrieve the victims’ money from the imposters.\n“In the list, N500,000 was estimated as compensation for me, but after the list was doctored, I was given N60,000.\n“We appeal to the governor to investigate the disbursement of the money and retrieve the victims’ money from imposters,” Makinde said."], ["https://guardian.ng/news/chris-oyakhilome-foundation-revisits-turkey-earthquake-survivors-with-hope-relief-mission-2-0/", "The Chris Oyakhilome Foundation International (COFI) revisited the earthquake victims in the nation of Turkey in an intervention tagged, Hope Relief Mission 2.0.\nFounded by the Man of God Pastor Chris Oyakhilome in 2008, COFI’s mission is aimed at eradicating poverty, providing quality education, promoting economic growth, and responding to natural and man-made disasters.\nThank you for bringing healing through the Healing Streams to us.”The people in the city of Nurdagi were deeply moved as COFI volunteers showed them videos of the Healing Streams in Turkish.\nThe cry of the residents was “Pastor Chris please we need healing, please help us!” They were given relief materials and thanked Pastor Chris for praying for them.\nBut at this difficult moment, Pastor Chris Oyakhilome from Africa has remembered us; this makes us emotional."], ["https://www.naijanews.com/2023/07/21/proposed-n8000-palliative-would-be-a-waste-of-money-adebayo/", "He also assured that the Federal Government would transfer the sum of N8,000 monthly to 12 million poor and low-income households for six months.\nSpeaking with Arise News on Wednesday, Adebayo said the planned cash transfer by the government would amount to waste since the money would be valueless and would also lead to inflation.\n“It is not going to increase the value of real goods in the market.\nWhat it is going to do is that there would be wastage because the money will not be well used.\nWhen the money gets to the end users, it becomes useless to them in the real terms because they don’t have the goods to chase with the money."], ["https://nigerianobservernews.com/2023/05/high-court-orders-cbn-to-disclose-fx-subsidy-information/", "The court’s decision, based on suit number FHC/ABJ/CS/1622/2020, comes after the CBN denied HEDA Resource Centre’s Freedom of Information (FoI) request to disclose information on foreign exchange management.\nUnfortunately, the CBN did not respond to the FoI request, prompting HEDA Resource Centre to pursue legal action to challenge the CBN’s denial.\nThe CBN later submitted a counter-affidavit on February 2, 2022, denying possession of the requested information.\nConsequently, the court has issued a compelling order to the CBN, a public institution, to disclose the information requested by HEDA in their FoI request.\nThe court deemed the CBN’s failure to provide the information as unlawful, resulting in an order of mandamus to release the requested information outlined in HEDA’s FoI request dated October 14, 2020."], ["https://newsdiaryonline.com/fuel-subsidy-probe-report-must-not-be-treated-with-kid-gloves-csos/", "In a related development,they also called on South -South leaders who are meeting about now to take a position on this report as a matter of priority.\n“Perhaps, it is divinely planned that the SOUTH SOUTH governors will be holding the second regional economic summit here in Asaba starting today, 26th April, 2012.\nThe organizers and participants especially South South citizens must ensure that the report does not suffer the fate of other numerous reports.\nPerhaps, it is divinely planned that the SOUTH SOUTH governors will be holding the second regional economic summit here in Asaba starting today, 26th April, 2012.\nThe organizers and participants especially South South citizens must ensure that the report does not suffer the fate of other numerous reports."], ["https://nigerianobservernews.com/2023/07/shettima-36-govs-meet-over-subsidy-removal/", "The National Economic Council (NEC) meeting is in session at the Council Chambers of the State House in Abuja on Thursday.\nChairing the meeting is Vice President Kashim Shettima.\nHowever, following a series of criticisms from the Organised Labour, Tinubu ordered a review of the proposed palliative.\nAmong other issues, the review by the President should be top on the NEC meeting agenda on Thursday.\nIt is expected that resolutions from the meeting will be communicated to the press forthwith."], ["https://guardian.ng/news/edu-flags-off-distribution-of-relief-materials-to-900-idps-households/", "“The goal is to get everybody, wherever they are, out of poverty and humanitarian crises, this is the commitment of President Bola Ahmed Tinubu.\nDuring the exercise, Edu assured the other 480,000 unregistered IDPs at the camp that the federal government was not unmindful of their plight and humanitarian needs.\nShe said President Bola Tinubu’s ‘Renewed Hope’ agenda, geared towards eradicating poverty, will cover them directly working with the state government.\nShe adds that the social register, conditional cash transfer, and other social intervention programs of the federal government would be extended to them.\n“We appreciate your coming, Honourable Minister; the distribution of these nonfood items will go a long way to cushion the suffering of these IDPs."], ["https://newsdiaryonline.com/warring-communities-aibom-govt-donates-relief-materials-worth-millions/", "The State Deputy Governor, Mr Moses Ekpo, made the call at Okobo during the distribution of the relief materials on Friday.\nHe warned that the State Government would no more send relief materials to any community which engages in man-made disaster.\nHe commended the state government for the prompt intervention and response with the relief materials.\nHe disclosed that already a traditional injunction has been placed on the disputed land and thanked the government for the relief materials.\nFrank thanked the state government for the donation of relief materials to cushion the effects of the crisis."], ["https://newsdiaryonline.com/n1-5bn-subsidy-scam-efcc-re-arraigns-anosike-four-others/", "The re-arraignment of the five defendants followed the elevation of Justice Habeeb Abiru, the first trial judge to the Court of Appeal.\nThe case was re-assigned to Justice Onigbanjo before whom the defendants took fresh pleas.\nEFCC Counsel, Rotimi Jacobs, SAN, did not object to the prayers of Nwobike but sued for an early trial date.\nJustice Onigbanjo granted the prayers of Nwobike and admitted the defendants to bail on the previous terms.\nHe adjourned the case till July 3 and 4, 2013 for commencement of trial."], ["https://newsdiaryonline.com/alleged-palliative-diversion-dont-compromise-nasarawa-speaker-tasks-committee/", "The speaker urged the committee to do a thorough investigation to unravel the alleged diversion of the palliatives meant for the poor of the poorest in the state.\nMusa Ibrahim Abubakar, raised this matter on the alleged diversion of palliatives meant for the poor by those involved in the distribution.\n“The purpose of this committee is to unravel alleged diversion of palliatives by those involved in the distribution,” he said.\n“I want to promise Mr Speaker and Hon.\nBala however called on members of the public to avail the committee with more useful information on the alleged diversion of palliatives in their areas."], ["https://nigerianobservernews.com/2023/06/fuel-subsidy-removal-edo-govt-empathizes-with-citizens/", ""], ["https://saharareporters.com/2023/08/02/breaking-protesters-pull-down-national-assembly-gate-abuja-force-their-way-premises", "Members of the organised labour who are currently protesting in Abuja have forcefully pulled down the main gate of National Assembly to gain entry into the complex.\nArmed policemen stationed at the entrance had locked the gate to prevent the protesters from gaining access into the building.\nBut after an altercation between the protesters and security agents, the protesters pulled down the main gate of the complex.\nThe protesters are currently heading to the second gate of the building and have vowed to also pull it down.\nFrom Unity Fountain, the protesters headed to the National Assembly gate."], ["https://saharareporters.com/2023/08/21/heda-wants-efcc-other-anti-corruption-bodies-monitor-how-nigerian-states-utilise", "The Human and Environmental Development Agenda (HEDA) has called for transparent implementation strategies and monitoring of the palliatives approved by President Bola Tinubu administration to be provided to citizens through state governments.\nAlso, state governors are to procure 100,000 bags of rice, 40,000 bags of maize, and fertilizers.\nIt was learnt that 52 per cent of the funds were given to the state governments as grants with 48 per cent as loans.\nHowever, HEDA in a statement stressed the importance of transparent implementation frameworks and robust strategies to ensure accountability and effective utilization of these funds.\nHEDA’s Chairman, Olanrewaju Suraju urged all state governments to put forth detailed implementation strategies that demonstrate their commitment to the responsible allocation of resources."], ["https://newsdiaryonline.com/biden-administration-releases-billions-in-relief-for-puerto-rico/", "Puerto Rico would receive more than eight billion dollars in Hurricane Maria recovery money withheld during former President Donald Trump’s tenure.\n“Without a doubt, this is great news for PR (Puerto Rico),” said Pierluisi on Twitter.\nThe Coronavirus, which had killed more than 2,000 people in Puerto Rico, soon followed.\nThe former president called Puerto Rico “one of the most corrupt places on earth,” and his administration established strict safeguards on disaster money.\nSince taken office, the Biden administration has been working to reverse the Trump-era policies, cutting red tape in the way Puerto Rico accesses relief aid."], ["https://newsdiaryonline.com/catholic-bishop-donates-relief-materials-to-4-idps-camps-in-jalingo/", "The Catholic Bishop of Jalingo Diocese, Most Rev.\nCharles Hammawa, on Wednesday donated relief materials to Internally Displaced Persons’ (IDPs’) camps in Kona, Mayo-Dassa, Nukkai, and ATC in Jalingo.\nHammawa told the IDPs not to lose hope in the country and in God, saying that the diocese shared in their plight.\nMr Bala Simon, one of the IDPs, expressed appreciation to the bishop and the Catholic Church for identifying with them in their most difficult moment.\nSimon appealed to the government and its security agencies to end the crisis to enable them to leave the camps and return to their ancestral homes."], ["https://nigerianpilot.news/2023/02/16/chinese-scientists-generate-turkish-earthquake-relief-analysis-for-un/", "/CFPThe United Nations Satellite Centre (UNOSAT) has activated its emergency mapping service in quake-hit areas in Türkiye to aid relief efforts.\nIn fact, this did not take into account the different disaster resistance capabilities of different areas,” said Li.\n/ChangjiangyunGenerating data via satellitesLi’s team analyzed satellite data, which is updated every day, combining macro and micro observations.\n“The data may help policymakers analyze the disaster situations in different areas and allocate relief resources better,” Li said.\nSince 2012, Li’s team has been engaged in the research field of luminous remote sensing, assessing impact of humanitarian disasters with related data."], ["https://www.naijanews.com/2023/08/19/nlcs-calculation-has-shown-n5-billion-palliative-is-1500-per-person-bwala/", "The NLC President, Joe Ajaero, said the Federal Government was about sharing N2,000 and a cup of rice with poor people across the country.\nEven if you pick them from the poverty bracket, it will be difficult for them to get one cup of rice.\nSo do we look at our people as people we should give one cup of rice and N2,000?\nIs that palliative?”Reacting to the NLC’s stance via a Twitter post, Bwala stated that organised labour had demystified the N5bn palliative.\nOrganize labour further did their arithmetical calculations and arrived at a shameful conclusion that the so-called 5 billion naira comes down to 1500 per person."], ["https://guardian.ng/news/why-buhari-backs-fuel-subsidy-removal-after-leaving-office-garba-shehu/", "Former President Muhammadu Buhari has backed the decision of the current administration to remove fuel subsidies, saying he had hoped that it would reduce the large number of people coming to see him in Daura.\nBuhari’s spokesperson, Garba Shehu, disclosed this in a statement issued on Thursday to mark Buhari’s 100 days out of office.\nTo manage the numbers, he has a weekly programme drawn for him, as they did while he was in the Villa,” Shehu stated.\nShehu stated that the administration achieved self-sufficiency in rice and financed millions of small farmers of 23 different commodities, an effort that helped boost the export of agricultural commodities.\nHe added that the COVID-19 pandemic was brought under control due to the relentless leadership of President Buhari, noting that the country was among the few that came out with strong economic activity after the pandemic."], ["https://guardian.ng/news/relief-and-sympathy-as-rebels-stand-down-in-russian-city/", "Fighters from the Wagner mercenary group with silver armbands and carrying assault rifles had deployed a day earlier across Rostov-on-Don in tanks and armoured cars.\n“When something routine in your city changes and you don’t really understand what’s going on, you feel very anxious and unsafe.\n– ‘I understand them’ –Residents who had heeded a request by local government to remain in their homes on Saturday were enjoying the sunshine.\n“I understand them a bit,” he said, adding however that they should have sorted out their disagreements with Russia’s military leaders differently.\nOver the course of the Ukraine campaign, Prigozhin has complained about Russia’s military leaders in increasingly strident terms, accusing them of inaction, inefficiency and failing to provide his forces with sufficient ammunition."], ["https://newsdiaryonline.com/subsidy-scam-court-jails-rowaye-company-104-years/", "Rowaye and Brilla Energy Limited were arraigned alongside Saminu Rabiu and his company, Alminnur Resources Limited, on October 17, 2012 on a 17-count charge of conspiracy and fraud.\nThe other three (Rowaye, Brilla and Alminnur) were subsequently re-arraigned on February 12, 2016.\nAfter diligent prosecution of the case by counsel to EFCC, Sylvanus Tahir, Justice Banjoko convicted and sentenced Rowaye on 14 out of 17 counts preferred against him by EFCC.\nOn Counts 1 and 2, Rowaye and the two oil companies (Brilla and Alminnur) were sentenced to 10 years imprisonment each without option of fine.\nThe court, however, discharged Rowaye, Alminnur and Brilla on counts 12, 13 and 14."], ["https://guardian.ng/news/temporary-relief-as-tinubu-defers-suspends-buharis-11th-hour-tax-drive/", "To this end, he said President Tinubu has signed four Executive Orders.\nAccording to the presidential spokesman, this is to ensure adherence to the 90 days minimum advance notice for tax changes as specified in the 2017 National Tax Policy.\nThe last Executive Order also suspended the newly introduced Green Tax by way of Excise Tax on Single Use Plastics, including plastic containers and bottles.\nHe also noted that the Excise Tax increases on tobacco products and alcoholic beverages from 2022 to 2024, which had already been approved, are also being implemented.\nPresident Tinubu’s executive orders were designed to find a balance between tax reforms and the concerns raised by businesses and stakeholders."], ["https://newsdiaryonline.com/trump-makes-u-turn-signs-900bn-covid-19-relief-package/", "U.S. President Donald Trump on Sunday night said he had signed the $900 billion (N349.2 trillion) coronavirus relief package.\nIn a statement, Trump called on Congress to make more amendments to reduce excess spending and expunge the “wasteful items”.\nA key item in the bill is $600 stimulus cheque for American workers earning less than $75,000 per annum.\nIn a video message on Wednesday, Trump said the bill was called coronavirus relief package, yet there was “almost nothing about COVID-19 in it’’.\n“In spite of all these wasteful spendings, and much more, the $900 billion packages provide hard-working taxpayers with only $600 each in relief package."], ["https://guardian.ng/news/as-new-academic-session-begins-we-can-no-longer-pay-school-fees-parents-cry-out/", "“Upon that, schools have increased fees and the cost of books and everything about school has gone up.\nSome parents are thinking of changing their children’s schools, to take them to where school fees are less, though the quality may not be too good.\nHe said: “I was unable to pay school fees of my children last term.\nIn Abuja, 45-year-old mother of three, Roseline Agboola, said she was looking for about N500, 000 to pay school fees of three children.\n“The proprietress of my children’s school called to inform us that their school fees have been doubled."], ["https://newsdiaryonline.com/club-donates-food-items-relief-materials-to-old-peoples-home-others/", "The Ivory League of Progress, a socio-philanthropic club, has donated food items and other relief materials to some motherless homes, to cushion the effect of hardships being experienced during the coronavirus pandemic lockdown.\nThe beneficiaries include: Old Peoples Care Home, Yaba Modupe Cole Memorial Child Care & Treatment Home School Akoka and Women & Children with Disabilities Initiative Home.\nAt the Old People Care Home, the club’s representatives, led by President, Mr. Tunde Thani, the items were received by Matron, Mrs Caroline Inegbedion.\nMatron of Modupe Cole Memorial Child Care & Treatment Home School, Mrs S. A. Rabiu, who received the club also thanked the members for bringing joy to the home during the lockdown and for meeting their basic needs.\nMr. Thani said the gesture was made possible through the contributions and commitment of members of the club."], ["https://www.naijanews.com/2023/06/22/fuel-subsidy-organized-labour-to-meet-tinubu-govt-on-monday/", "The organized Labour will again meet with the representative of the Bola Tinubu-led Federal Government at the Presidential Villa, Abuja on Monday, June 26.\nEtim added that organised labour will send a list of its members who will form part of the subcommittees of the main steering committee.\nDuring our last meeting, the special adviser to the president on energy unveiled a roadmap but the terms of reference were not unveiled.\nSo labour asked that it be shared so that we can also put in our inputs.\nWe will also send a list of our members who will form part of the subcommittees of the main steering committee.”"], ["https://newsdiaryonline.com/subsidy-removalcoeasu-directs-members-to-work-2-days-in-a-week/", "while our capabilities to sustain hope were already exhausted, the price of petrol rose further to N650 per litre.\nOlugbeko explained that it became inevitable for the union to direct members to go to work only two days weekly.\nHe added that an emergency NEC meeting would be convened to ratify the decision to decide the specific days of the week members were to go to work.\n”This means we have been on same salary since 2010 while petrol price rose intermittently from N65/N70 in 2010 to N650 in 2023 (tenfold increase).\nThe national president, however, called on President Bola Tinubu to quickly address the issue of salary adjustment for staff of colleges of education."], ["https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/31/25.html", "After being inaugurated on May 29, 2023, President Bola Ahmed Tinubu has finally moved into the presidential residence in Aso Rock in Abuja.\nNaija News reports that the official residence has been under renovation since April which led to the president operating from his private residence in Asokoro since his inauguration.\nRecall that before President Muhammadu Buhari left office, he and his family moved to the Glass House, usually a transit accommodation, following the renovation of the main residence.\nBut according to TheCable, President Tinubu moved to the Glass House on Sunday night pending the completion of the renovation of the president\u0092s official residence in August."], ["https://www.naijanews.com/2023/06/19/7-5-vat-on-fuel-prices-nigerians-lament-tinubu-govt-policies-ask-for-review/", "There should not be VAT on pms, but states should be allowed to tax pms consumption within their boundaries.\nYou will soon understand why@officialABAT and overtaxing are inseparable sesame twins.\nSo, 7.5% VAT has been implemented with immediate effect!!\nNow, there is a recent addition of 7.5% Vat on petrol prices.\n@aai_austin – “The supposed 7.5% VAT on petrol shouldn’t be a problem for anyone who voted the APC”."], ["https://newsdiaryonline.com/flood-victims-to-get-respite-soon-matawalle/", "Matawalle assured that relief materials will soon be provided to all the affected communities as soon as government receives the report of the damage caused by the disaster so as to reduce the sufferings experienced by the victims.\nThe Governor, who sympathized with the victims said that he was shocked and devastated when he got the sad news and prayed Almighty Allah to avert the recurrence of the disaster in the future.\nHe also called on the people of the state to ensure total clearing of all waterways in order to avert flood during rainy season.\nHe added that, the clearing will make the environment more hygienic and accessible to all inhabitants.\nShare this:TweetPrintEmailTelegramWhatsApp"], ["https://newsdiaryonline.com/african-development-bank-group-approves-debt-relief-for-chad/", "This follows a joint assessment of the country in April 2015 by the IMF and World Bank as having attained the HIPC ‘Completion Point’.\nIn reaching the Completion Point, Chad also fulfilled the requirements to benefit from additional debt relief under the Multilateral Debt Relief Initiative (MDRI) from the African Development Fund, the International Development Association (IDA) and the European Union.\nThe full implementation of the HIPC initiative will have a positive impact on Chad’s debt sustainability and improve its economic outlook.\nUnder the MDRI, three multilateral institutions – the World Bank’s IDA, the IMF, and the African Development Fund – provide 100 percent debt relief on eligible debts to countries having reached the HIPC completion point.\nAs at end June 2015, 30 RMCs (out of 33) eligible for HIPC/MDRI debt relief assistance reaching the completion point, and therefore qualifying for irrevocable debt relief."], ["https://guardian.ng/opinion/pia-another-tough-decision-president-tinubu-must-consider/", "Unveil the Petroleum Industry Act (PIA)This is the time for the President to unveil the Petroleum Industry Act 2021, the law signed by Buhari to reform oil and gas.\nNow that it is passed, what’s delaying President Tinubu from implementing the law in its entirety?\nThe PIA does not recognise the balkanization of the Petroleum Resources Ministry among political officers.\nPresident Obasanjo and Buhari acted in the capacity of ministers of Petroleum Resources outside the PIA.\nOne other reason the Minister of Petroleum Resources should not operate in the shadows is because of the sensitive powers he wields."], ["https://newsdiaryonline.com/buhari-seeks-debt-relief-for-african-countries-says-ppp-will-reduce-corruption-speed-growth/", "This was disclosed in a statement by Garba Shehu, Senior Special Assistant to the President (Media & Publicity).\nThis financial support should also be extended to the private sector,” he said.\nAccording to him, many African countries were already experiencing debt distress and the Debt Service Suspension by France and G-20 does not go far enough, adding that there was need for more sustainable and affordable financing solutions, including debt relief and further debt restructuring.\nOn the Paris Agreement for Climate Change, President Buhari noted that African countries would need financial support for green energy investment and COP-26.\n“The government intends to leverage on Public Private Partnership to bolster its job creation, and anti-corruption drive."], ["https://guardian.ng/apo-press-releases/united-arab-emirates-uae-continues-to-provide-humanitarian-relief-to-sudanese-refugees-and-local-community-in-chad/", "Download logoThe United Arab Emirates is continuing its efforts to distribute food parcels to Sudanese refugees and the local community in the Republic of Chad.\nThe office is working on distributing food parcels and conducting field assessments of basic needs.\nHE Al Shamsi added that the UAE’s humanitarian team has also facilitated medical support through mobile clinics by conducting health examinations for many residents in the two regions and by providing essential medication.\nIn this regard, the UAE is committed to addressing the humanitarian requirements of those in need, reducing poverty, and eliminating hunger.\nDistributed by APO Group on behalf of United Arab Emirates Ministry of Foreign Affairs & International Cooperation."], ["https://guardian.ng/apo-press-releases/morocco-earthquake-the-international-federation-of-red-cross-and-red-crescent-societies-ifrc-launches-chf-100-million-emergency-appeal-to-scale-up-relief-efforts/", "Download logoThe International Federation of Red Cross and Red Crescent Societies (IFRC) has launched an emergency appeal for 100 million Swiss Francs to further scale up relief efforts of the Moroccan Red Crescent.\nMore than three days after the earthquake hit Morocco, aid is reaching more remote locations, but conditions are challenging.\nSince the disaster hit on Friday night, Moroccan Red Crescent teams have been working with Moroccan authorities.\nThe emergency appeal we launch today will support the Moroccan Red Crescent work on both the most pressing needs and the medium-term temporary solutions.\nSuch a vast-scale earthquake needs long-lasting and sustainable support.”Distributed by APO Group on behalf of International Federation of Red Cross and Red Crescent Societies (IFRC)."], ["https://newsdiaryonline.com/fuel-subsidy-fraud-mahmud-tukur-mamman-nasir-ali-others-get-n20-million-bail-each-as-trial-of-suspects-begins/", "His counsel, Babajide Koku, SAN, informed the court that he had filed an application for bail in respect of his client.\nHowever Justice Onigbanjo admitted the other seven accused persons that appeared before him in separate arraignments to bail.\nHe said the court had the right to grant bail to the accused persons and that they will make themselves available for trial.\nThe accused persons are to deposit their international passport with the EFCC while the registrar is to verify all sureties.\nWole Olanipekun, SAN, counsel to three of the accused persons said he had filed bail application and served the prosecution."], ["https://newsdiaryonline.com/nema-distributes-relief-materials-to-flood-victims-in-kebbi/", "He said the items distributed he said are: 349 bags of beans, 349 bags each of rice and guinea corn, 36 kegs of vegetable oil, 58 cartons of seasoning, 29 cartons of tin tomatoes and 18 bags of salt.\nOthers, he said, are 698 pieces each of mattresses, blankets, mosquito nets and wax prints, 600 bags of cement, 600 bundles of roofing sheets, 70 bags of nails and 140 packets of zinc nails."], ["https://guardian.ng/ama-press-releases/somalias-institutions-get-a-boost-to-help-bring-the-country-closer-to-debt-relief/", "“This DPF supports the government’s aspirations to build the foundations of a modern economy with strengthened institutions.\nAlongside efforts to implement institutional reforms, Somalia has signed debt relief agreements with major creditors and is holding discussions with some remaining bilateral and multilateral creditors.\nResources from the DPF will help the government to ensure that essential public expenditures can be paid.\nOver time, institution-building and sustained economic growth can help Somalia to build buffers to shocks and strengthen resilience.\nDistributed by African Media Agency (AMA) on behalf of The World BankThe post Somalia’s Institutions get a Boost to Help Bring the Country Closer to Debt Relief appeared first on African Media Agency."], ["https://newsdiaryonline.com/heda-urges-transparent-implementation-of-n5bn-palliatives-to-states/", "By Fabian EkerucheThe Human and Environmental Development Agenda (HEDA Resource Center) has called for transparency and accountability in the distribution and utilisation of the five billion Naira palliatives doled out to states by the Federal Government.\nThis is contained in a statement on Sunday by the Chairman of HEDA, Mr Olanrewaju Suraju.\nThe chairman urged all states government to put forth detailed implementation strategies that demonstrate their commitment to the responsible allocation of resources.\nHEDA also urged President Bola Tinubu to take proactive measures toward ensuring the effectiveness and transparency of the financial support initiative from the administrators of the fund.\n“This approach will undoubtedly enhance accountability, curb corruption, and enhance the overall impact of the support initiative."], ["https://guardian.ng/politics/subsidy-removal-anxiety-persists-over-planned-palliatives-as-poverty-spreads/", "In time past, palliatives included purchasing of mass transit buses, increments in the minimum wage, social investments and empowerment schemes for unemployed persons.\nWe need solidarity across the trade union movement and we need to continue the strikes until the government implements its agreements.\nDeputy General Secretary of the African Regional Organisation of the International Trade Union Confederation (ITUC-Africa), Akhator Joel Odigie, agrees that a good set of palliatives is desirable at this point.\nAccordingly, he rated increase in minimum wage highly; noting that payment of living wages helps fight poverty and inequality.\nMinimum wage is an anchor to prevent wages from falling to unacceptable levels,” he added."], ["https://newsdiaryonline.com/tinubus-seven-wonders-in-seven-weeks/", "In the seven weeks he has been on the saddle at the Presidential Villa, President Tinubu has made those who stuck out their necks for him proud.\nFor my friend and many others, there are myriad of things that President Tinubu has done or traits he has exhibited in the past seven weeks that they never thought he could do.\nDECISIVENESS: In the weeks since coming on board, President Tinubu has demonstrated that important attribute of a leader: Decisiveness.\nLike all great leaders in history, President Tinubu has demonstrated that he is no fence-sitter in the business of governance.\nBRILLIANT OFF-THE-CUFF SPEECHES: President Tinubu has been regailing his audience with off-the-cuff straight-from-the-heart speeches."], ["https://guardian.ng/politics/president-bola-tinubu-100-days-and-leadership-as-marathon/", "This illustration is vital especially at a time like this when a section of the public – buoyed by the media’s near canonisation of a borrowed American concept of “100 days in office” – seems to be in a frenzy to judge 1,460-day tenure by the first 100 days.\nFor President Tinubu, the best measure of successful leadership is the quantum of qualitative actions and decisions not quantitative.\nIn the last 100 days, President Tinubu has demonstrated that he is made of the finest stuffs as a leader, looking at these parameters.\nIt is also around them that he has devoted most of his energy and attention in the last 100 days.\nThese are not things that can be done in 100 days but the steps to attain them are firmly on course."], ["https://saharareporters.com/2023/06/05/subsidy-removal-fuel-retailers-and-supplier-ardova-plc-loggerheads-over-4-week-delay", "Fuel retailers under Ardova PLC have protested against an alleged unfair and unjust treatment by the management of the indigenous energy group.\nHe said that the complaints made by the retailers under Ardova should not be taken seriously because they understand the practice in the industry.\nThere is another type whereby dealers own the stations, run the stations but they buy the product from us.\n“There is no product and when NNPC gets the product, they supply to their stations first, and NNPC has a thousand stations.\n“We have offered dealers in the queue who were next in the queue a discount as goodwill."], ["https://guardian.ng/news/people-fleeing-the-ongoing-fighting-in-sudan-arrive-in-eastern-chads-border-with-sudan/", ".Nearly 3m displaced by Sudan conflictNearly three million people have been displaced internally and across borders by the conflict in Sudan, in less than three months.\nFood, access to health services and essential relief items remain critically lacking.\nMixed movements have been observed across the border into Egypt (40 per cent), Chad (28 per cent), South Sudan (21 per cent), Ethiopia and the Central African Republic.\nUnder the Sudan Crisis and Neighbouring Countries Response, operations have scaled up across Sudan, Chad, South Sudan, Ethiopia, Egypt, Libya and the Central African Republic.\nIn Sudan, a large number of containers with relief items have arrived in Port Sudan, to be distributed through partners and the common Humanitarian pipeline."], ["https://saharareporters.com/2023/07/13/tinubu-seeks-senate-approval-800million-world-bank-loan-earlier-requested-buhari-says-12", "President Bola Tinubu has written to the Senate to seek approval for $800 million loan to finance the National Social Safety Network Programme.\nThe request was contained in a letter read by Senate President Godswill Akpabio on the floor of the Senate on Thursday.\nSaharaReporters had reported that former President Muhammadu Buhari had sought the approval of the 9th Senate in May to borrow the fund from the World Bank.\nBut Tinubu in his letter read during plenary on Thursday, urged the lawmakers to consider the loan request.\nI expect that the House will speedily consider the request,” Tinubu's letter read in part."], ["https://newsdiaryonline.com/4765-trucks-carrying-relief-supplies-to-ethiopias-tigray-since-april-unhcr/", "by Emmanuel YashimThe United Nations High Commissioner for Refugees (UNHCR) has said that a total of 4,765 trucks carrying relief supplies have entered Ethiopia’s conflict-hit Tigray region since April.\nThe UNHCR, in its latest Ethiopia emergency situation update posted Wednesday, said that since the resumption of humanitarian convoys into the Tigray region in April, 4,765 trucks carrying relief supplies have entered the region, including more than 60 trucks from UNHCR.\nIt warned that the shortage of fuel remains a critical bottleneck to sustaining relief operations in Tigray, hindering the onward distribution of relief supplies from Mekelle, the regional capital of Tigray, to other areas.\nThe UN refugee agency said the humanitarian situation across northern Ethiopia continues to seriously impact refugees, the internally displaced and host communities.\nThe UNHCR further said it has continued to reach out to Eritrean refugees and provide cash support to the most vulnerable across Ethiopia’s Tigray region."], ["https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/aug/26/12.html", "The leadership of the House of Representatives has set aside N150 million for each member to carry out projects in their constituencies, totalling N54 billion.\nNaija News reports that a member of the Green Chamber, who pleaded for anonymity, made this known during an interview with The Punch on Friday.\nThe lawmaker said the constituency allowances are part of the few privileges available to lawmakers to impact their various constituencies directly.\nHe said, \u0093In the House of Reps, our constituency allowance is N150m.\nThis is the only opportunity we have to help our constituencies with one or more projects."], ["https://guardian.ng/interview/menstrual-items-should-be-part-of-palliative-packs-during-conflicts/", "Treasure in this interview ahead of the World Menstrual Hygiene Day said menstrual items should be part of relief materials and palliative packs during conflicts and crisis.\nI realised that period poverty is pervasive, that we need people to recognise that menstrual items should be part of relief materials and palliative packs during conflicts and crisis.\nOur pad boxes contain a pack of menstrual pads, soap, underpants, panty liners, and sachets of beverages.\nBesides World Menstrual Hygiene Day, June 1 is World Milk Day; there is also World Breastfeeding Week and World Blood Donor Day.\nWe have just announced a call for entry for an essay competition on World Menstrual Hygiene Day to commemorate the day."], ["https://guardian.ng/opinion/tinubu-watch-dont-remove-education-subsidy/", "They behave like dinosaurs who don’t understand the digital times that disrupt governance processes daily, even in the global context.\nFor returning medical students, fees range between N210, 250 and N240, 250.\nEven education authorities haven’t measured the subsidies in medical and health sciences education in the country.\nHow many times will one write about how education quality has made South Korea become a world power with about 60 million people?\nAnd then university education should not become a privilege through fees that we cannot afford here."], ["https://newsdiaryonline.com/probe-missing-2-1bn-n3-1trn-of-subsidy-payments-or-face-legal-action-serap-tells-tinubu/", "The Auditor-General fears that the money may be missing.”“The NNPC also reportedly failed to account for the allocation of crude oil to refineries in 2019.\nThe Auditor-General wants the money recovered.”“The DPR also paid N11,856,088,271.92 as salaries for 2019 but failed to deduct N118,560,882.72 as contribution of 1% Industrial Training Fund (ITF).\nThe DPR in 2019 also failed to transfer US$35,738,342.95 year balance.\nThe payments were for outstanding Petroleum Support Fund (PSF) commitments for year 2015.”“However, there was no payment in 2016.\nThe purchase of ‘the vehicles were made through direct procurement without competitive bidding by at least three companies, as required by Financial Regulations."], ["https://newsdiaryonline.com/nlc-opposes-increase-in-electricity-tariff-hails-fgs-decision-to-prosecute-fuel-subsidy-culprits/", "Omar’s statement said “Congress calls all affiliate unions and state councils to remain steadfast in the struggle for total implementation of the new minimum wage in all the states of the Federation.\nCURRENT CHALLENGESCongress calls all affiliate unions and state councils to remain steadfast in the struggle for total implementation of the new minimum wage in all the states of the Federation.\nTherefore, recent discordant voices of some unionists after the last Delegates’ Conference of the NLC are not unusual.\nIt has happened in the past and the NLC has emerged even stronger and better positioned for the defence of workers’ rights.\nNLC therefore wishes to call all its affiliates to service its unity through its time tested internal democratic structures."], ["https://newsdiaryonline.com/n789-6m-subsidy-scam-trace-rocky-downstream-energy-vessel-witness/", "The report taken from Lloyd’s database was tendered by prosecuting Counsel Rotimi Jacobs, SAN and admitted as exhibits E44 and E44A.\nRocky Energy Limited; Downstream Energy Resources Limited, Alhaji Adamu Aliyu Maula, Goerge Ogbonna and Emmanuel Morah were initially arraigned before the court on a 25-count charge bordering on conspiracy to obtain property by false pretence, forgery and uttering.\nAbubakar Samusideen, counsel to the first and second defendants and other defence counsel did not ‎object to the presentation of the charges.\nSamusideen prayed that his clients be allowed to continue with the previous bail conditions already given by court.\nCounsel to third and fifth defendants, A. Ubena and counsel to the fourth defendant, Professor A.B Kasimu (SAN) ‎ aligned with the position Samusideen."], ["https://guardian.ng/news/world/two-aid-workers-killed-in-ukraine-kyiv-blames-russia/", "Two aid workers, one Canadian and one Spanish, were killed in east Ukraine, said Kyiv on Sunday blaming Russian forces and calling their deaths near war-ravaged Bakhmut “a painful, irreparable loss”.\nKyiv said the aid workers had dedicated themselves to limiting the harm to civilians caught in the conflict, including by carrying out evacuations and distributing humanitarian relief.\nRoad to Relief said in a post on its Instagram account that the vehicle the four aid workers were travelling in “came under Russian attack” in Chasiv Yar in eastern Ukraine on Saturday morning.\nThe aid workers had left from Slovyansk and were headed to Bakhmut to assess the needs of civilians “caught in crossfire” in the town of Ivanivske.\nIn February, 33-year-old US medic Pete Reed was killed near Bakhmut when his evacuation vehicle was hit by a missile."], ["https://newsdiaryonline.com/subsidy-removal-nans-demands-reduction-in-school-fees/", "Anzaku said, “what the association expects is school fees reduction and not increment because the rate of dropout is increasing.\n”We frown against all forms of school fees increment because at a time like this when there is numerous hardship across the country.\n”We have written to NUC to call on schools to reduce school fees else we will protest in our large numbers.\nWe are going on campus tour to talk to Vice Chancellors, Rectors and Provosts to reduce school fees,” he added.\nThe Article 15: Elections sub-section one of NANS convention states that NANS leadership shall be for a one-year tenure."], ["https://newsdiaryonline.com/sokoto-kilings-tambuwal-orders-provision-of-relief-materials-for-families/", "Tambuwal pleaded with the people to be patient as “government is doing its best to check insecurity in the area.\nWe are working closely with all security agencies in the state to ensure that this mayhem does not continue.\n“We are aware of the concerted effort of the community to forestall and checkmate the criminal activities of attackers.\nHowever, I wish to call on all of you not take the laws into your hands.\n“You should not be so overwhelmed by the bandits attack and neglect the import of this contagious disease,” he told the people of the community."], ["https://newsdiaryonline.com/covid-19-okei-odumakin-demands-accountability-transparency-in-distribution-of-relief-materials/", "Dr Joe Okei-Odumakin, President, Women Arise for Change Initiative, has demanded for transparency and accountability toward the distribution of COVID-19 relief materials to the aged, physically challenged and most vulnerable households in the country.\nShe noted that individuals and institutions had been donating money and relief materials to fight the Coronavirus pandemic in the country and such items should not be diverted into wrong hands.\nShe said: “The relief materials is a welcome development but accountability and transparency must be ensured in managing those funds.\nOkei-Odumakin said various Non-Governmental Organisations (NGOs) had been donating medical and food materials to provide support and succour in these trying times.\nShe, therefore, commended the health care workers and other essential workers for their selfless efforts at this trying period."], ["https://www.naijanews.com/2023/03/06/president-buhari-advocates-for-duty-free-market-access-debt-relief/", "President Muhammadu Buhari has urged the developed world to provide duty-free and quota-free market access to ensure that goods from the world’s 46 least developed countries are incorporated into regional and global value chains.\nPresident Buhari stated this in the UN Conference on Least Developed Countries, which took place in Doha, Qatar.\nPresident Buhari was quoted as saying: “In 2015, the world came together to endorse the 2030 Agenda for Seventeen Sustainable Development Goals.\n‘‘The Least Developed Countries are often faced with developmental vulnerabilities and challenges that are not always of their making.\nPresident Buhari claims that despite having made the fewest contributions to the causes of climate change, LDCs continue to suffer disproportionately from it."], ["https://newsdiaryonline.com/the-full-subsidy-probe-report-pdf-copy/", "Click on the image below for the report:The Full Subsidy Probe Report-pdf copyShare this:TweetPrintEmailTelegramWhatsApp"], ["https://newsdiaryonline.com/world-bank-power-project-a-relief-for-unical-vc/", "Prof. Florence Obi, Vice-Chancellor of the University of Calabar, has stated that if the envisaged World Bank intervention geared towards providing sustainable power through the solar power projects is completed, the university community would have huge power relief.\nObi stated this on Tuesday in Calabar when officials of the Rural Electrification Agency (REA), accompanied by some contractors for the World Bank assisted Solar Power Project paid her a courtesy call in Calabar.\nThe Vice-Chancellor told the REA officials that one of the biggest challenges her administration was facing was that of sustainable power supply.\nShe expressed optimism that with the power project, there was hope for constant power supply in the institution that would engender effective research.\nHe noted that the desire of having a 24-hour power supply will be achieved, adding that there was a plan for the sustainability of the project."], ["https://nigerianobservernews.com/2023/07/cartoon-a-short-story-on-fuel-subsidy-removal/", ""], ["https://guardian.ng/apo-press-releases/united-nations-population-fund-unfpa-and-king-salman-humanitarian-aid-and-relief-centre-ks-relief-collaborate-to-enhance-maternal-and-reproductive-health-in-somalia/", "Download logoThe United Nations Population Fund (UNFPA) Somalia and King Salman Humanitarian Aid and Relief Centre (KS Relief) announced the launch of a groundbreaking project to improve access to quality maternal and reproductive health for vulnerable and displacement-affected populations in Somalia.\nThe project will enhance access to comprehensive emergency obstetric and newborn care, strengthen capacity in reproductive health services, and improve supply chain management, benefiting vulnerable communities in Somalia.\n“This health and humanitarian project aims to provide essential services for pregnant women and girls in Somalia, strengthening national institutions and health service providers to build a responsive health infrastructure.\nThe event marks an important milestone in the collaborative efforts of UNFPA and KSRelief to improve maternal and reproductive health in Somalia.\nWith a shared commitment to the well-being and empowerment of vulnerable populations, this project sets a strong foundation for positive change."], ["https://saharareporters.com/2023/08/07/subsidy-removal-nigerian-private-school-owners-increase-tuition-suspend-bus-services", "The National Association of Proprietors of Private Schools (NAPPS) has informed parents of their decision to suspend school bus services nationwide and the tendency of increasing their wards’ tuition fees.\nOtubela was quoted by The PUNCH as saying: “Undoubtedly, this is a challenging time for all, touching every sector of the economy, private schools not exempted.\n“We decided that there was a need to reduce some activities that are not directly necessary to academic activities to reduce cost.\nThe NAPPS President said private schools are in need of support.\n“Unknown to many people, many of the private schools are running at a loss, while many are running as charity organisations,” he added."], ["https://newsdiaryonline.com/fg-not-considering-accessing-the-world-bank-dssi-debt-relief-loan-minister/", "The Minister of Finance, Mrs Zainab Ahmed says the Federal Government is not considering accessing the Debt Service Suspension Initiative (DSSI) loan due to the high risks the offer comes with.\nAhmed made this known on Tuesday in Abuja at the public presentation of the 2021 budget proposal.\nThe minister said that Eurobonds issuance to fund the 2021 budget was not an option, adding that the Federal Government would consider its options carefully when it was time.\nGiving an aggregate of the 2021 expenditure, inclusive of Government Owned Enterprises (GOEs), Ahmed said N13.08 trillion.\nOthers are Ministry of Education with N197.411 billion, Ministry of Water Resources N152.77 billion, Ministry of Defence N121.24 billion, Ministry of Agriculture and Rural Development N110.24 billion and Ministry of Aviation N89.97 billion."], ["https://newsdiaryonline.com/morocco-earthquake-un-stands-ready-to-support-relief-efforts/", "By Cecilia OlogunagbaUN Secretary-General Antonio Guterres has expressed readiness of the organisation to assist the Government of Morroco in any way needed to help those impacted by the earthquake.\nAccording to the UN humanitarian hub, Reliefweb, the powerful quake struck the country shortly after 10 p.m. local time on Friday.\nGuterres in a statement by his spokesperson, Stephane Dujarric, expressed his sadness over the deadly earthquake, reportedly leaving over 1,000 dead.\nAccording to media reports, several houses in the city of 840,000 collapsed and other buildings suffered structural damage.\nAmina Mohammed, the UN Deputy Secretary-General, also responded on social media platform, saying that her “prayers and thoughts” were with the people of Morocco."], ["https://newsdiaryonline.com/coronavirus-us-senate-passes-major-1-9tn-relief-plan/", "The $1.9tn (£1.4tn) plan passed by 50 votes to 49 on Saturday, and will now head to the House of Representatives where it is expected to be approved."], ["https://www.naijanews.com/2023/06/19/fuel-subsidy-details-of-tinubu-govt-organised-labour-meeting-emerge-photos/", "The Bola Tinubu-led Federal Government and organized Labour reconvened at the Presidential Villa, Abuja on Monday.\nHe said: “As we promised the last time we met; when labour called off their planned strike, we held a meeting today.\nWe went through all the demands that labour had tabled, that is government and the labour unions last time.\nAlake said: “Work groups have been constituted at today’s meeting.\nThere is a steering committee that will serve as a clearing house and there are other committees comprising both parties; government and labour."], ["https://newsdiaryonline.com/n305bn-oil-subsidy-stakeholders-task-fg-on-full-deregulation/", "The Federal Government has been urged to embark on the full deregulation of the petroleum downstream sector.\nEdward advised government to create “free entry, free exit’’ in the downstream sector to attract investment and grow the economy.\nMr Olufemi Adewole, the Executive Secretary, Depot and Petroleum Products Marketers Association (DAPPMA) emphasised the need for federal government to consider total deregulation of downstream oil sector.\nHe stated that when investors invest and build more refineries, depots price of petroleum price would drop and this will be to the advantage of the common man.\nAccording to him, the continued regulation of the downstream sector has its positive and negative impacts on the economy."], ["https://www.naijanews.com/2023/07/22/fuel-subsidy-climate-change-the-future-of-electric-vehicles-in-the-mobility-industry/", "CNG-Powered Mobility vs. Electric Options: A Glimpse into the FutureThe remarks made by the VP shed light on the ongoing debate over the choice between CNG-powered vehicles and electric alternatives.\nIt is undeniable that electric vehicles represent a significant leap towards a sustainable and environmentally friendly future.\nReviewing the Mobility Industry: The Long-Term Triumph of Electric VehiclesIn the face of mounting environmental concerns and increasingly stringent emission regulations, the mobility industry is at a critical juncture.\nThe signs indicate that electric vehicles are destined to be the long-term winners in this race.\nAs a result, the electric vehicle ecosystem has become a dynamic and robust landscape, well-positioned to revolutionize the mobility industry."], ["https://newsdiaryonline.com/borno-idp-fire-minister-commiserates-with-bereaved-families-promises-early-relief/", "In a statement on Friday, the Minister who described the incident as sad and shocking, and promised to deliver relief materials to the surviving victims of the incidence.\n“I was touched by the loss of so many lives and property caused by the fire, and prayed that it should never happen again in the future,” she said.\nFarouq said that the fire incident would be investigated as directed by President Muhammadu Buhari to determine its causes and proffer measures to avert future recurrence.\n“President Muhammadu Buhari has directed an immediate provision of relief to the victims and the Ministry is working assiduously to do that,” the Minister said.\nShe said that the Northeast Development Commission (NEDC) and other agencies of the Ministry would act fast and deliver needed aid to the IDPs."], ["https://newsdiaryonline.com/court-dismisses-nadabo-energy-boss-ali-peters-application-in-alleged-n1-4bn-oil-subsidy-fraud/", "Justice C.A.\n0047851 and purported the Marine Insurance certificate to have been issued by Staco Insurance Plc to Nadabo Energy Limited.”He pleaded “not guilty” to all the counts.\nIsiramen, the defence had brought an application dated July 5, 2022, urging the trial Judge to “disqualify or recuse yourself on the grounds of existence of likelihood of bias”.\nRuling on the application today, Justice Balogun held that the allegation of “likelihood of bias” raised by the defence was a “mere conjecture”.\nWhile striking out the application, Justice Balogun ruled that “This court shall continue to hear this matter.”The case was adjourned till July 11, 2023 for continuation of trial."], ["https://newsdiaryonline.com/plateau-crises-fg-hands-over-relief-items-to-five-communities/", "President Muhammadu Buhari, through the Ministry of Humanitarian Affairs, Disaster Management and Social Development approved food and non-food items distributed to the victims to provide succour to the affected persons.\nWhile humanitarian relief and aid can provide temporary relief, the goal is to ensure that vulnerable persons build resilience through access to social protection services and programmes.\n“Following an assessment by the National Emergency Management Agency, NEMA, we found it pertinent to visit and to provide humanitarian relief to cushion the effects and to reduce vulnerabilities”.\n“The Vice President had promised us N10b to help in relocating the people back to their respective communities.\nThe Minister later commissioned a newly built ICT Centre at the Olusegun Obasanjo Model Primary school, Hwolshe located in Jos North."], ["https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jul/12/40.html", "President Bola Ahmed Tinubu on Wednesday wrote to the National Assembly seeking an amendment to the 2022 supplementary appropriation Act.\nThis was disclosed in a letter read on the floor of the House during Wednesday\u0092s plenary by Speaker Tajudeen Abbas.\nThe President said the money will be sourced from the 2022 supplementary Appropriation Act of N819.\nThe Speaker said the House will consider Tinubu\u0092s request at plenary on Thursday and asked members willing to make contribution to be prepared to \u0091do so\u0092.\nThe letter titled: \u0093Request for the amendment of the 2022 appropriation act\u0094 reads in part: \u0093I write to request the approval of the House of Representatives an amendment of the 2022 appropriation act in accordance with the law."], ["https://guardian.ng/apo-press-releases/the-coca-cola-system-pledges-1-4-million-to-support-morocco-in-the-wake-of-earthquake/", "The Coca-Cola (www.Coca-ColaCompany.com) system has committed $1.4 million to relief efforts in Morocco following the recent earthquake.\n“We extend our sympathy to those who have lost loved ones and those whose homes were damaged,” said Luisa Ortega, president of Coca-Cola Africa operating unit.\nMedia Contact:Name: Amel Benchikh El HoucineEmail: abenchikh@coca-cola.comAbout The Coca-Cola Company:The Coca-Cola Company (NYSE: KO) is a total beverage company with products sold in more than 200 countries and territories.\nTogether with our bottling partners, we employ more than 700,000 people, helping bring economic opportunity to local communities worldwide.\nIt produces and distributes different types of beverages such as soft drinks, water, juices, energy drinks and replenishment drinks."], ["https://guardian.ng/news/nigeria-has-failed-africa-poorly-implemented-policies-drive-citizens-to-poverty-obasanjo-laments/", "“We are living dangerously on a keg of gunpowder, driving more people into poverty through good policies poorly and thoughtlessly implemented or bad policy and no policy at all,” he added.\nMeanwhile, a group, the Arewa Citizens Watch for Good Governance (ACWGG), has given the government a 10-day ultimatum to end hunger and reverse petrol price.\n“But as I have always argued that the greatest enemy confronting the country today is the floating of the naira.\nIn this case, once the price of crude oil goes up in the international market, the price will go up.\nThen once the value of the naira nosedives, the price of petrol will also go up."], ["https://www.naijanews.com/2023/06/07/fuel-subsidy-tinubu-govt-accepted-all-our-demands-tuc/", "The Trade Union Congress (TUC) said it agreed to shelve the strike plan because the Bola Tinubu-led federal government was ready to accept all its demands.\nBut after marathon meetings with representatives of the Bola Tinubu-led administration, NLC, and TUC shelved the planned industrial action.\nAmong the demands put forward by the TUC was the payment of a new minimum wage of N200,000.\nSpeaking in an interview on Tuesday, TUC Secretary General, Nuhu Toro, said: “Sincerely, we went into the meetings or negotiations with the government and they accepted all our demands.\nThe essence of an ultimatum is to get the government’s attention to present our demands which we did."], ["https://www.naijanews.com/2023/07/13/breaking-senate-confirms-service-chiefs-appointed-by-tinubu/", "The Senate on Thursday confirmed the appointment of the nation’s service chiefs and the Chief of Defence Staff appointed by President Bola Tinubu.\nThis follows the conclusion of their screening before the lawmakers at the Senate Chamber.\nDuring the screening which was held behind closed doors, the security chiefs briefed the Senate on their career progression and pledged to meet national expectations of ensuring security and defending the nations’s territorial integrity.\nHouse Of Rep Approves President Tinubu’s Request For 500 Billion Naira Palliative FundThe House of Representatives has made adjustments to the 2022 supplementary appropriation act to accommodate President Bola Tinubu’s request.\nThe legislators also urged President Tinubu to use the funds as conscientiously as possible."], ["https://newsdiaryonline.com/nembe-oil-spill-traditional-ruler-lauds-bayelsa-govt-for-prompt-response-seeks-more-relief-for-victims/", "Josiah gave the commendation in a letter addressed to the Governor and made available to newsmen on Saturday in Abuja.\nThe traditional ruler commended the governor for condemning the non-stoppage of the oil and gas spill.\n”We further commend you for immediately directing your Deputy to set up an “Assessment Committee” on Nembe Oil Spillage.\nNAN further reports that President Muhammad Buhari had earlier, on Nov. 25, dispatched the Minister of State for Petroleum, Chief Timipre Sylva, to visit the spill site and empathise with impacted residents and ensure adequate response.\nDiri visited the spill site on Nov 30, five days after Sylva’s visit."], ["https://guardian.ng/news/nlc-insists-on-august-2-nationwide-protests-over-rising-hardship-anti-poor-policies/", "The action, The Guardian gathered, was strongly condemned by organised labour.\nThe things that they mentioned, he is completely unaware of them; he is yet to be briefed about all those issues.\nStating that rising inflation has further exacerbated the nation’s woes, he said the agitation by NLC was expected.\nHe said: “While we understand the genuine concerns of labour, strike action at a time when the economy and businesses are barely struggling is not in the best interests of all and sundry.\nWorryingly, he admitted that the snail-speed approach in tackling the consequences of its economic policies seems to suggest the shallowness of the ‘BATnomics’."], ["https://nigeriaworld.com/cgi-bin/axs/ax.pl?https://nigeriaworld.com/news/source/2023/jun/30/28.html", "By Tayo Elegbede A member of the Labour Party/Obi-Datti Presidential Campaign Council for the 2023 election, Prof Chris Nwokobia has said President Bola Tinubu is copying all the planned policies of the party\u0092s presidential candidate, Peter Obi.\nNwokobia, said Tinubu since his inauguration has been executing policies planned by the Labour Party flag bearer, Naija News gathered.\nThe Labour Party chieftain said Obi would have done better if given the chance due to his expertise in politics and economics.\nNwokobia said \u0093All we have seen in the life span, one month of this administration is copycatting the policy programmes of Peter Gregory Obi.\nPeter Gregory Obi would have done better."], ["https://nigerianpilot.news/2023/08/19/subsidy-fg-to-establish-presidential-cng-fuel-initiative-for-vehicles-nationwide/", "Under the aegis of the PCNGI, the following strategic objectives will be achieved: The development of new stakeholder-operated Intrastate Mass Transit systems built on CNG.\nSupport for states to onboard new CNG buses as part of their Intrastate Mass Transit network (wholesale conversion, retro-fitting and new purchase).\nThe deployment of CNG buses through existing Private Mass Transit operators, including new financing programmes for operators through an innovative asset finance programme.\nIncentivize investors to invest in CNG processing, distribution and utilization by providing incentives for enhanced investment and partnership.\nThe President’s focus on assembling CNG-enabled vehicles within the country will stimulate economic growth, create employment opportunities, and bolster the nation’s automotive manufacturing capabilities."], ["https://newsdiaryonline.com/alake-says-media-not-seen-as-adversary-to-govt-calls-for-constructive-criticism/", "By Emmanuel MogbedeMinister-designate Dele Alake has said that the Federal Government does not see the mass media as an adversary, but a tool to put the administration on its toes.\nAccording to him, at the end of the day, both the media and government operate in the same society.\n“If we are practising adversary journalism and we create problems in our society, where are we going to practise,” Alake asked.\nAlake explained that government did not see the media as enemy because of its criticism, saying that criticism was part of democracy.\n“Criticism you must do because it is an integral part of democracy; however, what is obnoxious is destructive criticism, you have to engage in constructive criticism."], ["https://newsdiaryonline.com/monday-market-disaster-zulum-announces-n1-billion-for-emergency-relief/", "I have approved the release of one billion naira as emergency relief for us to quickly support victims of the disaster because we know that some of them may even have difficulty of surviving the next few days.\nI am going to see Mr President and seek for presidential intervention on how to get support for victims.\nInsha’Allah, we will be taking firm measures towards preventing reoccurrence of this fire disaster that has occurred in previous years.\nIn the meantime, I urge us not to politicize this unfortunate incident.\nWe have to find ways of ensuring this unfortunate fire disaster does not happen again and we will work together to ensure this, bi iznillah”Share this:TweetPrintEmailTelegramWhatsApp"]]