{"0": "Download logoOn Tuesday, first-time homebuyers at the Mill Park Development in Bredasdorp received their house keys.\nOfficiating the handover was the provincial MEC of Infrastructure, Tertuis Simmers, and the Cape Agulhas Executive Mayor, Paul Swart.\nIn attendance were beneficiaries of this pilot project who applied through the rent-to-own option.\nIn addition, the Mill Park project supports prospective but financially impaired home buyers by offering the Housing Consumer Education Programme.\nThe provincial MEC commended the innovative collaboration with the Cape Agulhas Municipality in implementing this pilot project.", "1": "Former Deputy National Publicity Secretary of the All Progressives Congress (APC), Timi Frank, has urged President Bola Ahmed Tinubu not to entertain or negotiate soft landing deals with ex-government officials who have abused their offices and looted the nation’s treasury.\nIn a statement in Abuja, Frank expressed concern that the President’s initial zeal in going after corrupt elements seems to have waned or disappeared completely.\nHe also warned against rewarding ex-governors and ex-ministers facing corruption charges or criminal allegations with fresh appointments, stating that it would undermine the credibility of the anti-corruption drive.\nFrank also raised concerns about former political office holders with corrupt reputations finding their way into Tinubu’s cabinet, warning against rewarding such individuals with appointments.\nFrank concluded by stating that Nigerians and the international community are watching to see if President Tinubu’s anti-graft drive is genuine or merely symbolic, based on the ongoing investigations of Emefiele and Bawa.", "4": "Agbese, speaking to newsmen after Thursday’s plenary, says the Green Chamber now has a human face with its people-oriented legislation.\nAccording to Agbese, the speedy assent of this request shows that the House is very much on the side of the masses who are directly affected by the policy.\n“I call it historic because we now have a parliament that understands the plights of Nigerians and has put a human face to leadership.\nThe speedy assent of the request shows that we are on the side of the masses.\nAbbas is all about the interests of Nigerians and will go the extra mile to put smiles on their faces.", "6": "The association, which reiterated its support for policy deregulation in the petroleum industry, acknowledged the challenges faced by Nigerians and extended its empathy to all citizens.\nIt emphasised that transparency and engagement with citizens by the governments are essential for building public trust.\n“In recent months, the price of PMS has remained relatively stable.\nHowever, there has been a significant increase in the foreign exchange rate.\nHe urged the governments to address the citizens on the importance of the removal.", "9": "“We are living dangerously on a keg of gunpowder, driving more people into poverty through good policies poorly and thoughtlessly implemented or bad policy and no policy at all,” he added.\nMeanwhile, a group, the Arewa Citizens Watch for Good Governance (ACWGG), has given the government a 10-day ultimatum to end hunger and reverse petrol price.\n“But as I have always argued that the greatest enemy confronting the country today is the floating of the naira.\nIn this case, once the price of crude oil goes up in the international market, the price will go up.\nThen once the value of the naira nosedives, the price of petrol will also go up.", "11": "The action, The Guardian gathered, was strongly condemned by organised labour.\nThe things that they mentioned, he is completely unaware of them; he is yet to be briefed about all those issues.\nStating that rising inflation has further exacerbated the nation’s woes, he said the agitation by NLC was expected.\nHe said: “While we understand the genuine concerns of labour, strike action at a time when the economy and businesses are barely struggling is not in the best interests of all and sundry.\nWorryingly, he admitted that the snail-speed approach in tackling the consequences of its economic policies seems to suggest the shallowness of the ‘BATnomics’.", "12": "Yemi-Esan said this on Tuesday in Abuja during a parley with media executives as part of activities marking the 2023 Civil Service Week.\n“We don’t have any plans to reduce working days for civil servants in view of the hike in PMS and cost of transportation.\n“The committee is currently working on getting gas-powered buses to convey civil servants to and fro.\nAlso, the minimum wage is also being reviewed.”She said the ongoing verification exercise for civil servants across the MDAs had captured 69,854 officers across the six geopolitical zones.\nAlso, she disclosed that the verification exercise had led to the detection of 1,618 fake or illegal employment letters and the subsequent suspension of the officers.", "14": "Alake, current Special Adviser to President Bola Tinubu on Special Duties, Communications and Strategy, made this known at a meeting with media executives on Friday in Abuja.\nThis said at the end of the day, both the media and government operate in the same society.\n“If we are practising adversary journalism and we create problems in our society, where are we going to practise,” Alake asked.\nAlake explained that government did not see the media as enemy because of its criticism, saying that criticism was part of democracy.\n“Criticism you must do because it is an integral part of democracy; however, what is obnoxious is destructive criticism, you have to engage in constructive criticism.", "15": "They behave like dinosaurs who don’t understand the digital times that disrupt governance processes daily, even in the global context.\nFor returning medical students, fees range between N210, 250 and N240, 250.\nEven education authorities haven’t measured the subsidies in medical and health sciences education in the country.\nHow many times will one write about how education quality has made South Korea become a world power with about 60 million people?\nAnd then university education should not become a privilege through fees that we cannot afford here.", "16": "It is important that you understand the reasons for the policy measures I have taken to combat the serious economic challenges this nation has long faced.\nI am not going to talk in difficult terms by dwelling on economic jargon and concepts.\nIt diverted money that should have been used to create jobs, build factories and businesses for millions of people.\nOur objective is to fund 75 enterprises with great potential to kick-start a sustainable economic growth, accelerate structural transformation and improve productivity.\nWith the fund, our states will become more competitive and on a stronger financial footing to deliver economic prosperity to Nigerians.", "17": "He advised the Zakat beneficiaries to spend the money judiciously for the purpose they were given.\nThe National Missioner of NASFAT, Imam Abdul-Azeez Onike, said NASFAT is disbursing Zakat to ensure that every Nigerian has means of livelihood.\n“Allah has given you a special favour by putting you in a position to be able to pay Zakat, some people will not be able to pay Zakat throughout their lifetime.\n“I enjoined every Muslim to come and pay their Zakat to NAZAS.\nIf you entrust us with your Zakat, be rest assured it is going to be disbursed appropriately,” he said.", "18": "The chief executive officer of the Nigeria National Petroleum Corporation Limited (NNPCL), Mele Kyari, has been urged to render an account of the cost implications of fixing the nation’s refineries.\n“Let us remind Mr Kyari that no amount of blackmail, intimidation, or diversionary tactics will deter us on this patriotic campaign.\n“We demand for transparency, accountability and we’ll continue to demand that Mr President act to expose the heinous crimes in the petroleum sector”.\n“Why is there never an audited account of NNPC or NNPCL known to the public?\nIt is even a shame for Mele Kyari to boast about declaring those paltry sums as profits, even as the entire claim is in itself unverified.", "19": "Pregnant women who require a balanced diet for child brain development go to bed hungry.\nHealth experts believe that the first 1,000 days in the life of a child determine survival and brain development.\nHe added that a child who completes all immunisations and proper child care is likely to survive the first 1,000 days.\n“Window of greatest contact with the health system for women mothers, newborns and children.\nPeriod of greatest health risk and vulnerability for adverse health for women, mothers, newborns and children.", "22": "He told Nigerians: “It is too early to cry because there are more difficult decisions government will have to make.\nHaving taken this path of neo-liberal economic policies, there are many choices they have to make along the way.\nAccording to him, what labour should do now is help the Tinubu administration to succeed.\nAdebayo said possibility of the Port Harcourt refinery beginning operations by December is mere aspiration, affirming it would not happen.\n“They just wanted him to have that sense of achievement that the refinery took place during his time.", "23": "Agwu noted that injecting such money for the Compressed Natural Gas (CNG) buses into the Nigerian automotive industry would spur more activities that would fast-track the development of the industry.\n“We have companies in Nigeria that could meet up the demand as well as subsequent ones,” he maintained.\nAgwu urged the government to consider using the automotive industry in driving Nigeria’s economic development.\n“I urge the new government to ensure that the automotive sector of the Nigerian economy remains on the front burner of its economic policy and programmes from the onset.\n“The sector is very important as it shows physically the state of the economy, and it generates much revenue and creates enormous employment.", "24": "President Bola Tinubu has been enjoined to reconsider implementation of his economic policies and reforms in a way that will not plunge Nigerians into more hardship.\nHe suggested, rather than rush to implement policies that would further impoverish Nigerians, the President should go all out to kill corruption entrenched in the polity.\nHe said it was in the best interest of the nation for Tinubu to always consider intended and unintended consequences before committing to a course of action.\n“Let us consider the cost of just one impulsive action to Nigerians in the past few months.\nThe former All Progressives Congress (APC) presidential aspirant urged Tinubu to refocus on killing pervasive corruption in the country and not Nigerians.", "25": "Labour Party (LP) has alerted Nigerians on consequences of experimental leadership approach and governance by stealth without imagination, deep thinking or concrete ameliorative policies which the All Progressives Congress (APC) has allegedly foisted.\nThis was contained in a statement by Director-General of the Obi-Datti Campaign Organisation, Balogun Akin Osuntokun, in Abuja, yesterday, following an appraisal of 66 days of the Bola Tinubu administration.\nHe said the situation is worsened by decline in National Savings Rate and erosion of disposable incomes of Nigerians, thereby increasing poverty and insecurity.\n“While we agree that ‘After Darkness Comes the Glorious Dawn’, what the APC government clearly reminded Nigerians is that the darkness was caused by the same APC in the last eight years with the gang still the same and bigger now.\n“Unfortunately, as APC cannot give what it does not have, the darkness is clearly getting darker and expanding with the largely cosmetic, uncoordinated, and confusing announcement of policies without proper thinking, planning, and execution strategies.”", "27": "The Nigeria Extractive Industries Transparency Initiative (NEITI) has announced plans to provide baseline information on 13 per cent derivation payments and petrol consumption data in Nigeria.\nThe derivation payment is a certain amount of money in the oil and gas revenue data paid to oil-producing states, which has been extended to states that produce solid minerals in Nigeria.\nAccording to the Head of NEITI, Ogbonnaya Orji, during the organisation’s civil society consultative forum meeting with the media and civil society, providing this baseline information is essential in ensuring good governance and promoting transparency in Nigeria’s extractive industry.\nHe added that NEITI will be working with relevant government agencies and civil society organisations to collect and analyse the data.\nOrji said the report will provide critical data required to monitor how much is allocated monthly to oil-producing states, while establishing whether the government is paying the dues.", "28": "The Guardian reported that transportation increased by an average of 120.6 per cent year on year as at June.\nThe latest report shows a seven-month consecutive rise in the nation’s inflation rate, defying efforts by the Central Bank of Nigeria (CBN) to keep it down with its various monetary policy measures.\nAccording to NBS the headline inflation rate for July 2023 increased to 24.08 per cent compared to 22.79 per cent recorded in June 2023.\nNBS said the rise represented an increase of 1.29 per cent points from the June 2023 headline inflation.\nThe CBN, on its part, also raised the Monetary Policy Rate from 18.5 per cent to 18.75 per cent to rein in inflation.", "29": "“People are having more trust in the zakat committee.\nWe not only received zakat from Lekki Muslim residents but from Muslims residing elsewhere” .\nDr. Kamoru Omotosho, the immediate Past President of Lekki Muslim Ummah, LEMU, on his part, thanked the stakeholders for making the LEMU Zakat committee realize its dream.\nHe said, “I want to thank three categories of people here, first is the zakat committee and its chairman.\nMr. Mukhtar Abdullahi, one of the two beneficiaries of a tricycle (Keke) was full of praises for LEMU and the zakat donors.", "30": "“We wish to explain in context the details of the N5bn Federal Government’s relief package earlier reported in the media.\n“Each state is to also receive N1bn worth of maize from the strategic national reserve through the Central Bank of Nigeria.\n“The state government has consequently ordered immediate purchase of rice in the value of the amount.\n“Similarly, the state government hereby confirms receipt of the remaining three trucks of the bags of rice.\nThe government had on August 8, 2023 announced delivery of two truckloads of bags of rice, while awaiting three more.", "32": "The acclaimed role Nigeria Labour Congress (NLC) plays in protecting the interest of workers and citizens in governance structure is fast eroding.\nThe last NLC’s major effort and demand aimed at raising minimum wage ended with the tenure of Adams Oshiomole.\nCosts of virtually every goods and services have increased to a minimum of 100% while minimum wage remained the same.\nIt is a miracle how Nigerian citizens and workers survive in this current difficult situation.\nThere is a time in the life of a nation when citizens will no longer tolerate deception, ineptitude and leadership failure.", "33": "The whole process looks like what the Nigerian would refer to ‘Bi ko ba ki o pa, bi o ko baba bul’ese’.\nThe former President of Nigeria, Goodluck Azikiwe Ebele Jonathan captured the picture vividly when he said, “My second term is not worth the blood of any Nigerian”.\nWhy are some Nigerian leaders so selfish, self-centered, and mean to the extent of not minding if the walls of the nation are in embers?\nIs it to know the number of carry-overs that Tinubu had or to suggest that the university senate has awarded an undeserved degree?\nHow do you indict Bola Tinubu for errors in his certificate after all he did not issue the document to himself?", "34": "“Upon that, schools have increased fees and the cost of books and everything about school has gone up.\nSome parents are thinking of changing their children’s schools, to take them to where school fees are less, though the quality may not be too good.\nHe said: “I was unable to pay school fees of my children last term.\nIn Abuja, 45-year-old mother of three, Roseline Agboola, said she was looking for about N500, 000 to pay school fees of three children.\n“The proprietress of my children’s school called to inform us that their school fees have been doubled.", "36": "Unveil the Petroleum Industry Act (PIA)This is the time for the President to unveil the Petroleum Industry Act 2021, the law signed by Buhari to reform oil and gas.\nNow that it is passed, what’s delaying President Tinubu from implementing the law in its entirety?\nThe PIA does not recognise the balkanization of the Petroleum Resources Ministry among political officers.\nPresident Obasanjo and Buhari acted in the capacity of ministers of Petroleum Resources outside the PIA.\nOne other reason the Minister of Petroleum Resources should not operate in the shadows is because of the sensitive powers he wields.", "37": "The Maritime Workers Union of Nigeria (MWUN) on Tuesday disrupted economic activities at the Apapa and Tin-Can Island Ports.\nThe News Agency of Nigeria (NAN) reports that the ports were shut down in line with the two-day warning strike by the leadership of the Nigeria Labour Congress (NLC).\nThe labour union is agitating the non-implementation of some of the resolutions reached from their previous meetings, by the Federal Government.\n“Now, we are also talking about shipping companies and terminal operators charges, what will happen to that?\nThis is double tragedy for the agent and importers, because they will pay demmurage and storage charges to Shipping companies and terminal operators.", "39": "This illustration is vital especially at a time like this when a section of the public – buoyed by the media’s near canonisation of a borrowed American concept of “100 days in office” – seems to be in a frenzy to judge 1,460-day tenure by the first 100 days.\nFor President Tinubu, the best measure of successful leadership is the quantum of qualitative actions and decisions not quantitative.\nIn the last 100 days, President Tinubu has demonstrated that he is made of the finest stuffs as a leader, looking at these parameters.\nIt is also around them that he has devoted most of his energy and attention in the last 100 days.\nThese are not things that can be done in 100 days but the steps to attain them are firmly on course.", "40": "President of the Christian Association of Nigeria (CAN), Archbishop Daniel Okoh, has decried pain faced by Nigerians through harsh economic policies, recklessness of past governments, banditry and kidnappings.\nHe said the living condition of average Nigerian families is better imagined, and called on political leaders to govern with empathy and godly fear.\nIt is worsening in many communities as bandits, unknown gunmen, Fulani herdsmen and Boko Haram militia terrorise the populace.\nThis state of affairs has been compounded by incessant sit-at-home orders in the southeast, issued by non-state actors.\nMany have paid the supreme price for failing to adhere to such illegal orders.”", "42": "A banker, Ademola Ogunjimi, told The Guardian that he also recently installed a solar inverter due to the high cost of fuel.\nSo, in this dispensation of high pump price of petrol, sourcing electricity through a noiseless solar inverter is a win-win situation,” he said.\nA power inverter is an electronic device or circuitry that changes Direct Current (DC) to Alternating Current (AC).\nA power inverter can be entirely electronic or may be a combination of mechanical effects and electronic circuitry.\nThe PV solar panels are widely regarded as ideal methods of generating electricity.", "43": "Former President Muhammadu Buhari has backed the decision of the current administration to remove fuel subsidies, saying he had hoped that it would reduce the large number of people coming to see him in Daura.\nBuhari’s spokesperson, Garba Shehu, disclosed this in a statement issued on Thursday to mark Buhari’s 100 days out of office.\nTo manage the numbers, he has a weekly programme drawn for him, as they did while he was in the Villa,” Shehu stated.\nShehu stated that the administration achieved self-sufficiency in rice and financed millions of small farmers of 23 different commodities, an effort that helped boost the export of agricultural commodities.\nHe added that the COVID-19 pandemic was brought under control due to the relentless leadership of President Buhari, noting that the country was among the few that came out with strong economic activity after the pandemic.", "48": "“We have officially ended Marburg Outbreak in Kagera Region.\nTherefore, Kagera is Marburg free, Tanzania is Marburg free.\n“Indeed, the swift and efficient response to the Marburg virus outbreak needs the utmost recognition.\nTanzania declared an end to the MVD outbreak, over two months after the first case was confirmed.\nSurvivor monitoring and support are currently ongoing in line with the National MVD Survivor Programme Guide developed during the outbreak.", "49": "Download logoThe United Nations Population Fund (UNFPA) Somalia and King Salman Humanitarian Aid and Relief Centre (KS Relief) announced the launch of a groundbreaking project to improve access to quality maternal and reproductive health for vulnerable and displacement-affected populations in Somalia.\nThe project will enhance access to comprehensive emergency obstetric and newborn care, strengthen capacity in reproductive health services, and improve supply chain management, benefiting vulnerable communities in Somalia.\n“This health and humanitarian project aims to provide essential services for pregnant women and girls in Somalia, strengthening national institutions and health service providers to build a responsive health infrastructure.\nThe event marks an important milestone in the collaborative efforts of UNFPA and KSRelief to improve maternal and reproductive health in Somalia.\nWith a shared commitment to the well-being and empowerment of vulnerable populations, this project sets a strong foundation for positive change.", "50": "Download logoThe United States Global AIDS Coordinator, Ambassador Dr. John Nkengasong, visited Namibia from June 17 – 20 to celebrate 20 years of The United States President’s Emergency Plan for AIDS Relief (PEPFAR) and 18 years of saving lives in Namibia.\nAmbassador Nkengasong met with Deputy Prime Minister, Honorable Netumbo Nandi-Ndaitwah, where they discussed health financing, HIV programming, and sustainability.\nIn 2023, PEPFAR will provide US$88 million, which is over N$1.6 billion in funding to support the national HIV/TB response.\nAmbassador Nkengasong also engaged with Namibian Adolescent Treatment Supporters (NATS).\nThe Ambassador congratulated Namibia on its progress to end HIV as a public health threat by 2030.", "51": "Fighters from the Wagner mercenary group with silver armbands and carrying assault rifles had deployed a day earlier across Rostov-on-Don in tanks and armoured cars.\n“When something routine in your city changes and you don’t really understand what’s going on, you feel very anxious and unsafe.\n– ‘I understand them’ –Residents who had heeded a request by local government to remain in their homes on Saturday were enjoying the sunshine.\n“I understand them a bit,” he said, adding however that they should have sorted out their disagreements with Russia’s military leaders differently.\nOver the course of the Ukraine campaign, Prigozhin has complained about Russia’s military leaders in increasingly strident terms, accusing them of inaction, inefficiency and failing to provide his forces with sufficient ammunition.", "52": ".Nearly 3m displaced by Sudan conflictNearly three million people have been displaced internally and across borders by the conflict in Sudan, in less than three months.\nFood, access to health services and essential relief items remain critically lacking.\nMixed movements have been observed across the border into Egypt (40 per cent), Chad (28 per cent), South Sudan (21 per cent), Ethiopia and the Central African Republic.\nUnder the Sudan Crisis and Neighbouring Countries Response, operations have scaled up across Sudan, Chad, South Sudan, Ethiopia, Egypt, Libya and the Central African Republic.\nIn Sudan, a large number of containers with relief items have arrived in Port Sudan, to be distributed through partners and the common Humanitarian pipeline.", "53": "To this end, he said President Tinubu has signed four Executive Orders.\nAccording to the presidential spokesman, this is to ensure adherence to the 90 days minimum advance notice for tax changes as specified in the 2017 National Tax Policy.\nThe last Executive Order also suspended the newly introduced Green Tax by way of Excise Tax on Single Use Plastics, including plastic containers and bottles.\nHe also noted that the Excise Tax increases on tobacco products and alcoholic beverages from 2022 to 2024, which had already been approved, are also being implemented.\nPresident Tinubu’s executive orders were designed to find a balance between tax reforms and the concerns raised by businesses and stakeholders.", "54": "“This DPF supports the government’s aspirations to build the foundations of a modern economy with strengthened institutions.\nAlongside efforts to implement institutional reforms, Somalia has signed debt relief agreements with major creditors and is holding discussions with some remaining bilateral and multilateral creditors.\nResources from the DPF will help the government to ensure that essential public expenditures can be paid.\nOver time, institution-building and sustained economic growth can help Somalia to build buffers to shocks and strengthen resilience.\nDistributed by African Media Agency (AMA) on behalf of The World BankThe post Somalia’s Institutions get a Boost to Help Bring the Country Closer to Debt Relief appeared first on African Media Agency.", "55": "Download logoThe U.S. President’s Emergency Plan for AIDS Relief (PEPFAR) will invest approximately N$840 million (US$45 million) in providing health and social services to vulnerable children, adolescents, and youth in Namibia.\nThis was announced by the PEPFAR Namibia Deputy Principal for USAID, Ms. Tamara Cox, who is currently visiting the Land of the Brave.\nThe five-year “Reach Namibia” program operates in eight regions where 80% of the population reside.\nThe Reach Namibia program will be managed by the United States Agency for International Development (USAID) and implemented by two local organizations: Project HOPE Namibia operating in Khomas, Oshana, Omusati, Ohangwena, Oshikoto and Zambezi regions, and Intrahealth Namibia operating in Kavango East and West.\nThe United States Government through USAID has been supporting Namibia since independence, specifically in the health, education, economic, energy and environment sectors.", "56": "Download logoThe United Arab Emirates is continuing its efforts to distribute food parcels to Sudanese refugees and the local community in the Republic of Chad.\nThe office is working on distributing food parcels and conducting field assessments of basic needs.\nHE Al Shamsi added that the UAE’s humanitarian team has also facilitated medical support through mobile clinics by conducting health examinations for many residents in the two regions and by providing essential medication.\nIn this regard, the UAE is committed to addressing the humanitarian requirements of those in need, reducing poverty, and eliminating hunger.\nDistributed by APO Group on behalf of United Arab Emirates Ministry of Foreign Affairs & International Cooperation.", "57": "The Athletics Association of Nigeria (AFN) and many other followers of the sport heaved a sigh of relief yesterday when the news broke that 100-metre hurdles women’s world record holder, Oluwatobilola Amusan, has been cleared of the dope charges levelled against her by the Athletics Integrity Unit (AIU) of World Athletics.\nAmusan was suspended provisionally by the AIU pending investigations of her missed whereabout tests early last month.\nBut from the onset, she insisted on her innocence, saying there must have been miscommunication somewhere.\nAccording to reports from Budapest, Hungary, venue of the World Championships, which begin tomorrow, a tribunal of three arbitrators exonerated Amusan from two out of the three test failures when the Nigerian argued that the tester did not do enough to locate her.\nSources at the AFN said the athlete will now join her compatriots in Budapest ahead of tomorrow’s opening ceremony of the World Championships.", "58": "Ogba Urges Athlete To Put Trauma BehindAthletics Federation of Nigeria (AFN) President, Tonobok Okowa, has described as a ‘big relief’ the clearance of World Record holder in 100m hurdles, Tobi Amusan, to compete in the ongoing Budapest 2023 World Championships.\n“You need to see the excitement in the camp when Tobi Amusan arrived here on Friday,” Okowa stated.\nHe revealed that Amusan’s presence would ginger other Nigerian athletes to do their best in Budapest.\nTwo-time former AFN President, Chief Solomon Ogba, told The Guardian that as an athlete, the suspension was enough to traumatise Amusan, considering the timing.\n“But I have told her to quickly put it behind and focus on the World Championships.", "59": "The Chris Oyakhilome Foundation International (COFI) revisited the earthquake victims in the nation of Turkey in an intervention tagged, Hope Relief Mission 2.0.\nFounded by the Man of God Pastor Chris Oyakhilome in 2008, COFI’s mission is aimed at eradicating poverty, providing quality education, promoting economic growth, and responding to natural and man-made disasters.\nThank you for bringing healing through the Healing Streams to us.”The people in the city of Nurdagi were deeply moved as COFI volunteers showed them videos of the Healing Streams in Turkish.\nThe cry of the residents was “Pastor Chris please we need healing, please help us!” They were given relief materials and thanked Pastor Chris for praying for them.\nBut at this difficult moment, Pastor Chris Oyakhilome from Africa has remembered us; this makes us emotional.", "60": "Former Nigeria president Olusegun Obasanjo has said immediate past president Muhammadu Buhari spent recklessly due to his lack of understanding of economics.\nIn his reaction, Obasanjo pointed out that he did not spend much when he got debt relief but called out Buhari for alleged reckless spending.\n“Tinubu said the other day that it was unacceptable that he would spend 90% of revenue to service debts.\nI wasn’t spending 90% when I went worldwide to get debt relief.\n“Do you think that anybody would give you debt relief today?", "62": "Two aid workers, one Canadian and one Spanish, were killed in east Ukraine, said Kyiv on Sunday blaming Russian forces and calling their deaths near war-ravaged Bakhmut “a painful, irreparable loss”.\nKyiv said the aid workers had dedicated themselves to limiting the harm to civilians caught in the conflict, including by carrying out evacuations and distributing humanitarian relief.\nRoad to Relief said in a post on its Instagram account that the vehicle the four aid workers were travelling in “came under Russian attack” in Chasiv Yar in eastern Ukraine on Saturday morning.\nThe aid workers had left from Slovyansk and were headed to Bakhmut to assess the needs of civilians “caught in crossfire” in the town of Ivanivske.\nIn February, 33-year-old US medic Pete Reed was killed near Bakhmut when his evacuation vehicle was hit by a missile.", "63": "Download logoThe International Federation of Red Cross and Red Crescent Societies (IFRC) has launched an emergency appeal for 100 million Swiss Francs to further scale up relief efforts of the Moroccan Red Crescent.\nMore than three days after the earthquake hit Morocco, aid is reaching more remote locations, but conditions are challenging.\nSince the disaster hit on Friday night, Moroccan Red Crescent teams have been working with Moroccan authorities.\nThe emergency appeal we launch today will support the Moroccan Red Crescent work on both the most pressing needs and the medium-term temporary solutions.\nSuch a vast-scale earthquake needs long-lasting and sustainable support.”Distributed by APO Group on behalf of International Federation of Red Cross and Red Crescent Societies (IFRC).", "64": "The Coca-Cola (www.Coca-ColaCompany.com) system has committed $1.4 million to relief efforts in Morocco following the recent earthquake.\n“We extend our sympathy to those who have lost loved ones and those whose homes were damaged,” said Luisa Ortega, president of Coca-Cola Africa operating unit.\nMedia Contact:Name: Amel Benchikh El HoucineEmail: abenchikh@coca-cola.comAbout The Coca-Cola Company:The Coca-Cola Company (NYSE: KO) is a total beverage company with products sold in more than 200 countries and territories.\nTogether with our bottling partners, we employ more than 700,000 people, helping bring economic opportunity to local communities worldwide.\nIt produces and distributes different types of beverages such as soft drinks, water, juices, energy drinks and replenishment drinks.", "66": "President Bola Tinubu says he will not partake in the economic destruction of the country by enemies of the nation.\nThe president stated this on Thursday at a reception in his honour by the Lagos State Government.\nBabajide Sanwo-Olu of Lagos State also said that the state governors are in full support of the policies and programmes of the present administration.\nHe said that the support of the state governors was important towards the realisation of the dream of a better Nigeria.\nAbdulRahman AbdulRazaq of Kwara said the state governors support the urgent need of Tinubu to reposition the economy of the country.", "68": "President Bola Tinubu says he will not partake in the economic destruction of the country by enemies of the nation.\nThe president stated this on Thursday at a reception in his honour by the Lagos State Government.\nBabajide Sanwo-Olu of Lagos State also said that the state governors are in full support of the policies and programmes of the present administration.\nHe said that the support of the state governors was important towards the realisation of the dream of a better Nigeria.\nAbdulRahman AbdulRazaq of Kwara said the state governors support the urgent need of Tinubu to reposition the economy of the country.", "70": "The company made this known on Tuesday on its official X handle formerly known as Twitter.\nAccording to the NNPC Ltd., the move is in a… FacebookTwitterWhatsAppTelegramNews FG reopens old MMA terminal to ease travel disruptions 2 hours ago The Federal Government of Nigeria has reopened the D Wing of the old international terminal at Murtala Muhammed International Airport, Lagos.\nThe move is aimed at alleviating flight disruptions and improving the overall efficiency of air travel.\nFacebookTwitterWhatsAppTelegramNews Sanwo-Olu announces plans to serve Lagos better 6 hours ago Governor Babajide Sanwo-Olu, yesterday, said his aadministration was working hard and perfecting new plans to serve Lagos residents better, and urged the people to support the government to achieve a greater Lagos.\nSanwo-Olu spoke at the ongoing Second Session of the 35th Synod of the Diocese of Lagos, Church of Nigeria (Anglican Communion) holding at… FacebookTwitterWhatsAppTelegram", "71": "The company made this known on Tuesday on its official X handle formerly known as Twitter.\nAccording to the NNPC Ltd., the move is in a… FacebookTwitterWhatsAppTelegramNews FG reopens old MMA terminal to ease travel disruptions 2 hours ago The Federal Government of Nigeria has reopened the D Wing of the old international terminal at Murtala Muhammed International Airport, Lagos.\nThe move is aimed at alleviating flight disruptions and improving the overall efficiency of air travel.\nFacebookTwitterWhatsAppTelegramNews Sanwo-Olu announces plans to serve Lagos better 6 hours ago Governor Babajide Sanwo-Olu, yesterday, said his aadministration was working hard and perfecting new plans to serve Lagos residents better, and urged the people to support the government to achieve a greater Lagos.\nSanwo-Olu spoke at the ongoing Second Session of the 35th Synod of the Diocese of Lagos, Church of Nigeria (Anglican Communion) holding at… FacebookTwitterWhatsAppTelegram", "72": "The company made this known on Tuesday on its official X handle formerly known as Twitter.\nAccording to the NNPC Ltd., the move is in a… FacebookTwitterWhatsAppTelegramNews FG reopens old MMA terminal to ease travel disruptions 2 hours ago The Federal Government of Nigeria has reopened the D Wing of the old international terminal at Murtala Muhammed International Airport, Lagos.\nThe move is aimed at alleviating flight disruptions and improving the overall efficiency of air travel.\nFacebookTwitterWhatsAppTelegramNews Sanwo-Olu announces plans to serve Lagos better 6 hours ago Governor Babajide Sanwo-Olu, yesterday, said his aadministration was working hard and perfecting new plans to serve Lagos residents better, and urged the people to support the government to achieve a greater Lagos.\nSanwo-Olu spoke at the ongoing Second Session of the 35th Synod of the Diocese of Lagos, Church of Nigeria (Anglican Communion) holding at… FacebookTwitterWhatsAppTelegram", "73": "Commuters and motorists, last week, heaved a sigh of relief as Lagos State Public Works Corporation started intervention in parts of Lagos where roads are in bad condition.\nBefore the recent intervention, residents have lamented the deplorable state of roads in the metropolis.\nThis, according to him, has made it possible for some roads to be done with asphalt pavement within the past five weeks.\nAlso, the corporation has carried palliative work on some roads across the state using boulders and crushed stones.\nHe, however, assured Lagosians of his agency’s preparedness to aggressively fix all roads as the weather becomes more clement in pursuance of Governor Babajide Sanwo-Olu’s commitment to make Lagos roads remain motorable all year round.", "74": "The Centre for Citizens with Disabilities (CCD) has lamented the exclusion of Persons with Disabilities (PWDs) in appointments so far made by President Bola Ahmed Tinubu.\nThe Executive Director, CCD, David Anyaele, while speaking at a media briefing, yesterday, in Lagos, regretted that no one in the current administration advised the government on making decisions that would benefit people living with disabilities.\nCCD has also accused the Federal Government of failing to explain how People With Disabilities (PWD) would benefit from palliatives distribution.\nAnyaele said that due to the vulnerability and several barriers that PWDs encounter in programmes like this, it is obvious that in most cases, only persons without disabilities who can withstand the rigours will benefit from the programme.\nHe called on state and local government officials responsible for palliative’ distribution to map out ways of making PWDs in all the wards to benefit from the palliative distribution in line with Section 26 of the Discrimination against Persons with Disabilities (Prohibition) Act 2018.", "76": "As part of efforts aimed at improving health and well-being of Nigerians, Easadol, a leading premium painkiller brand recently announced Bolanle “Nino” “Makanaki” Ninalowo as its Brand Ambassador.\nSpeaking on the partnership which was held in Lagos last weekend, Executive Director, Sales and Marketing, May & Baker Nigeria PLC, Pharm.\nValentine Okelu, said: “We are thrilled to have Bolanle “Nino” “Makanaki” Ninalowo as the face of Easadol.\nThe partnership between Easadol and Ninalowo, brokered by Outdoors and Billboards Nigeria Limited, showed shared commitment to improving the well-being of Nigerians.\nManufactured by May & Baker Nigeria PLC, Easadol has consistently provided effective pain relief to millions of Nigerians for almost a decade.", "77": "The company made this known on Tuesday on its official X handle formerly known as Twitter.\nAccording to the NNPC Ltd., the move is in a… FacebookTwitterWhatsAppTelegramNews FG reopens old MMA terminal to ease travel disruptions 2 hours ago The Federal Government of Nigeria has reopened the D Wing of the old international terminal at Murtala Muhammed International Airport, Lagos.\nThe move is aimed at alleviating flight disruptions and improving the overall efficiency of air travel.\nFacebookTwitterWhatsAppTelegramNews Sanwo-Olu announces plans to serve Lagos better 6 hours ago Governor Babajide Sanwo-Olu, yesterday, said his aadministration was working hard and perfecting new plans to serve Lagos residents better, and urged the people to support the government to achieve a greater Lagos.\nSanwo-Olu spoke at the ongoing Second Session of the 35th Synod of the Diocese of Lagos, Church of Nigeria (Anglican Communion) holding at… FacebookTwitterWhatsAppTelegram", "78": "Permanent Secretary, Lagos State Emergency Management Agency (LASEMA), Dr. Olufemi Oke-sanyintolu has reiterated the state government’s preparedness to tackle the incessant flooding in the state.\nSpeaking during the agency’s advocacy visit to Eti-Osa Local Council, tagged, ‘Flood Frees Lagos 2023: Building flood resilience is our collective responsibility,’ Osanyintolu disclosed that the state has improved on the existing infrastructure in terms of preparedness against any form of disaster, especially flood in various communities in Lagos.\nHe noted that the Lagos waterways are been monitored by the two command centres placed strategically in the state and are ready to manage disasters holistically.\nHe pointed out that as part of its preparedness for the incessant flood in Lagos, the government recently improved on the recovery and relief centres by donating eight buildings of 144 units to the relief centre at Agbowa in Lagos.\nHe urged the government to stop the reclamation of land through the lagoon, which he said is inimical to the inhabitants of Eti-Osa and is part of what usually contributes to flooding in the area.", "82": "Lawmaker representing Ado/ Okpokwu/ Ogbadibo Federal Constituency, Philip Agbese (APC- Benue), has reassured Nigerians of a renewed hope under President Bola Ahmed Tinubu.\nThe lawmaker also reiterated confidence in the leadership of the 10th House of Representatives under Tajudeen Abbas.\nAgbese stated this at a meeting by the Political Parties Supporters Network in Abuja on Saturday.\nNigeria is now attracting more foreign investors due to favourable financial policies and the return of relative peace across the nation.\nUnder the Student Loans law, indigent students will no longer drop out of universities on account of their inability to pay school fees.", "86": "The Niger government says the Economic and Financial Crimes Commission (EFCC) and Independent Corrupt Practices and Other Related Offences Commission (ICPC) will monitor the sales and distribution of fertilisers in the state.\nUmaru Bago of Niger disclosed this on Monday while inaugurating the 2023 wet season fertilisers sales/distribution and sales of other inputs to farmers in Minna.\n“The EFCC and ICPC will monitor the sales and distribution of fertilisers in Niger State this year.\nAccording to him, if these moribund irrigation facilities are resuscitated, they would enable farmers produce more food to ensure food security.\nAlso speaking, Emir of Minna, Alhaji Farouk Bahago, who also described himself as a farmer, thanked the state government for providing farmers fertilisers and other inputs.", "87": "In an open letter to President Bola Tinubu, South-South Elders Progressive Forum (SSEPF) blamed progressive decline in crude oil production output on the withdrawal of support for multinational oil companies operating in the Niger Delta region by locals in oil-bearing communities.\nThey withdrew their support because they feel they were not being carried along by the Federal Government and its agencies.\nThey no longer see themselves as under any obligation to protect oil facilities in their areas, including fighting crude oil theft.\nThe letter was signed by Chief Jolomi Ande and Dr. Benedict Akparanta, Chairman and Secretary General respectively.\n“It is in this regard that we write you this letter highlighting some recent anomalies that could mar efforts of your administration, particularly towards improving the dwindling crude oil production output and to proffer solutions on how to remedy the situation, which had adversely affected the nation’s oil earnings.", "92": "Labour leaders, on Tuesday, chased workers out of their offices at the state secretariat, Akure, to ensure compliance with the two-day warning strike called by the Nigeria Labour Congress (NLC).\nThe NLC Chairman, Comrade Victor Amoko, who monitored the warning strike described it as successful, saying the strike was for all Nigerian workers and not only those in Ondo State.\n“He started writing names of workers who reported at work, which is uncalled for to us because it is not being done in Ondo State alone.\nMeanwhile, the Ondo State Head of Service has said workers in the state were not part of the two-day warning strike declared by the Nigerian Labour Congress (NLC) in Abuja.\n”And I’m also happy to note that in Ondo State, NLC has not in any way officially communicated to us that they are on strike,”the HoS said.", "94": "Abba Kabir-Yusuf of Kano state distribute reliefs to victims.\nThe National Emergency Management Agency (NEMA) has started distribution of relief materials to 22,658 households affected by the 2022 flood disaster and vulnerable in Kano State.\nThe Director-General NEMA, Mr Mustapha Ahmed-Habib, disclosed this while flagging off distribution of the relief materials to beneficiaries in Kano.\nAbba Kabir-Yusuf of Kano state commended the Federal Government and NEMA for the timely intervention.\n“979 households each from 20 local government area will benefit, while Kano Municipal and Tarauni local government were allocated 1,520 households respectively.", "98": "Smart Olalekan Edwards, argued that the decision to allocate the monies to the states was indicative that President Bola Ahmed Tinubu remains a listening leader.\nExpressing optimism that Wike would address the infrastructural deficits in the FCT, the group charged the newly appointed Ministers to join President Tinubu to address the socioeconomic challenges besetting the country.\nPresident Bola Ahmed Tinubu has played his part, he has both the mandatory role to supervise and be responsible for successes and failures.\n“You have Singapore, Rwanda, China before you as examples, this is a different journey; the President wants delivery, Nigerians want results.\n“Please turn around our educational Sector, explore our Sports capabilities, encourage our digitalization and innovations to the Moon.", "99": "Expressing optimism that the ex-governor would address the infrastructure deficit in the FCT, the group charged the new ministers to support the President in addressing the nation’s socio-economic challenges.\nYou are 45 of the best among us, do not be a disgrace to us, globally, collectively and Individually.\nWe won’t tolerate failure.\nPresident Tinubu has played his part, he has both the mandatory role to supervise and be responsible for successes and failures.\nNigeria must be greater, you have been burdened with the tasks to lead us to our destination, we will follow, lead us well.”", "100": "In an open letter to President Bola Tinubu, South-South Elders Progressive Forum (SSEPF) blamed progressive decline in crude oil production output on the withdrawal of support for multinational oil companies operating in the Niger Delta region by locals in oil-bearing communities.\nThey withdrew their support because they feel they were not being carried along by the Federal Government and its agencies.\nThey no longer see themselves as under any obligation to protect oil facilities in their areas, including fighting crude oil theft.\nThe letter was signed by Chief Jolomi Ande and Dr. Benedict Akparanta, Chairman and Secretary General respectively.\n“It is in this regard that we write you this letter highlighting some recent anomalies that could mar efforts of your administration, particularly towards improving the dwindling crude oil production output and to proffer solutions on how to remedy the situation, which had adversely affected the nation’s oil earnings.", "101": "“Just when residents of Enugu State felt that their suffering was endless, our amiable Governor brought succour.\nThis, he did by setting up a committee for the procurement, storage and distributions of the relief items to the citizens.\nThe Palliative Committee has the chairman, Association of Local Governments in Nigeria (ALGON), Enugu State, and chairman of Nkanu East Local Government Area, Hon.\nOkechukwu Sydney Edeh; ALGON Deputy Chairman and Chairman of Uzo Uwani Local Government Area, Hon.\n“It is also quite commendable that since the assumption of office, Governor Mbah has embarked on numerous people-oriented policies, programmes and projects to take the state to the next level of development.", "103": "Metro Police arrest seven cultists, recover four corpses in Ogun 4 mins ago The Ogun State Police Command has arrested seven suspected cultists and recovered arms, ammunition, and assorted charms in Sagamu.\nOdutola… FacebookTwitterWhatsAppTelegramNational Restructuring: NNPCL retires management staff 1 hour ago The Nigerian National Petroleum Company Limited (NNPC Ltd.) says its Management Staff with less than 15 months to statutory retirement will be exiting the company effective Sept. 19, 2023.\nThe company made this known on Tuesday on its official X handle formerly known as Twitter.\nIn a statement on his X handle, Police spokesperson Olumuyiwa Adejobi said the officers along with their Commander are currently in Police Headquarters in Abuja.\nThe Tribunal, led by Justice Benson Ogbu, ordered that the certificate of return be retrieved from Akila and returned to Emmanuel George of the All Progressives Congress (APC).… FacebookTwitterWhatsAppTelegram", "106": "Residents of Olomore, Soyoye and Ogun radio areas of Abeokuta have heaved a sigh of relief, following the arrest of a member of a four-man armed robbery gang and Eiye Confraternity cult terrorising the community.\nThe Guardian learnt that the gang specialised in dispossessing unsuspecting road users of their belongings, house breaking and armed robbery.\nConfirming the arrest, yesterday, spokesperson for Ogun State Police Command, Superintendent of Police (SP), Omolola Odutola, said the suspect has made confessional statements implicating other three members of the armed robbery gang, who are now at large.\nOmolara reassured residents of the commitment of the state Commissioner of Police (CP), Olanrewaju Yomi Oladimeji, to zero tolerance for cultism and armed robbery.\nShe said: “The Area Commander in charge of the area has directed a manhunt for the remaining suspects to be arrested.", "107": "After years of suffering from lack of portable water, relief finally came the way of the Odo community in Odogbolu Local Council of Ogun State, following the commissioning of a borehole and water reservoir donated to the community.\nOn her part, Iya Egbe Tobalase Akile Odogbolu, Alhaja Folashade Oshiyemi, said the donation would reduce cases of waterborne diseases in the community.\nOshiyemi also harped on the importance of public-private partnership in providing essential services to communities.\nOluwaseun Adekunmi (HOA) Foundation, Oluwaseun Oguntade, commended Idowu for the gesture and called on members of the community to maintain the facilities properly.\nOguntade also called on other public-spirited people to engage in philanthropy in order to empower others.", "109": ".Subsidy removal: NLC advocates more modular refineries in Edo, lauds gov’s interventionThe Edo State chapter of Peoples Democratic Party (PDP), yesterday, said the rift between the governor, Godwin Obaseki, and his deputy, Philip Shaibu, would be resolved soon.\nChairman of Edo PDP, Tony Aziegbemi, gave the assurance during a media briefing to announce activities ahead of the September 2 council elections in the state.\nSo, as a party, we will control it; we have it under control.\nIn another development, the Chairman of Nigeria Labour Congress (NLC), Edo State chapter, Odion Olaiye, has called on the Federal Government to issue more modular refinery licences to operators in the state to increase their output.\nOlaiye noted that the state is already leading the charge of boosting local production of refined petroleum products.", "112": "The National Chairman of Tinubu Support Network (TSN) and Director-General of Amalgamated APC Support Groups, Engr.\nKailani Muhammad has asked Kaduna state Governor, Mallam Uba Sani to nominate him as minister from the state, to replace the former governor, Masir El-Rufai who withdrew intrest last month.\nThe APC chieftain said they are happy that the immediate past Governor of Kaduna Malam el-rufai did not make the cabinet of President Bola Ahmed Tinubu.\n“Nigeria will be a Haven under Tinubu” while urging all and sundry to give him maximum support to reposition the country.\nHe however urged them to join hands with President Tinubu to build a virile country that even generations yet unborn will benefit.", "118": "Asiwaju Bola Tinubu was sworn in as the President of Nigeria on May 29, 2023, following his victory in the February 25 presidential elections conducted by the Independent National Electoral Commission (INEC).\nTinubu would be celebrating his first democracy day as the President of Nigeria on Monday, June 12, and as earlier reported by Naija News, he would address the people of the country by 7:00 am.\nThis would mark the first official nationwide broadcast to Nigerians since President Tinubu assumed office on May 29, 2023.\nAhead of his nationwide address, below are some major steps and actions President Tinubu has taken since he assumed office about thirteen days ago.\nHeld a security meeting with the nation’s service chiefs, heads of security agencies, and the National Security Adviser (NSA).", "119": "The President Bola Tinubu-led Federal Government has announced that it will consider list of demands from the Trade Union Congress (TUC) which includes minimum wage.\nNaija News reports that the present administration made this known after its meeting with the Trade Union Congress of Nigeria (TUC) at the State House, Abuja.\nAlake said: “Well, as you all know, we had this reconvened meeting today as we promised you few days ago when we had the initial meeting with the Labour movement.\n“The TUC that attended today’s meeting presented a list of demands and those demands we have studied and we are going to present to Mr President, for his consideration.\nThe most important is the minimum wage, that is increase of minimum wage.", "120": "There should not be VAT on pms, but states should be allowed to tax pms consumption within their boundaries.\nYou will soon understand why@officialABAT and overtaxing are inseparable sesame twins.\nSo, 7.5% VAT has been implemented with immediate effect!!\nNow, there is a recent addition of 7.5% Vat on petrol prices.\n@aai_austin – “The supposed 7.5% VAT on petrol shouldn’t be a problem for anyone who voted the APC”.", "121": "Good morning Nigeria, welcome to Naija News roundup of top newspaper headlines in Nigeria for today, Friday, 14th July 2023President Bola Tinubu has announced a state of emergency on food security within Nigeria.\nThe Senate on Thursday confirmed the appointment of the nation’s service chiefs and the Chief of Defence Staff appointed by President Bola Tinubu.\nThe House of Representatives has made adjustments to the 2022 supplementary appropriation act to accommodate President Bola Tinubu’s request.\nPresident Bola Tinubu has expressed his government’s commitment to liberating Nigeria from influential forces that have hindered the country’s progress.\nIn conclusion, President Tinubu acknowledged the women’s support during the 2023 elections, stating that they all deserve awards for their efforts.", "122": "The Senate on Thursday confirmed the appointment of the nation’s service chiefs and the Chief of Defence Staff appointed by President Bola Tinubu.\nThis follows the conclusion of their screening before the lawmakers at the Senate Chamber.\nDuring the screening which was held behind closed doors, the security chiefs briefed the Senate on their career progression and pledged to meet national expectations of ensuring security and defending the nations’s territorial integrity.\nHouse Of Rep Approves President Tinubu’s Request For 500 Billion Naira Palliative FundThe House of Representatives has made adjustments to the 2022 supplementary appropriation act to accommodate President Bola Tinubu’s request.\nThe legislators also urged President Tinubu to use the funds as conscientiously as possible.", "124": "The Bola Ahmed Tinubu-led federal government has begged the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC) to shelve its planned strike scheduled to start next Wednesday.\nNaija News reports that the FG appealed during a meeting on Wednesday between government representatives and organized labour.\nShe pleaded with labour to give the federal government more time to look into its grievances rather than embark on industrial action.\nAsked about the agenda of the meeting, she said: “It involves labour and some parts of government, it’s a steering committee.\nBut we are making progress; we’re trying to address the issues that will prevent a strike.", "125": "The Trade Union Congress of Nigeria (TUC) issued a warning yesterday to the Federal Government.\nThe union set a two-week deadline for negotiations to be concluded, threatening to initiate protests otherwise.\nTUC President, Festus Osifo, speaking to journalists in Abuja, cautioned that if no significant progress is made by August 19, the union would feel compelled to take further action.\nWe also have technical committees on education health and Mass Transit.\nOur position is that the government should fast-track action and processes to ensure that the sufferings of Nigerians are ameliorated.", "126": "Naija News reports that there has been a hike in petrol pump price from N500 per litre to N617 per litre.\nReacting to the situation, Onanuga urged Nigerians to be patient with President Bola Tinubu.\nSpeaking via Twitter, the APC chieftain pleaded with Nigerians to wait for the promised palliatives.\nHe opined that it is impossible for a country to go through progress without experiencing some pains.\nMy people, patience, patience please.", "127": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has criticized President Bola Tinubu, saying he hasn’t displayed enough interest in restoring the country’s refineries.\nHe noted that pain and hardship will continue in the country until President Tinubu takes the step to fix Nigeria’s refineries.\n“I’m beginning to think that Mr President has an interest in the foreign refineries that Nigeria is buying Fuel from.\nIn his 13 minutes speech, nothing was said about fixing Nigeria’s refineries, then I asked myself who are the advisers of Mr President?\n“The address of Mr President doesn’t contain the solutions to Nigeria’s current economic conditions and the Problems, pains and Hardship will definitely continue until Nigeria’s refineries are functional.”", "130": "The Senate has reacted to the ongoing nationwide protest by organized labour, including the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC).\nNaija News reported earlier that the Abuja chapter of organized labour, on Wednesday, stormed the National Assembly complex and, in the process, broke down the entrance gate.\nUpon their arrival at the NASS Complex, the protesters pulled down the first gate of the Complex after security agents attempted to stop them and marched to the premises forcefully.\nNdume, alongside two other lawmakers — Senator Ireti Kingibe and Senator Tony Nwonye — later met with the protesters at the National Assembly.\nThe Senators were seen engaging Nigeria Labour Congress (NLC) President Joe Ajaero; and his TUC counterpart, Festus Osifo.", "131": "The presidential candidate of the Social Democratic Party (SDP) in the February 2023 elections, Adewole Adebayo has charged President Bola Tinubu to do better with the recommendation for Nigerians to dump petrol for Compressed Natural Gas (CNG) in using their vehicles.\nAccording to Adebayo, President Tinubu can’t be telling Nigerians to adopt CNG while he and others with him in government continue running their cars on petrol.\nThe former presidential candidate said Tinubu must lead by example in the charge for the adoption of CNG.\nHowever, Adebayo in his submission noted that the government has failed to come up with any clear-cut policy on CNG and how to drive the policy adoption.\nThey can provide alternatives, which is the Compressed Natural Gas (CNG) that they are talking about.", "133": "The leadership of the House of Representatives has set aside N150 million for each member to carry out projects in their constituencies, totalling N54 billion.\nThe lawmaker said the constituency allowances are part of the few privileges available to lawmakers to impact their various constituencies directly.\nHe said, “In the House of Reps, our constituency allowance is N150m.\nThis is the only opportunity we have to help our constituencies with one or more projects.\nMany of us often use our money to do all the projects that we do for our constituencies.", "134": "Naija News reports that President Bola Tinubu celebrated his 100 days in office on Wednesday, September 6.\nReacting to Tinubu’s one hundred days in office, the filmmaker said some Nigerians are still wholeheartedly defending what he termed ‘Old Testament’ levels of suffering.\nHe wrote: “Still, after 100 days of renewed shege.\nFolks are wholeheartedly defending Old Testament levels of suffering.\nNaija News reports that Oguntoyinbo, in a statement on Wednesday, criticised President Tinubu over failure to kick start his campaign promises on a good note.", "135": "Following its two-day nationwide warning strike on the 5 and 6 September, the Nigeria Labour Congress (NLC) has threatened to begin an indefinite strike, should the federal government fail to meet its demand at the end of the 21-day ultimatum.\nRecall that the NLC President Joe Ajaero had revealed that the National Executive Council of the labour union, in its last meeting, resolved to embark on an indefinite strike after a given 21-day ultimatum which ends in a week.\nThe union had also accused the government of implementing what it describes as bad policies of the new administration under President Bola Tinubu.\nHe said, “We sent the letter to the Federal Government on September 1, 2023, so by September 22, 2023, the 21-day ultimatum will end.\nNLC calls Nigerians to join hands together because they cannot do it alone.", "142": "“The Christian Association of Nigeria, therefore, commends the administration of President Bola Ahmed Tinubu for showing commitment towards building a united, peaceful, and progressive Nigeria.\nIt is, therefore, imperative that economic policies are formulated and implemented with utmost care and consideration for the prevailing hardships experienced by Nigerians.\nIt is pertinent to develop comprehensive economic policies that promote inclusive growth, job creation, and social well-being.\n“Government must listen to the concerns of the Nigerian people and implement sound economic policies that prioritize the well-being of all citizens.\nBy addressing the prevailing hardships caused by the recent fuel price hikes and high inflation, we can pave the way for a brighter future for Nigeria.", "143": "The House of Representatives has debunked media reports credited to the National Assistant General Secretary of the Nigeria Labour Congress (NLC), Christopher Onyeka, that its members received N100 million as palliatives from the executive arm of government.\nRotimi said Oyenka lied in his claim that the Federal Government had given N100 million to National Assembly members as palliatives.\nHe noted the claim was malicious and demanded an immediate retraction of the ‘lie’ and a public apology from NLC.\n“We state categorically that Mr Onyeka lied in his claim that National Assembly members were given N100 million as palliatives.\n“For the avoidance of doubt, at no time did members of the House of Representatives receive any money from the executive arm as palliatives.", "144": "The National Industrial Court has granted an interim order restraining the Nigeria Labour Congress (NLC) and Trade Union Congress (TUC) from going on strike from Wednesday as planned, until the determination of the motion on notice.\nJustice O. Y. Anuwe issued the order today and adjourned further hearing till 19 June.\n*It is ordered that the defendant/ respondents be immediately served with the originating processes in this suit, the motion on notice and the order of this court hereby made.\n*The motion on notice is hereby fixed for a hearing for 19th June 2023.\n“In my view, this is a situation of extreme urgency that will require the intervention of this court.”More to come…", "145": "President Bola Ahmed Tinubu on Monday addressed Nigerians in a nationwide broadcast.\nRead full broadcast below:TEXT OF THE NATIONAL BROADCAST BY PRESIDENT BOLA TINUBU TO NIGERIANS ON CURRENT ECONOMIC CHALLENGES.\nSuch a vast sum of money would have been better spent on public transportation, healthcare, schools, housing and even national security.\nIt diverted money that should have been used to create jobs, build factories and businesses for millions of people.\nWith the fund, our states will become more competitive and on a stronger financial footing to deliver economic prosperity to Nigerians.", "146": "Former president Olusegun Obasanjo has accused Muhammadu Buhari of spending recklessly during his time as president of Nigeria.\nAccording to the former nation’s leader, he stated that he knew Buhari did not understand economics but he had no idea that he could be such a reckless spender.\nLamenting over the debt burden in the country, Obasanjo argued that no one is ready to offer debt relief anymore.\nAccording to Obasanjo, “Tinubu said the other day that it was unacceptable that he would spend 90% of his revenue to service debts.\nDo you think that anybody would give you debt relief today?", "147": "Coach Nduka Ugbade said he is relieved after the Golden Eaglets of Nigeria defeated South Africa 3-2 on Saturday to advance to the U-17 Africa Cup of Nations quarterfinals.\nThe Golden Eaglets of Nigeria bounced back to winning ways after falling 1-0 to Morocco in their second game of the competition’s group stage.\nNigeria finished second in Group B and qualified for the knockout round thanks to the thrilling win.\nHe said, “It was a really tough match because South Africa is a really good team and they gave us a tough time.\nWe realized that it was purely psychological and we talked to the players and we saw an improvement today.", "148": "President Muhammadu Buhari has urged the developed world to provide duty-free and quota-free market access to ensure that goods from the world’s 46 least developed countries are incorporated into regional and global value chains.\nPresident Buhari stated this in the UN Conference on Least Developed Countries, which took place in Doha, Qatar.\nPresident Buhari was quoted as saying: “In 2015, the world came together to endorse the 2030 Agenda for Seventeen Sustainable Development Goals.\n‘‘The Least Developed Countries are often faced with developmental vulnerabilities and challenges that are not always of their making.\nPresident Buhari claims that despite having made the fewest contributions to the causes of climate change, LDCs continue to suffer disproportionately from it.", "149": "Nigerians have reacted to the meeting between President Bola Tinubu and human rights lawyer, Femi Falana (SAN), at the Presidential Villa in Abuja on Saturday.\nFollowing the development, some Nigerians took to social media to express their reactions to the meeting between President Tinubu and Falana.\n@jidemosas wrote: “Falana had always been NLC lawyer and he had always represented them in courts.\nFalana will change the frequency immediately.”@gee_greatgee wrote: “Is Falana an economist?\nAfter all, it’s an open secret that Femi Falana is one of the lawyers serving & protecting the socio-economic and political interests of Bola Tinubu.", "150": "The Nigerian National Petroleum Company (NNPC) has made a move to terminate its crude oil swap contracts.\nIt will instead opt to pay cash for petrol imports, according to a report by Reuters.\nThis comes as the NNPC intends to pay for its petrol purchases in cash by ending its crude swap contracts.\nDiscussing Nigeria’s production capacity, Kyari disclosed that the country’s total crude oil output was 1.56 million barrels per day (bpd) as of last Friday.\nIn April 2023, Nigeria’s oil production dropped below one million bpd, marking a 21.26 per cent decrease compared to March.", "151": "President of the Academic Staff Union of Universities (ASUU), Prof. Emmanuel Osodeke, has voiced disagreement with the Federal Government’s move to remove fuel subsidies on Wednesday.\nOsodeke, during his address at the inaugural public lecture and ground-breaking ceremony of the Alex Ekwueme Federal University Ndufu-Alike Ikwo (AE-FUNAI) ASUU Branch’s Secretariat, highlighted the government’s refusal to renovate the country’s refineries.\nThey deliberately refused to maintain the ones they have.”Osodeke also expressed concern about the country’s education sector.\nFollowing the lecture titled “Reinvesting Nigerian Universities for Research and Development: The ASUU Perspective”, the immediate past ASUU President, Prof. Biodun Ogunyemi, joined the call for the Federal Government to reevaluate its approach to the education sector.\nASUU was negotiating with the government on how to arrest brain drain, how to restore quality, and how to revamp the facility.", "152": "The President of the Nigerian Labour Congress (NLC), Joe Ajaero, has dismissed reports that the Labour Party (LP) tells the union what to do.\nSpeaking during an interview on Channels Television, Ajaero said the formation of the Labour Party from the NLC does not imply that the party holds any authoritative control over their actions.\n“The fact that we formed Labour Party does not mean that if it does anything wrong, and is an insult to say that Labour Party is now dictating for NLC that formed it?\n“If people are going into blackmail, it should not be such, we determine what happens in Labour Party to a large extent.\nWho is Labour Party and their candidate to tell NLC what to do?", "153": "The Trade Union Congress (TUC) said it agreed to shelve the strike plan because the Bola Tinubu-led federal government was ready to accept all its demands.\nBut after marathon meetings with representatives of the Bola Tinubu-led administration, NLC, and TUC shelved the planned industrial action.\nAmong the demands put forward by the TUC was the payment of a new minimum wage of N200,000.\nSpeaking in an interview on Tuesday, TUC Secretary General, Nuhu Toro, said: “Sincerely, we went into the meetings or negotiations with the government and they accepted all our demands.\nThe essence of an ultimatum is to get the government’s attention to present our demands which we did.", "154": "The organized Labour will again meet with the representative of the Bola Tinubu-led Federal Government at the Presidential Villa, Abuja on Monday, June 26.\nEtim added that organised labour will send a list of its members who will form part of the subcommittees of the main steering committee.\nDuring our last meeting, the special adviser to the president on energy unveiled a roadmap but the terms of reference were not unveiled.\nSo labour asked that it be shared so that we can also put in our inputs.\nWe will also send a list of our members who will form part of the subcommittees of the main steering committee.”", "155": "The President Bola Ahmed Tinubu-led Federal Government has approved six new companies to import petroleum products into Nigeria.\nNaija News reports that this was made known to State House correspondents by the Managing Director of Nigeria Mainstream and Downstream Petroleum Regulatory Authority (NMDRA), Farouk Ahmed, at the Presidential Villa.\nAhmed denied reports that the Nigerian National Petroleum Company Limited (NNPCL) had approved Dangote Group to import petroleum, stressing that the company has no powers to give such approval.\nAccording to the NMDRA MD, apart from the approved six, several companies applied for permits to import petroleum in due course.\nAhmed said, “There are six companies who said they want to import fuel in July.", "156": "The Bola Tinubu-led Federal Government and organized Labour reconvened at the Presidential Villa, Abuja on Monday.\nHe said: “As we promised the last time we met; when labour called off their planned strike, we held a meeting today.\nWe went through all the demands that labour had tabled, that is government and the labour unions last time.\nAlake said: “Work groups have been constituted at today’s meeting.\nThere is a steering committee that will serve as a clearing house and there are other committees comprising both parties; government and labour.", "157": "The Nigeria Labour Congress (NLC) has insisted on going on its scheduled strike, which commences on August 2, 2023.\nThe labour union has said the strike is their way of rescuing Nigerians from the shackles of the government’s ‘poor policies.’The NLC president, Joe Ajaero, while featuring on Channels Television’s Politics Today on Wednesday, said the strike is to liberate Nigerians from policies of the new administration that has caused hardship.\nNaija News recalls that the labour union earlier gave the government a seven-day ultimatum to reverse what it described as “all anti-poor” policies, including the hike in the price of Premium Motor Spirit (PMS), known as petrol.\nThe impact we are talking of is either the impact on commodities or the impact on the people.\n“The naira is gone, economic activity is gone, foodstuff gone.", "158": "The Nigerian National Petroleum Company Limited (NNPCL) has said the outstanding N1.3tn debt of the Federal Government has nothing to do with the payment of dividends to the federation.\nIn June this year, the national oil company revealed that it was expecting a refund of about N1.3tn from the Federation Account as debt by the Federal Government.\nIt disclosed this when the inter-agency committee constituted by President Bola Tinubu was set to commence sitting to resolve the lingering debt row.\nMuhammad said the payment of dividends had nothing to do with the N1.3tn debt of the Federal Government to the national oil company.\n“Dividend payment is on projected profit and has nothing to do with the outstanding N1.3tn owed to the NNPC Ltd,” he said.", "159": "CNG-Powered Mobility vs. Electric Options: A Glimpse into the FutureThe remarks made by the VP shed light on the ongoing debate over the choice between CNG-powered vehicles and electric alternatives.\nIt is undeniable that electric vehicles represent a significant leap towards a sustainable and environmentally friendly future.\nReviewing the Mobility Industry: The Long-Term Triumph of Electric VehiclesIn the face of mounting environmental concerns and increasingly stringent emission regulations, the mobility industry is at a critical juncture.\nThe signs indicate that electric vehicles are destined to be the long-term winners in this race.\nAs a result, the electric vehicle ecosystem has become a dynamic and robust landscape, well-positioned to revolutionize the mobility industry.", "160": "The media and publicity adviser to President Bola Tinubu, Ajuri Ngelale has assured workers of a significant salary increase with the implementation of the new minimum wage.\nDuring an interview on Channels TV’s Politics Today, Ngelale stated that workers should expect their current salaries to at least double once the new minimum wage comes into effect.\nI mean doubling of the current minimum wage.\n“As of June 36 states have received N300 billion more than they had received in any previous month in the last two years.\nStates have all agreed during the last NEC meeting that they would support the new minimum wage.”", "161": "Popular Nigerian TV host, Rufai Oseni has claimed that the President Bola Tinubu-led administration has began subsidizing fuel again.\nThe political analyst stated this while reacting to the promise of the president that there will no longer be a hike in fuel price.\nAccording to him, “If the pump price is not increased with international increase in the price then we are subsidizing petrol again.\n“How can you deregulate a sector and the president fixes price oo.What happens to market forces?\n“Subsidy don return oo.How come na Oga Dey fix price of petrol wey dem don deregulate!", "162": "Indications have emerged that oil marketers might be losing hope for local refining of fuel soon, as the 650,000 barrels per day Dangote Refinery is yet to commence any local production even after a promised deadline.\nThe situation has sent a not-too-good signal to the oil industry as stakeholders were much expectant, and hopefully, the start of local production by the facility would bring succour to Nigerians.\nA top source among the Major Oil Marketers Association of Nigeria (MOMAN) confirmed this development, saying the NNPCL had indeed cut down importation with the hope of Dangote refinery pushing out some product last month.\nMeanwhile, amidst all this agitation, Dangote Refinery has remained mum over the issue, as officials of the Communications Department of the facility could not give any concrete explanation.\nBut a source at the refinery told The Punch that the management was unsure of when petrol refining would begin at the Ibeju-Lekki facility.", "163": "President Bola Ahmed Tinubu on Wednesday met with Senate President Godswill Akpabio alongside some state governors.\nNaija News gathered that the meeting is in continuation of the president’s consultation with key players on how to get the economy on sound footing.\nThose at the meeting include Vice President Kashim Shettima, Governors Babajide Sanwo-Olu, Hope Uzodinma, Abdulrahman Abdulrazaq, and Dapo Abiodun of Lagos, Imo, Kwara, and Ogun States, respectively.\nFormer governor Abdullahi Ganduje of Kano State was also part of the meeting.\nThe presidency had earlier proposed the distribution of grains and fertilizers to farmers as part of measures to boost food security in the country.", "165": "Vice President, Kashim Shettima is leading the second National Economic Council (NEC) meeting at the Presidential Villa in Abuja.\nThe NEC comprises the governors of all 36 states, finance ministers, the Central Bank of Nigeria’s governor, and the Group Chief Executive Officer of the Nigeria National Petroleum Company Limited (NNPCL), Mele Kyari, among others.\nThe meeting, which was scheduled to start at 11 a.m., had early attendees that included Governor Ademola Adeleke of Osun State, Nasarawa state Governor Abdullahi Sule, and the deputy governor of Enugu State, Barrister Ifeanyi Ossai.\nGovernors Inuwa Yahya of Gombe State, Dauda Lawan of Zamfara, Dikko Radda of Katsina, Abdulrahman Abdulrazak of Kwara, Dr. Alex Otti of Abia, and Babajide Sanwo-Olu of Lagos State were also in attendance.\nHyacinth Alia of Benue, and Senator Hope Uzodimma of Imo.", "166": "The states that filed a suit before the Supreme Court seeking the nullification of the victory of the President-elect, Bola Tinubu of the All Progressives Congress (APC) have withdrawn their suit.\nNaija News gathered they withdrew their suit on Friday, 3rd March and filed a notice of discontinuance of the case.\nThe states, Adamawa State, Akwa Ibom, Bayelsa, Delta, Edo, Taraba, and Sokoto took the action through their team of lawyers led by Chief Mike Ozekhome (SAN).\nThey argued before the apex court that INEC breached the provisions of the Electoral Act in collating and announcing the outcome of Saturday, February 25 Presidential and National Assembly elections.\nSections 25 (1), (2) and 3; Sections 60 And 66 Of The Electoral Act, 2022.", "167": "The newly elected Senate President, Godswill Akpabio on Tuesday stated that under his leadership, the national assembly will back President Bola Tinubu’s plan to remove petrol subsidies.\nAkpabio, representing Akwa Ibom north-west, was voted in as Senate President on Tuesday with 63 votes, defeating his competitor, Abdulaziz Yari, who received 46 votes.\nIn his acceptance speech, Akpabio emphasized that the 10th assembly would be proactive, supporting the president’s policies and initiatives.\nDespite President Tinubu and the All Progressives Congress (APC) endorsing Akpabio for the role of Senate President, Akpabio maintained that the Senate will not serve as a rubber stamp to the executive, preserving its independence.\nHighlighting the independence of the legislature, Akpabio declared that the 10th assembly is dedicated to “Nigeria and Nigerians”.", "168": "President Bola Ahmed Tinubu on Wednesday met with Senate President Godswill Akpabio alongside some state governors.\nNaija News gathered that the meeting is in continuation of the president’s consultation with key players on how to get the economy on sound footing.\nThose at the meeting include Vice President Kashim Shettima, Governors Babajide Sanwo-Olu, Hope Uzodinma, Abdulrahman Abdulrazaq, and Dapo Abiodun of Lagos, Imo, Kwara, and Ogun States, respectively.\nFormer governor Abdullahi Ganduje of Kano State was also part of the meeting.\nThe presidency had earlier proposed the distribution of grains and fertilizers to farmers as part of measures to boost food security in the country.", "169": "The Lagos State Government has closed the Eko Bridge inwards of the newly re-opened Apongbon Bridge for immediate repairs.\nThis platform understands that the closure is for immediate remedial palliative works by the Lagos State Public Works in conjunction with the Federal Ministry of Works and Housing.\nToriola, however, confirmed that the Lagos State Traffic Management Authority (LASTMA) Personnel have been deployed to control and manage traffic around C.M.S, Marina, Ijora, and other alternative routes on the Lagos Island and Mainland.\nMotorists from Mainland/Surulere going to Lagos Island are advised to make use of Ijora-Olopa/Causeway to Carter Bridge (Idumota) to connect their desired destinations or connect Costain to Iganmu through Ijora-Oloye via Ijora Causeway to Carter Bridge (Idumota), for their desired destinations.\nMotorists from Lagos Island going to Surulere/Mainland are advised to connect Carter Bridge (Idumota) through Iddo/Oyingbo to Herbert Macaulay for their desired destinations;Connect Carter Bridge (Idumota) through Ijora Olopa by LAWMA Headquarters to Eko Bridge inwards Costain/Alaka for their desired destinations.", "170": "Naija News looks at the top happenings making headlines on the front pages of Nigeria’s national newspapers today Saturday 29th July 2023.\nSaturday PUNCH: Following the submission of the first set of ministerial nominees to the Senate, indications have emerged that President Bola Tinubu will restructure some of the ministries of the Federal Government by merging some, creating new ones and scrapping others.\nThe Nation: Lagos Governor Babajide Sanwo-Olu has forwarded the list of commissioner-nominees to the House Assembly for screening and confirmation.\nWhile some of the immediate past members of the State Executive Council returned, many did not return.\nThank you for reading, that is all for today, see you again tomorrow for a review of Nigerian newspapers.", "171": "The planned closure of some parts of the Third Mainland Bridge by the Lagos State Government for some repairs has been indefinitely postponed.\nThe Lagos State government hitherto had planned to close down the bridge for two Sundays for palliative works to be carried out on the bridge, Naija News reports.\nOn Friday, the Lagos State government announced that the bridge would be closed on 17th and 24th September, 2023, from 7.00 a.m. to 7.00 p.m. each Sunday.\nHowever, in a fresh development, the Lagos government announced a shift in the closure of the bridge on Saturday.\nThe commissioner explained that the rain has affected the preliminaries of the planned palliative works on the asphalt pavement of the bridge by the Lagos State Public Works Corporation, making it impossible for anything to be done for now.", "172": "To minimize motorist inconveniences, the Lagos State Government, through the state Public Works Corporation (LPWC) in collaboration with the Federal Ministry of Works and Housing, has announced that the Third Mainland Bridge will be shut for two consecutive Sundays.\nToriola explained that the palliative works were scheduled for Sunday 17 and Sunday 24, September, 2023, between the hours of 7.00 am to 7.00 pm.\nToriola advised motorists to ply the following alternative routes made available during the rehabilitation works, which are Scene 1, Lagos-Ibadan Expressway, Alapere/Ogudu axis inwards Lagos Island will be diverted towards Gbagada-Oshodi Expressway to link Ikorodu Road/Funsho Williams Avenue to access Eko Bridge and Lagos Island.\nFor scene 2, motorists from Lagos Mainland going through Herbert Macaulay Road (Adekunle axis) inwards Lagos Island via Third Mainland Bridge will be diverted towards Muritala Mohammed Way to use Carter Bridge to link Lagos Island.\nHe further urged motorists to be patient and observe safety measures during the palliative works on the asphalt pavement of the bridge.", "174": "The Chairman of the Lagos State Parks and Garages (LASPG), Alhaji Musiliu Akinsanya (MC Oluomo), has disclosed that transporters in the state would not be joining the planned protest by the organised labour.\nHe said commercial bus drivers, motorcycle (okada), and tricycle (Keke Marwa) operators would pay less for bookings at their various parks now, citing that where they hitherto paid N800, they would pay N600 now.\n“The Lagos State government has provided a conducive atmosphere for our operation.\n“We have also embarked on internal measures like downward reviews of Lagos State government and union tickets.\n“We at the Lagos State Parks and Garages, therefore, unequivocally say no to any form of strike or protest by the organised labour or any group.", "175": "He wrote; “President Bola Tinubu is making the right calls.\nHe turned Lagos into the 6th largest economy in Africa, and now he is in charge of the largest economy in Africa.\nMr Common sense that has no common sense.”@mysterypositive wrote: “This man has no integrity….\nOga common sense have you abandoned Atiku and the PDP so fast?\n@wenzyo wrote: “Can we assert with certainty that Nigeria is the largest economy in Africa?", "176": "Vice President, Kashim Shettima is leading the second National Economic Council (NEC) meeting at the Presidential Villa in Abuja.\nThe NEC comprises the governors of all 36 states, finance ministers, the Central Bank of Nigeria’s governor, and the Group Chief Executive Officer of the Nigeria National Petroleum Company Limited (NNPCL), Mele Kyari, among others.\nThe meeting, which was scheduled to start at 11 a.m., had early attendees that included Governor Ademola Adeleke of Osun State, Nasarawa state Governor Abdullahi Sule, and the deputy governor of Enugu State, Barrister Ifeanyi Ossai.\nGovernors Inuwa Yahya of Gombe State, Dauda Lawan of Zamfara, Dikko Radda of Katsina, Abdulrahman Abdulrazak of Kwara, Dr. Alex Otti of Abia, and Babajide Sanwo-Olu of Lagos State were also in attendance.\nHyacinth Alia of Benue, and Senator Hope Uzodimma of Imo.", "177": "The states that filed a suit before the Supreme Court seeking the nullification of the victory of the President-elect, Bola Tinubu of the All Progressives Congress (APC) have withdrawn their suit.\nNaija News gathered they withdrew their suit on Friday, 3rd March and filed a notice of discontinuance of the case.\nThe states, Adamawa State, Akwa Ibom, Bayelsa, Delta, Edo, Taraba, and Sokoto took the action through their team of lawyers led by Chief Mike Ozekhome (SAN).\nThey argued before the apex court that INEC breached the provisions of the Electoral Act in collating and announcing the outcome of Saturday, February 25 Presidential and National Assembly elections.\nSections 25 (1), (2) and 3; Sections 60 And 66 Of The Electoral Act, 2022.", "179": "But reacting in a statement on Thursday, Idris stated that he was not surprised by the statement credited to the Edo State Governor.\nRather than delving into narratives that do not provide the complete picture, the focus should be on how the Edo State Government will be using available resources to drive impactful projects that genuinely uplift the people of Edo State.\nThis vision is consistently echoed within the National Economic Council, where significant economic decisions are made.\nIt would be helpful if Governor Obaseki participated in these meetings to provide insights and align with the collective vision.\n“As President Tinubu has admonished, the time for politics and politicking is over.", "180": "The states that filed a suit before the Supreme Court seeking the nullification of the victory of the President-elect, Bola Tinubu of the All Progressives Congress (APC) have withdrawn their suit.\nNaija News gathered they withdrew their suit on Friday, 3rd March and filed a notice of discontinuance of the case.\nThe states, Adamawa State, Akwa Ibom, Bayelsa, Delta, Edo, Taraba, and Sokoto took the action through their team of lawyers led by Chief Mike Ozekhome (SAN).\nThey argued before the apex court that INEC breached the provisions of the Electoral Act in collating and announcing the outcome of Saturday, February 25 Presidential and National Assembly elections.\nSections 25 (1), (2) and 3; Sections 60 And 66 Of The Electoral Act, 2022.", "181": "The Nigeria Labour Congress (NLC), led by President Joe Ajaero, is presently engaging with federal government representatives in a meeting at the Presidential Villa in Abuja.\nPrevious discussions between the NLC and the government last Wednesday ended in stalemate and a rescheduled meeting was set for Sunday.\nHowever, the NLC declined to attend, alleging it was caught off guard by a new price template from the Nigeria National Petroleum Company Limited (NNPCL).\nThe NLC insisted that the government revert to the old fuel price before meaningful negotiations could take place.\nThe government’s team at the meeting comprises former Edo State governor Adams Oshiomhole, NNPCL Group Chief Executive Officer Mele Kyari, President’s Chief of Staff Femi Gbajabiamila, Hon.", "182": "President Bola Ahmed Tinubu on Wednesday met with Senate President Godswill Akpabio alongside some state governors.\nNaija News gathered that the meeting is in continuation of the president’s consultation with key players on how to get the economy on sound footing.\nThose at the meeting include Vice President Kashim Shettima, Governors Babajide Sanwo-Olu, Hope Uzodinma, Abdulrahman Abdulrazaq, and Dapo Abiodun of Lagos, Imo, Kwara, and Ogun States, respectively.\nFormer governor Abdullahi Ganduje of Kano State was also part of the meeting.\nThe presidency had earlier proposed the distribution of grains and fertilizers to farmers as part of measures to boost food security in the country.", "183": "A faction of the Labour Party (LP) led by Lamidi Apapa is opposing a nationwide protest proposed by the Nigerian Labour Congress (NLC).\nInstead, this faction suggests that Nigerian workers can express their discontent over the growing hardship in the country by not going to work until their demands are addressed by the Federal Government.\nThe National Publicity Secretary of the faction, Abayomi Arabambi expressed his concerns during a press briefing in Abeokuta, Ogun State.\n“Labour party agree with the NLC leadership only on all lawful demands but disagree totally with a resolution calling for mass action.\n“Workers can be called to embark on a strike by sitting at home until the Government meets their demands.”", "185": "President Bola Ahmed Tinubu on Wednesday met with Senate President Godswill Akpabio alongside some state governors.\nNaija News gathered that the meeting is in continuation of the president’s consultation with key players on how to get the economy on sound footing.\nThose at the meeting include Vice President Kashim Shettima, Governors Babajide Sanwo-Olu, Hope Uzodinma, Abdulrahman Abdulrazaq, and Dapo Abiodun of Lagos, Imo, Kwara, and Ogun States, respectively.\nFormer governor Abdullahi Ganduje of Kano State was also part of the meeting.\nThe presidency had earlier proposed the distribution of grains and fertilizers to farmers as part of measures to boost food security in the country.", "186": "The Peoples Democratic Party (PDP) Governorship Campaign Council in Imo State has urged residents of the state to turn down the alleged ‘Operation Show Your PVC’ for Palliative.\nThe PDP claimed that the move was a plot by the state governor, Hope Uzodinma, and leaders of the All Progressives Congress (APC) to hijack their Permanent Voters Cards (PVC) forcefully.\nThe opposition party gave this admonition on Wednesday in a statement made available to Naija News by Ikenna Onuoha, the Director, Media and Publicity Imo PDP (Sam-Jones) Governorship Campaign Council in Owerri, Imo State.\nThe party described the exercise as a Greek gift to expose their private identification Numbers to scavengers.\n“What this means is that Imo citizens who are members of other political parties like Labour Party, APGA, SDP, NNPP, PDP and others cannot partake.", "187": "Vice President, Kashim Shettima is leading the second National Economic Council (NEC) meeting at the Presidential Villa in Abuja.\nThe NEC comprises the governors of all 36 states, finance ministers, the Central Bank of Nigeria’s governor, and the Group Chief Executive Officer of the Nigeria National Petroleum Company Limited (NNPCL), Mele Kyari, among others.\nThe meeting, which was scheduled to start at 11 a.m., had early attendees that included Governor Ademola Adeleke of Osun State, Nasarawa state Governor Abdullahi Sule, and the deputy governor of Enugu State, Barrister Ifeanyi Ossai.\nGovernors Inuwa Yahya of Gombe State, Dauda Lawan of Zamfara, Dikko Radda of Katsina, Abdulrahman Abdulrazak of Kwara, Dr. Alex Otti of Abia, and Babajide Sanwo-Olu of Lagos State were also in attendance.\nHyacinth Alia of Benue, and Senator Hope Uzodimma of Imo."}