{"2": "In time past, palliatives included purchasing of mass transit buses, increments in the minimum wage, social investments and empowerment schemes for unemployed persons.\nWe need solidarity across the trade union movement and we need to continue the strikes until the government implements its agreements.\nDeputy General Secretary of the African Regional Organisation of the International Trade Union Confederation (ITUC-Africa), Akhator Joel Odigie, agrees that a good set of palliatives is desirable at this point.\nAccordingly, he rated increase in minimum wage highly; noting that payment of living wages helps fight poverty and inequality.\nMinimum wage is an anchor to prevent wages from falling to unacceptable levels,” he added.", "3": "Developed countries are increasing ship financing, especially with the move to green shipping, while Nigeria is yet to disburse the Cabotage Vessel Financing Fund (CVFF) to enable indigenous ship ownership to grow the industry.\nAccording to a recent Petrofin Index for Global Ship Finance report, financing for green shipping is on the rise.\nThe report noted that in terms of actual exposure, their portfolio amounts to $127.3 billion compared to $115billion in 2021.\nJapanese banks now also figure more prominently in global ship finance.\nAccording to Petrofin Research, the indicative figure for global ship finance, including all forms of lending such as leasing, export finance and alternative providers, is approximately $525 billion.", "5": "United Action Front of Civil Society has decried the N8,000 monthly handout proposed by the Federal Government, describing it as “another grand deceit for yet-to-be disclosed (or otherwise covertly selected) 12 million poor and vulnerable households”.\nHe said: “It is worrisome that the new administration is treading the erroneous indebtedness of its predecessor.\nThe United Action Front of Civil Society laments the reality of making the same poor citizens of Nigeria take the bitter pill of repaying a wrongheaded loan, supposedly being acquired in their interest, in the nearest future.\nHe added: “The United Action Front of Civil Society bemoans the ridiculous tokenism, which the new government is trying to foist on the country.\nIt is indeed unfortunate that the government could be contemplating a meagre N8,000 six-monthly handout per tiny fraction of the several millions of households across the country, at a time that a whooping N70 billion has been voted for 469 member-National Assembly.”", "7": "nless President Tinubu slows down on his economic policies, Nigeria may face drastic economic consequences, the President of the Chartered Institute of Taxation of Nigeria (CITN), Samuel Agbeluyi,said yesterday.\n“In order not to make the shock too drastic, we may need to slow down in the introduction of other policies.\nBut we will like to advice the government to be a little slow and not drastic in some of its decisions.\n“And what will benefit us most will not be to give N8,000 to 12 million people, rather it should be by providing transportation.\nIf you are able to improve our transportation system, it will have more positive impact on the system and the populace, than concentrating on 12 million people,” he stated.", "8": "Secondly, it is aware that Nigeria’s poorest of the poor cannot withstand a full blown free for all market forces.\n’’ Granted that social interaction by the Federal Government is desirable, Nigerian government has data challenges.\nWithout being able to identify poorest household and without credible data base, whatever money or support in kind that is given out would go down the drains’’.\nHe added: ‘’Some years back, a World Bank Report said that Nigeria is characterised by putting first thing last.\nHow else can one describe a situation of wanting to dish out palliative or support for the poor and the weak without a rigorous process in place to identify who they are?", "13": "Health Sector Reform Coalition (HSRC) has called on President Bola Tinubu to use, at least, N500 billion from funds earmarked for palliatives to provide health insurance coverage to an additional 30 million vulnerable Nigerians in the next 12 months.\nThe coalition said, at a rate of N15,000 per person, per year, N450 billion would cover the health insurance of 30 million vulnerable Nigerians.\nOffor urged the President to write his name in gold as father of Universal Health Coverage (UCH) in the country.\nBut when you spend N15,000 on health insurance for every Nigerian, in one year, they are sure of their health.\nWe are saying that 30 million vulnerable Nigerians can gain from this.", "20": "“The importance of stable electricity cannot be over-emphasised, as it will provide a broad-based succour to Nigerians.\nLocal refining of petroleum products will bring the process of production closer to the people, while making the products more affordable.\nYou don’t need an oracle to tell you that imported petroleum products will be far more expensive than the ones refined locally,” the communiqué said.\n“It is imperative that Warri Refinery be functional to support and boost supply of petroleum products, as well as create job opportunities for Deltans.\nIt said: “The money earmarked for such palliatives should be challenged into more positive ventures that will affect Nigerians across board.", "21": "An economist, Moses Umoru, has called for a new palliative system that would benefit all facets of the society, including the most vulnerable.\nHe said the planned palliative system targeted exclusively at the poor would be counterproductive and that a more comprehensive approach to intervention was needed.\nHe also called on the rich and middle classes to support the system, including reducing tax burdens and supporting employees during economic hardships.\nHe said there is increased pressure to lay off staff to reduce the cost during hardship.\nWith a more inclusive palliative system, Umoru believes that Nigeria can achieve greater prosperity for all.", "26": "UBI is a regular cash payment to all members of a community without a work requirement or other conditions.\nA universal, unconditional, individual, regular cash payment.\nIn other words, a universal, unconditional, individual regular cash payment.\nThe basic characteristics of UBI are periodic, it is a recurrent payment usually every month.\nBy making cash payment, it is possible for Nigerians to convert their benefits quickly into whatever they may desire.", "31": "Appointment call to higher service, Oborevwori tells new commissionersDelta State Governor, Sheriff Oborevwori, has announced the payment of N10, 000 to 50,196 personnel in the state public service, including employees of the 10 higher institutions in the state, for the next three months.\nWith the arrangement, those who work from Monday to Wednesday in one week will work Thursday to Friday the following week to ensure fairness and equity.\nThe schedule for officers from grade levels 15 and above is to be worked out by various Ministries, Departments and Agencies (MDAs) as it is suitable for them.\nHaving had consultations with the workers’ leadership at the local council level, the governor said he expected that local governments will implement the same palliative measures for its workers.\nThe governor said that the loan, which is guaranteed by the state government, is payable over a five-year period and will be deducted from accounts of the councils.", "35": "• Nigeria’s Crude Oil Production Climbs To 1.67m Barrels Per DayThough five billion naira was earmarked for each state government to provide palliatives, only two billion have been released so far.\nThere are funds in domiciliary accounts, which if you give people the incentive, they will utilise for investment in Nigeria.\nNigerians in Nigeria have huge holdings of foreign currency in banks abroad and financial institutions abroad.\nThe NNPCL boss also revealed that the proposed three billion dollar oil forward sale deal with Afrexim Bank has collapsed.\nKyari stressed that the deal is not a loan but a forward sale, which is a very easy deal.", "38": "Apparently to douse the tension, the Federal Government had rolled out a palliative plan, with N2 billion already disbursed to each state government.\n“Party leaders were tasked to share to only party members upon presentation of party card or identification of being a member of the ruling party,” the report said.\nThis is aside from the N500 billion Federal Government set aside for COVID-19 intervention programmes through its Economic Sustainability Plan.\n“As of the time of our report, comprehensive details of disbursed funds have not been published on the Open Treasury platform.\nThis further establishes our concerns about the lack of a proper framework for COVID-19 fund accountability in Nigeria,” BudgIT concluded.", "41": "He’s optimistic that things will be all right on the night just as his poor citizens, who have no choice, see his palliative scheme as a port in a storm.\nExercising the faith vested in Him, Jesus effortlessly fed about 5000 people with just 5 loaves and 2 fish.\nAn understanding of the palliative scheme can be gleaned from the appropriate answers to the questions raised in this article.\nThe palliative scheme is apparently a scheme within a scheme; it’s given rise to a plot being perfected to deny the masses of their packages.\nIn conclusion, Tinubu’s palliative scheme, though well-intentioned, can’t help Nigerians due to its inadequacies, shoddy planning and the leaders’ greed.", "44": "Treasure in this interview ahead of the World Menstrual Hygiene Day said menstrual items should be part of relief materials and palliative packs during conflicts and crisis.\nI realised that period poverty is pervasive, that we need people to recognise that menstrual items should be part of relief materials and palliative packs during conflicts and crisis.\nOur pad boxes contain a pack of menstrual pads, soap, underpants, panty liners, and sachets of beverages.\nBesides World Menstrual Hygiene Day, June 1 is World Milk Day; there is also World Breastfeeding Week and World Blood Donor Day.\nWe have just announced a call for entry for an essay competition on World Menstrual Hygiene Day to commemorate the day.", "45": "The Chair, Alliance on Surviving COVID-19 and Beyond (ASCAB), Femi Falana, has called on leaders and members of the National Assembly to reverse the N110 billion palliatives and purchase of exotic vehicles they allocated to themselves.\nFalana said the action cannot be justified in a democratic society, which claims to operate under the rule of law.\nHe said: “If the illegal decisions are not reversed, we call on RAMFC to take urgent steps to prevent the National Assembly from further usurping its constitutional functions.\nOtherwise, we are going to commence contempt proceedings against the chairman of the RAMFC and leaders of both chambers of the National Assembly.\nWhile the masses of Nigeria are groaning under excruciating economic pains unleashed on them by the ruling class, the National Assembly has awarded N228.7 million to each of the newly elected legislators.", "46": "House of Representatives has dismissed a statement credited to Assistant General Secretary of Nigeria Labour Congress (NLC), Christopher Onyeka, which claimed that each lawmaker collected N100 million as palliative.\nThe Chairman, House Committee on Media and Public Affairs, Akin Rotimi, made the denial in a statement, yesterday, in Abuja, describing the claim as baseless.\nRotimi said while “we doubt that Onyeka was actually conveying the official position of NLC on this claim, it is nonetheless important to correct such misinformation.”He said at no time did members of the House receive any money from the executive arm as palliatives.\n“The House of Representatives demands an immediate retraction of this lie and a public apology from the Nigeria Labour Congress.\nNLC, as a critical stakeholder in the development of Nigeria, has a voice and it risks delegitimising that voice, if it is found to include fables in its legitimate agitations.”", "47": "Download logoToday, President Abdel Fattah El-Sisi spoke by phone with the Emir of the State of Qatar, His Highness Sheikh Tamim bin Hamad Al Thani.\nThe call touched on ways to strengthen, support and develop bilateral relations across various fields, in addition to reviewing the latest regional and international developments, especially in Sudan.\nThe Spokesman for the Presidency, Counselor Ahmed Fahmy, said the two leaders stressed the importance of intensive work to contain the humanitarian situation in Sudan, facilitate the flow of relief aid and spare civilians the repercussions of the fighting.\nIn this context, the two leaders agreed to launch a joint initiative to support and provide relief to the Sudanese people so as to alleviate the effects and repercussions of the current crisis on the Sudanese people, especially the refugees, by providing them with humanitarian and relief services, provided that the concerned authorities in the two countries develop frameworks and mechanisms for implementation.\nDistributed by APO Group on behalf of The Presidency, The Arab Republic of Egypt.", "75": "The Lagos State Government, through its Public Works Corporation, in collaboration with the Federal Ministry of Works and Housing, has announced palliative works to be carried out on the failed sections of the 3rd Mainland Bridge.\nIt commences on Sunday 17th and Sunday 24th September 2023 from 7.00 am to 7.00 pm each Sundays.\nThe palliative works were scheduled for Sundays to minimize inconveniences for motorists.\nAlso, motorists from Lagos Mainland going through Herbert Macaulay Road (Adekunle axis) inwards Lagos Island via the 3rd Mainland Bridge will be diverted towards Muritala Mohammed Way to make use of Carter Bridge to link Lagos Island.\nMeanwhile, motorists are implored to be patient and observe safety measures during the palliative works on the asphalt pavement of the bridge.", "83": "Governor Babagana Zulum of Borno State has launched 80 buses, tricycles and pick-up vans for free transportation of residents in Maiduguri Metropolis and Jere Local Council.\nAccording to him, the state government hired 30 pick-up vans for the ‘free and safe’ commuting of farmers to their farmlands.\n“The 30 pick-up vans will be hired in launching today’s free transportation of our farmers to their farmlands within a radius of 10 kilometres from Maiduguri,” he noted.\nYou can see thousands of them gathered here in Molai for the free ride to various farmlands in the state.\nThis made the administration to provide 80 buses and 30 pick-up vans in conveying farmers to their respective farmlands in this year’s cropping season,” he said.", "88": "“As a government, we will do all we can to tackle the problem from the root cause so that they can continue with their education,” she said.\nShe revealed that there is already a planned partnership between the federal government, Niger state government and the United Nations Children’s Fund, (UNICEF), to set up transit schools for the 11,000 out of school displaced children in a secure location in the state.\nNiger State First Lady, Hajia Fatima Bago, expressed appreciation to the federal government for their support and interest in the humanitarian needs of the people of the state and Nigeria in general.\nHajiya Bago said,”These internally displaced persons need help, and we have to find a way to bring an end to insecurity in our state.\nThis figure according to him, comprised 7,650 women, 3,201 men, and 11,113 out-of-school children in addition to 108 people with special needs across 11 local government areas.", "89": "Mustapha Ahmed, has said that the agency is willing to support Niger state government in the provision of emergency relief to over 5, 000 Internally Displaced Persons, (IDPs), who are victims of banditry.\nHe made this know during a meeting with the deputy governor of the state, Yakubu Garba, who visited NEMA head office in Abuja, yesterday.\nHe said NEMA will continue to offer support to disaster affected persons nationwide.\nHe acknowledged continuous relief support delivered by NEMA to the state but said more were still needed for the displaced persons, especially to cater for their basic needs.\n“I am also at NEMA head office to discuss about how the State Government and the NEMA can work together towards mitigating against likelihood of flood as contained in the 2023 seasonal climate prediction and annual flood outlook,” he said.", "90": "Director General, National Emergency Management Agency, (NEMA), Mustapha Ahmed, has said that the agency is willing to support the Niger State government in the provision of emergency relief to over 5, 000 Internally Displaced Persons, (IDPs), who are victims of banditry.\nHe made this known during a meeting with the deputy governor of the state, Yakubu Garba, who visited NEMA head office in Abuja.\nHe said NEMA will continue to offer support to disaster-affected persons nationwide.\nHe acknowledged continuous relief support delivered by NEMA to the state but said more were still needed for the displaced persons, especially to cater for their basic needs.\n“I am also at NEMA head office to discuss about how the State Government and the NEMA can work together towards mitigating against the likelihood of flood as contained in the 2023 seasonal climate prediction and annual flood outlook,” he said.", "108": "Sen. Sahabi Ya’u (APC-Zamfara) has sponsored free surgeries and treatment for 3,000 eye patients.\nThe News Agency of Nigeria (NAN) reports that the lawmaker had recently flagged off the free medical outreach targeting over 5,000 vulnerable persons.\nUmar said 3,000 eye patients, mainly aged vulnerable persons, women and children, benefitted from the medical treatment, surgeries and drugs.\nAbba noted that the gesture was aimed at reducing the financial burden of medical services to people at the grassroots.\n“Other beneficiaries of the outreach also benefitted from hernia surgery, dental services, hypertension and diabetes services, among others,” he explained.", "123": "The 10th Senate has denounced reports alleging it manipulated the 2023 Supplementary budget that was approved last week, calling these allegations mischievous.\nThe legislative body was responding to some online news publications’ claims that an unwarranted N70 billion was padded into the supplementary budget, labelled as a “gift” from the executive branch.\nIt’s pertinent to also note that the National Assembly complex does not house only the Legislators.\n“The alleged padding of the palliative budget by the national assembly only exists in the minds of those who are all out to discredit the 10th Assembly.\n“We wish to urge fellow compatriots to see the national assembly as partners in the progress of Nigeria.”", "128": "The Organised Labour has indicated that it will take fresh decision on the nationwide protest scheduled to commence on Wednesday.\nNaija News reports that the Secretary of the Nigerian Labour Congress (NLC), Emma Ugbaja gave the indication at the end of the Presidential Steering Committee on Palliatives meeting at the Presidential Villa, Abuja.\nAccording to Ugbaja, though the measures announced Monday evening by President Bola Tinubu were welcoming, they were not far-reaching enough.\nHe, however, said the Labour team would go back to the bodies they represent to consort to achieve consensus on the next line of action.", "129": "The Presidential Steering Committee on Palliatives resumed its meeting on Tuesday, following President Bola Tinubu’s nationwide address.\nIt is also expected to consider the planned protest by the NLC expected to be held on Wednesday.\nThe notable absentee in the meeting was the President of the Nigeria Labour Congress (NLC), Comrade Joe Ajaero.\nInstead, the NLC was represented by its General Secretary, Comrade Emma Ugbaja.\nThe Trade Union Congress (TUC) was led by its President, Festus Osifo.", "132": "The All Progressives Congress (APC) National Secretary, Senator Ajibola Basiru has said President Bola Tinubu’s priority is to make Nigeria a productive economy.\nBasiru said that dishing out palliatives was not Tinubu’s end game but simply a means to provide a temporary cushion to the financially challenged.\nHe explained that the president is trying to make sure the economy becomes a productive one rather than just consuming imported products.\nThe palliative is not the end game, the end game is to revive our economy and get us back into productive economy that will ensure the welfare of the people.\nPalliative is a temporary measure and we believe that this is a federation, the state governments should be in the position to deliver those palliatives to the people.”", "136": "He also assured that the Federal Government would transfer the sum of N8,000 monthly to 12 million poor and low-income households for six months.\nSpeaking with Arise News on Wednesday, Adebayo said the planned cash transfer by the government would amount to waste since the money would be valueless and would also lead to inflation.\n“It is not going to increase the value of real goods in the market.\nWhat it is going to do is that there would be wastage because the money will not be well used.\nWhen the money gets to the end users, it becomes useless to them in the real terms because they don’t have the goods to chase with the money.", "138": "Prominent human rights lawyer, Femi Falana, has described the decision of the National Assembly to allocate N110 billion as palliatives for its members as illegal and contemptuous.\nHe stressed that the judgments remain valid and binding, and the National Assembly’s actions are therefore illegal and contemptuous.\nThe senior lawyer, therefore, called on the leadership and members of the National Assembly to reverse the controversial allowances and the purchase of luxury vehicles.\nIn the event that these actions are not promptly rectified, Falana urged the RMAFC to take immediate measures to prevent further usurpation of its constitutional functions.\nHe warned that failure to do so would result in contempt proceedings against the Chairman of the RMAFC and the leaders of both chambers of the National Assembly."}