{"10": "also approved palliatives worth billions of naira, across different sectors and demographics of the state.\nThe staggered work plan will not cover “essential workers”, the CPS clarified.\nAccording to Ajakaye, the governor has also endorsed immediate cash-backing of 2019 and 2020 promotion for Teaching Service Commission (TESCOM) workers.\n“The administration had earlier cash-backed arrears of TESCOM promotion for years 2015 to 2018.\n“In the same vein, he has approved cash-backing for 2021 promotion exercise of teaching and non-teaching staff of SUBEB and restoration of steps to all of them.", "61": "“The goal is to get everybody, wherever they are, out of poverty and humanitarian crises, this is the commitment of President Bola Ahmed Tinubu.\nDuring the exercise, Edu assured the other 480,000 unregistered IDPs at the camp that the federal government was not unmindful of their plight and humanitarian needs.\nShe said President Bola Tinubu’s ‘Renewed Hope’ agenda, geared towards eradicating poverty, will cover them directly working with the state government.\nShe adds that the social register, conditional cash transfer, and other social intervention programs of the federal government would be extended to them.\n“We appreciate your coming, Honourable Minister; the distribution of these nonfood items will go a long way to cushion the suffering of these IDPs.", "65": "Download logoThe National Emergency Management Agency (NEMA), on Friday 4th August, 2023 commenced the distribution of relief materials to persons affected by windstorm and flood disasters in Abia communities.\nHead, NEMA Owerri Operations Office, Mr Nnaji Ifeanyi presented the relief materials.\nHe stated that a joint team of assessors from NEMA and Abia SEMA carried out an on-the-spot assessment of the damage to determine need analysis of the affected persons.\nHe assured that the relief materials would be transparently and jointly distributed to affected persons by officials of NEMA, SEMA and representative of the community and other relevant stakeholders.\nDistributed by APO Group on behalf of National Emergency Management Agency (NEMA), Nigeria.", "67": "The National Emergency Management Agency (NEMA) has commenced the distribution of relief materials to flood victims in Kwara.\nAbdulRahaman AbdulRazaq of Kwara, represented by his deputy, Mr Kayode Alabi, inaugurated the distribution of the relief materials on Sunday.\nAlhaji Mustapha Ahmed, the Director-General of NEMA, said the Federal Government approved the intervention for people affected by the 2022 flood disasters and those classified as the most vulnerable persons across the country.\nThe NEMA boss advised the beneficiaries to make judicious use of the items distributed to them to improve their socio-economic conditions.\nIn his remark, the governor commended the effort of the Federal Government through NEMA for what he called ‘this timely intervention’ .", "69": "Phrank Shaibu, the Special Assistant on Public Communications to former Vice President Atiku Abubakar, has described President Bola Tinubu’s plan to hand out ₦8,000 to 12 million households for six months as a joke and an attempt to divert public funds.\nHe said Buhari’s interventionist programmes only ended up making Nigerians poorer as shown in reports released by the National Bureau of Statistics.\nSo, with Tinubu’s uninspiring plan, each individual in a household will get ₦1,600 per month or ₦53 per day.\nHe said: “Tinubu boasted that he would ‘develop Nigeria’s economy’ like that of Lagos but this was all a scam.\nHe added: “The so-called palliatives that Tinubu seeks to share to the poor are just another avenue to divert public funds.", "79": "Eventually, former Governor Gboyega Oyetola of Osun State heard about it and took up the challenge.\nAbout the same time, the National Assembly was also said to have allocated N70 billion, also for buying palliatives for its members.\nThe palliatives issue for the lawmakers, if not well-managed, may also dent the president’s image.\nYes, we need to hear our president’s voice to, at best, fight our fears!\nKomolafe wrote from Ijebu-Jesa, Osun State.", "80": "Download logoOn August 5, 2023, NEMA’s South West Zonal Office provided relief materials to individuals affected by flooding in Ilare, Ibokun LGA of Osun State.\nDuring the presentation of the relief items, Mr. Olarenwaju Kazeem, the Acting Zonal Coordinator, expressed sympathy for the flood victims and conveyed heartfelt condolences from NEMA’s Director General.\nMr. Kazeem encouraged the beneficiaries to use the items wisely.\nIn response, the beneficiaries expressed their gratitude to NEMA for the generous support and pledged to make the best use of the provided items.\nDistributed by APO Group on behalf of National Emergency Management Agency (NEMA), Nigeria.", "81": "State governors have pledged to complement Federal Government’s initiatives aimed at providing relief to Nigerians, Gov.\n“That support will be complemented by the state governors.\n“I want to restore Benue to its position of being the food basket of Nigeria.\nThe News Agency of Nigeria (NAN) reports that state governors in the country have national, zonal and local fora, irrespective of party affiliations, where they meet to harmonise policies and programmes.\nThe Nigeria Governors Forum, the Progressive Governors Forum and the six zonal chairmen of governors are all systems put in place for such meetings of minds.", "84": "Babagana Zulum of Borno says that his administration will sustain the distribution of palliatives support to the less privileged and communities affected by insurgency throughout his tenure.\nZulum made the announcement on Tuesday in Maiduguri while inaugurating the distribution of the Federal Government’s palliatives to 100,000 vulnerable households.\nZulum said that while Federal Government provided for 100,000 households, his administration is providing for additional 300,000 households to make a total of 400,000 households.\nHe explained that Borno’s case is peculiar as some areas were devastated by the insurgency and returnees were yet to have full access to their farmlands, hence the need to continue supporting them.\nWhile nothing that 2,000 vulnerable persons would be selected in each ward for the palliative, particularly in urban areas like Maiduguri, Zulum said that every household would benefit in rural communities of the LGAs affected by insurgency.", "85": "Babagana Zulum of Borno has presented N10m relief package to soldiers wounded in the ongoing fight against insurgents in the state.\n“We are here to fulfil the pledge made by His Excellency, the Executive Governor of Borno State, Prof. Babagana Umara Zulum.\n“You may recall that the governor was here on a Sallah day for an event, during which he expressed the commitment of the Borno State Government to the welfare of our troops and pledged a donation of N10m to wounded soldiers.\nIn his response, the GOC 7 Division, Maj.- Gen. Peter Malla, expressed appreciation to Zulum for his sustained support to the military in the state.\n“Let me on behalf of Theatre Commander, welcome you to 7 Division and also express our appreciation to His Excellency for always supporting the military,” Malla said.", "91": "National Emergency Management Agency (NEMA) has donated relief materials to 23,000 farmers and vulnerable persons affected by the 2022 flood in Niger State.\nDirector-General (DG) of NEMA, Mustapha Ahmed, flagged off distribution of the relief materials in Minna, yesterday, in the intervention tagged ‘Special National Economic and Livelihood Emergency Intervention (SNELEI)’.\nThe 2022 flood disaster affected many communities across the country, including Niger.\nThe NEMA boss advised the beneficiaries to make proper use of the items to improve their socio-economic conditions.\nIn his remarks, the Acting Director-General, State Emergency Management Agency (SEMA), Garba Salihu, assured that the items would be distributed to victims verified by the agency.", "93": "The National Emergency Management Agency (NEMA) said it had distributed livelihood emergency intervention to 9,100 persons affected by the 2022 flood and other vulnerable persons in Kebbi.\nMustapha Habib-Ahmed, the Director-General of NEMA, said this during the launching of the distribution exercise of the Special National Economic and Livelihood Emergency Intervention (SNELEI) in Birnin Kebbi on Friday.\n“The Federal Government approved the intervention especially for people affected by the 2022 flood disasters and those classified as the most vulnerable persons across the country.\n“This intervention is also expected to drive the sustainable socio- economic resilience of the targeted most vulnerable individuals,”he added.\nNasir Idris, urged the flood victims to utilise the relief items distributed to them by NEMA judiciously and avoid saling them.", "95": "Dr Abdullahi Ganduje, the All Progressives Congress (APC) National Chairman has inaugurated newly constructed road projects in Sokoto metropolis and inaugurated the distribution of relief materials to 2022 flood victims.\nHe congratulated Sokoto citizens for electing Aliyu, saying,”he has demonstrated capacity to transform the state to better.\nGanduje, who was the former Governor of Kano State urged Nigerians to be steadfast in prayers for the president to overcome all challenges to transform the nation to more greatness.\nGanduje urged State Governors especially APC members to emulate Aliyu on his determination and courage to execute viable projects for the benefit of the citizens.\nHe further commended Federal and Sokoto State Governments for the distribution of relief materials to 15,668 victims of 2022 floods and vulnerable persons in the state, which he described as succour to them.", "96": "Living Faith Church World Wide, yesterday, donated relief materials worth millions of naira to affected communities in Mangu and Riyom councils of Plateau State recently attacked by bandits suspected to be Fulani herdsmen.\nPresident and Founder of the Church, Pastor David Oyedepo, sent the relief materials.\nFolorunsho noted that they visited some hospitals where the injured were receiving treatment, on Tuesday, and assisted them with their medical bills.\nHe said they were shocked that live bullets were still in the flesh of some of them.\nHe srressed that life is very important to God, because no person can create life.", "97": "Download logoThe National Emergency Management Agency (NEMA) North Central Zonal Office, Jos, today 26th June, 2023 commenced the distribution of relief materials to the victims of Farmer Herder clashes in Mangu Local Government Area of Plateau State.\nMarkus Artu, appreciated the Agency and noted that the relief items will go a long way in alleviating the suffering of Internally Displaced Persons (IDPs).\nPresent at the Flag-off exercise were Security Agencies such as the Nigerian Police, Nigerian Army, the National Security and Civil Defense Corp and the State Security Services .\nOthers include the State Emergency Management Agency, the Red Cross and representatives of various communities among others.\nDistributed by APO Group on behalf of National Emergency Management Agency (NEMA), Nigeria.", "102": "The Enugu State government has set up palliative distribution committees to oversee the equitable distribution of support in all the 260 wards.\nThe Deputy Governor, Ifeanyi Ossai, also Chairman of the committees, urged members to ensure that the vulnerable in the 260 wards received the relief materials.\nOssai said at the inauguration in Enugu that the ward committees were made public for proper identification and active participation.\n“Though the removal has long term advantages, but in the short term there’s need to cushion its effects.\nThe deputy governor added that the committees comprised individuals drawn from the various wards, including councillors, clergymen, Civil Society Organisations and presidents of town unions.", "104": "Ogun State Governor, Prince Dapo Abiodun, has flagged off the distribution of 300,000 bags of 10kg rice as palliatives to residents of the state.\n“Our desire in the first instance is to distribute about 300,000 bags of 10kg rice across the 5,400 polling units.\n“We have decided to use the polling units as a reference of distribution, not wards because we realised that using wards won’t be equitable.\nThis is because a ward in Ogijo has far more polling units than a ward in Ikenne or Remo North.\nSo, we decided that we will use the polling units as points of reference,” he said.", "105": "Ogun State Governor, Dapo Abiodun, yesterday, disclosed plans to reactivate the state-owned ‘Bulk Purchase Programme’ under the Gateway Trading.\nAbiodun, who made this known during an interview in Abeokuta, Ogun State capital, noted that his administration would also introduce an agric and food palliative, which according to him, would help to support farmers to enable them to boost food production.\nThe governor noted that the bulk purchase programme would allow the state government to purchase food items at pre-deregulation prices.\n“In terms of food palliatives, we are now going to reactivate our Bulk Purchase Programme under the Gateway Trading and through different channels and warehouses in different parts of the state.\nWe will be selling food items like grains and rice that we will be purchasing from the Central Bank of Nigeria (CBN) at pre-deregulation prices,” he said.", "110": "A socio-political advocacy group, Good Governance Collective has hailed Akwa Ibom State Governor, Umo Eno for initiating an over ₦10 billion palliative programme for the people.\nThe group lauded the governor’s decision to augment the federal government palliative package and for putting machinery in place to ensure effective distribution to the very needy at the grassroots, while also showing care for various categories of the citizenry.\nHe said apart from cutting off middlemen, this decision will further create jobs for the mills and also engage the youths.\nThe group also urged the chairmen of the palliative committees across the federation to ensure equitable distribution of the palliatives considering the dire needs of the people.\n“This is not the time for state officials to be greedy, this is not the time to wear any political toga, these palliatives are for the most vulnerable and they should be distributed without any biases,” Odutayo noted.", "111": "The Yobe government has distributed food items to 6,800 less privileged persons in Potiskum Local Government area of the state.\nDr Mohammed Goje, Executive Secretary, State Emergency Management Agency (SEMA), stated this at the inauguration of the distribution exercise on Wednesday in Potiskum.\nHe said the gesture was meant to enhance food security among people of the state.\n“Today, we are in Potiskum LGA to respond to the plight of vulnerable with palliative as directed by Gov.\n“The beneficiaries cut across Persons Living with Disabilities, vulnerable households, primary and secondary school teachers.", "113": "Governor Uba Sani of Kaduna State has introduced a comprehensive palliative support initiative aimed at alleviating the adverse effects of petrol subsidies on residents of the state.\nThe comprehensive palliative support initiative was unveiled by Governor Sani during a press conference on Tuesday.\nThe governor stated that the implementation of the palliative intervention would be executed in three phases, noting that the first phase entails the distribution of food items to poor and vulnerable households.\nHe noted that the remaining two phases of the palliative intervention will address transportation challenges, offer support to small-scale farmers and micro, small, and medium-sized enterprises, and restore train services across the three senatorial districts of Kaduna State.\nSani added that these measures are key to cushioning the sufferings of the people.", "114": "Dr Abdullahi Ganduje, the All Progressives Congress (APC) National Chairman has inaugurated newly constructed road projects in Sokoto metropolis and inaugurated the distribution of relief materials to 2022 flood victims.\nHe congratulated Sokoto citizens for electing Aliyu, saying,”he has demonstrated capacity to transform the state to better.\nGanduje, who was the former Governor of Kano State urged Nigerians to be steadfast in prayers for the president to overcome all challenges to transform the nation to more greatness.\nGanduje urged State Governors especially APC members to emulate Aliyu on his determination and courage to execute viable projects for the benefit of the citizens.\nHe further commended Federal and Sokoto State Governments for the distribution of relief materials to 15,668 victims of 2022 floods and vulnerable persons in the state, which he described as succour to them.", "115": "The National Emergency Management Agency (NEMA) on Thursday began the first phase of distribution of relief materials to 650 vulnerable persons and households affected by the 2022 floods Bauchi State.\nMr Suleiman Muhammad, Assistant Director, Relief and Rehabilitation at NEMA said in Bauchi that the items would be distributed to households in the 20 local government areas of the state.\n“The verification of registered flood victims for the SNELEI intervention was designed to provide support for victims of the 2022 disaster, targeting 13,226 households across Bauchi State.\nAccording to Muhammad, the interventions will be implemented by NEMA in conjunction with the Bauchi State Emergency Management Agency.\nResponding, Mr Abdullahi Usman, Chairman Bauchi State Emergency Management Agency, commended the Federal Government for establishing a special programme to alleviate the sufferings of the vulnerable and of flood-affected persons.", "116": "Download logoRelief items comprising of food and non-food items from the Federal Government were distributed by NEMA Abuja Operations Office (AOO) in collaboration with Kogi State SEMA (KOSEMA) to persons affected by windstorm disaster in Ijumu and Lokoja LGAs of Kogi State.\nBenefiting communities were Iyara, Ayetoro, Agbaja and Jamata.\nThe Community Leaders, Local Government Chairmen and State Emergency Management Agency, thanked the DG Alhaji Mustapha Habib Ahmed, NEMA Management and the Federal Government for coming to their aid in their time of despair.\nDistributed by APO Group on behalf of National Emergency Management Agency (NEMA), Nigeria.", "117": "The National Emergency Management Agency (NEMA) has distributed relief items to victims of the 2022 flood, as well as vulnerable persons in Bayelsa.\nHe said that the distribution carried out in collaboration with the Bayelsa State Emergency Management Agency, was part of the first phase of the Special National Economic Livelihood Emergency Intervention of the Federal Government.\nAccording to him, the Federal Government approved the items to assist the 7,811 households to cushion the effect of the flood disaster.\nHe said the items distributed included food and non-food items, such as tools for livelihood support, agriculture seedlings, rice, beans, vegetable oil and blankets.\nOthers are: Mattresses, Seedlings, Pesticides, Fertilisers, sewing machines, grinding machines and sprayers.", "137": "Nigerian activist, Aisha Yesufu has reacted to the proposed plan by the Federal Government to distribute N8000 monthly palliatives to 12 million households.\nNaija News recalls that some days back, President Bola Tinubu had asked the senate to approve a borrowing request of $800 million.\nThe president’s request was contained in a letter read by the senate president, Godswill Akpabio during plenary.\nHe also assured that the Federal Government would transfer the sum of N8,000 monthly to 12 million poor and low-income households for six months.\nIf one continues to rinse and repeat one is no different from the incompetent ones.", "139": "President Bola Ahmed Tinubu has been advised to halt the plan of his government to distribute N8,000 to 12 million poor Nigerians in six months.\nIn the letter, Tinubu explained that his government would transfer N8,000 a month to 12 million poor and low-income households, with a multiplying effect on about 60 million individuals.\nExpressing further concerns about the planned N8,000 palliative, he asked: “How do we determine the poor Nigerians?\n“Lastly I repeat, Mr President, please do not give out cash palliative of N576b.\nThe amount is too much for such and the two alternatives enumerated above will have better impact than N266.67 per day to 12 million Nigerians.”", "140": "Speculations have emerged that Senate President Godswill Akpabio and other senators, including Adeola Yayi, allegedly padded President Bola Tinubu’s palliative budget with over N200 billion.\nThe N500 billion will be taken from the N819 billion Supplementary Appropriation Act.\nOne of the sources said, “Akpabio and Adeola Yayi inserted over N200 billion into Tinubu’s palliative budget.\n“Akpabio, Senator Jibrin Barau, and Senator Adeola Yayi are the major architects of the budget padding,” another source said.\n-N1.25 billion for the construction of some rural roads in Abiakpo Ikot Essien-Ikono to ease the movement of farm produce.", "141": "The NLC President, Joe Ajaero, said the Federal Government was about sharing N2,000 and a cup of rice with poor people across the country.\nEven if you pick them from the poverty bracket, it will be difficult for them to get one cup of rice.\nSo do we look at our people as people we should give one cup of rice and N2,000?\nIs that palliative?”Reacting to the NLC’s stance via a Twitter post, Bwala stated that organised labour had demystified the N5bn palliative.\nOrganize labour further did their arithmetical calculations and arrived at a shameful conclusion that the so-called 5 billion naira comes down to 1500 per person.", "164": "Three truckloads of palliative rice were reportedly hijacked by suspected hoodlums at the Oja-Oba/Idi-Ape/Isale-Oja areas of Ilorin West and Ilorin East local government areas of Kwara State.\nNaija News gathered that the Toyota Dana trucks loaded with bags of 10kg of rice were headed for an unknown destination.\nThey were passing through the area when they were attacked and hijacked by the suspected hoodlums at around 6:30 p.m. on Friday.\nSome eyewitnesses told Daily Trist that the incident had happened a few meters from the ‘C’ division police station.\nPleading anonymity, a senior police officer told the platform that operatives were later dispatched to some areas to fish out the criminals.", "173": "The Governor of Lagos State, Babajide Sanwo-Olu on Wednesday announced palliative measures to cushion effects of the crises on residents.\nThe Governor announced establishment of food banks various parts of the State for distribution of food items to vulnerable families hit by the lingering crisis.\n“I have also directed that food banks be set up in various parts of the State to cater for the vulnerable.\nThe Governor said the road, which is about 50 percent completed, will give unhindered access to petrol tankers to transport products to filling stations, thereby increasing supply of petroleum products.\nNNPCL demanded Ijegun Egba tank owners and operators’ unhindered access to the tank farms where about 40 per cent of petroleum products come from.", "178": "The Plateau State Governor, Caleb Mutfwang, has told the people of his state that the N5 billion palliative given to all states and the FCT is not a free lunch from the federal government, as thought by many.\nHe explained that the federal government palliative was not entirely free because there is a loan component of it to be paid back by states.\nWe have so far received N2 billion; the N5 billion has a 52 percent drive component, while 48 percent is a loan component that must be repaid.\nWe were mandated to use N1 billion of the N5 billion to buy rice locally.\n“And I like to pledge and give you my pledge of honor that not a single kobo of this N5 billion will be misused.", "184": "In a meeting on Wednesday, state governors revealed they are collaborating with the federal government to provide relief measures, or “palliatives,” to Nigerians after the removal of fuel subsidies.\nThe details of these plans are being finalized, according to the Imo state Governor and chairman of the All Progressives Congress (APC) Governors Forum, Senator Hope Uzodinma.\nThe gathering of APC governors followed the resignation of the APC’s National Chairman, Senator Abdullahi Adamu, as well as National Secretary, Senator Iyiola Omisore.\nYou must have heard of the resignation of the National Chairman of our party and the National Secretary of our party.\nThose are voluntary actions that have been taken and with due respect to our former National Chairman and the Secretary, we commended the wisdom behind the action they have taken."}