[
    {
        "url": "https://nigerianpilot.news/2023/06/06/cta-proposes-approach-to-address-challenges-posed-by-fuel-price-hike/",
        "summary": "Organised Labour led by the Nigeria Labour Congress (NLC) and Trade Union Congress (TUC), on Monday agreed to suspend their planned strike action to continue negotiations with the government on subsidy removal.\nBut the CTA said the joint committee should set up by government and labour must develop a transparent implementation plan for the resolutions.\nNwadishi said immediate reduction in PMS Price to Cushion Citizens’ Pains as June 30th approaches is one of such short term measures to consider.\nShe said, “the need for an immediate reduction in the price of Premium Motor Spirit (PMS) to reflect the proposed date of subsidy removal, which is set for the 30th of June 2023.\nThis reduction is crucial to alleviate the sudden financial burden on citizens while the palliatives plan is implemented immediately."
    },
    {
        "url": "https://nigerianpilot.news/2023/05/31/fuel-subsidy-removal-dont-dare-nigerians/",
        "summary": "The Labour centres in separate statements to journalists said that the announcement by President Tinubu on his inauguration day brought tears and sorrow to millions of Nigerians instead of hope.\n“It is no heroism to commit against the people this level of cruelty at any time, let alone on an inauguration day.\nWe wonder if President Tinubu gave a thought to why his predecessors in office refused to implement this highly injurious policy decision.”Congress also reminded President Tinubu of his opposition to removal of subsidy on petrol in 2012 under the President Goodluck Jonathan administration.\n“In light of the foregoing, we advise Tinubu to respect his own postulations and economic theories instead of daring the people.\nThe TUC noted that there are a lot of issues to be considered and resolved before such decisions can be taken, noting that Nigerian Workers and indeed masses must not be made to suffer the inefficiency of successive governments."
    },
    {
        "url": "https://nigerianpilot.news/2023/05/31/tinubu-assumes-work-meets-cbn-governor-nnpc-gmd-over-exchange-rate-fuel-scarcity/",
        "summary": "Few hours after President Tinubu announced that the subsidy would end, queues suddenly surged as some fueling stations increased the price.\nTinubu arrived the Forecourt of the Presidential Villa at 2:38 PM and was received by the Vice President Kashim Shettima, the Permanent Secretary of the State House Mr Tijani Umar, Speaker of the House of Representatives Femi Gbajabiamila, Hon James Faleke amongst other officials.\nWhile the State House awaits the arrival of the president, at 2:30 PM, his Vice, Shettima, had resumed office earlier about 1PM.\nThis was the first official assignment by the President after his inauguration as the 16th President of the country at Eagle Square, Abuja.\nAlthough the agenda of the meeting was not made public, it may not be unconnected with the removal of fuel subsidy and the attendant fuel scarcity."
    },
    {
        "url": "https://nigerianpilot.news/2023/05/30/tinubu-assumes-office-meets-cbn-governor-nnpc-gmd-over-exchange-rate-fuel-scarcity/",
        "summary": "By Mathew DadiyaPresident Bola Ahmed Tinubu, Tuesday assumed office officially and is meeting with the governor of the Central Bank of Nigeria (CBN) Godwin Emefiele and the Nigeria National Petroleum Corporation (NNPC) Group Managing Director (GMD) Mele KyariThe President had while delivering his inaugural speech at the Eagle Square yesterday, said “subsidy is gone” adding that his predecessor did not make a provision for subsidy in the 2023 budget as it elapsed in June 30th.\nFew hours after President Tinubu announced that subsidy will end, queues suddenly surged as some filling stations increased the price.\nTinubu arrived the Forecourt of the Presidential Villa at 2:38 PM and was received by the Vice President Kashim Shettima, the Permanent Secretary of the State House Mr Tijani Umar, Speaker of the House of Representatives Femi Gbajabiamila, Hon James Faleke amongst other officials.\nTinubu meets Emefiele over the need to unify the foreign exchange windows to one to attract investment while the NNPC GMD, Kyari will address the queue on the filling stations and proffer solutions to the palliative required to curtail the pains of the subsidy removal.\nWhile the State House awaits the arrival of the president, at 2:30 PM, his vice, Shettima had resumed office earlier about 1PM."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/20/fg-nlc-resume-talks-over-subsidy-constitute-technical-committees/",
        "summary": "Speaking to State House Correspondents at the end of the meeting, Special Adviser to the President on Special Duties, Communications and Strategy, Dele Alake said a steering committee has been set up, alongside technical committees that will help achieve the planned palliatives for Nigerians.\n“As we promised the last time we met; when labour called off their planned strike, we held a meeting today.\nAlake added that a steering committee was set up alongside technical committees that will help actualize the dream of providing the intervention that will cushion the effects of removal of subsidy.\n“Work groups have been constituted at today’s meeting.\nThere is a steering committee that will serve as a clearing house and there are other committees comprising both parties; government and labour."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/27/gov-fintiri-approves-n10-000-subsidy-allowances-for-workers-pensioners/",
        "summary": "By Padio Phineas, YolaAdamawa State governor, Ahmadu Umaru Fintiri, has approved N10, 000 allowances for civil servants as part of the palliative to cushion the impact of oil subsidy removal by President Bola Ahned Tinubu.\nAlso to benefit from Governor Fintiri’s N10, 000 subsidy allowances are pensioners in the state.\nHowever, it was gathered that the subsidy allowance which takes effect from August, 2023 would be reviewed in February, 2024.\nThe Chief of Staff Government House, Dr. Edgar Amos, disclosed this on Wednesday, saying Governor Fintiri has also approved the implementation of N30, 000 minimum wages for local council staff in the state.\nPresident Bola Tinubu had on May 29, shortly after his inauguration announced subsidy removal, forcing the pump price of PMS to skyrocket from N197 to N630 per liter."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/20/subsidy-removal-professionals-hails-gov-diri-on-transportation-scheme/",
        "summary": "By Olugbenga SalamiNetwork of Bayelsa Professionals, NBP, has commended the Bayelsa State governor, Senator Douye Diri for his efforts to alleviate the hardships of the people of the state following the federal government’s new increase in the pump price of petroleum.\nA statement issued in Abuja on Thursday by the spokesperson of the professionals, Mr. Deinmobofa Tantua noted the essence of transportation in human lives especially students and downtrodden workers and expressed optimism that fuel subsidy removal hardships would be cushioned through the new transport scheme.\n“As concerned professionals, our own is basically to commend the governor for the launch of the transport scheme as it will immensely benefit people of the state, especially the student community.\n“The new transport scheme signifies his passion and commitment to the welfare of the people and other laudable initiatives like the various empowerment and skill acquisition programmes organised by his administration.\nThe group equally noted that the new transport scheme will help to reduce the difficulties experienced since the night ban on tricycles and thanked Bayelsans for their patience and understanding."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/13/tinubu-begs-nigerians-to-endure-subsidy-hardship/",
        "summary": "By Mathew DadiyaPresident Bola Tinubu has assured Nigerians that the framework for palliatives to remedy the effects of fuel subsidy removal was being worked out, assuring that the decision was in the best interest of the country, especially in guaranteeing future prosperity.\nHe said, “I understand that our people are suffering yet there can be no childbirth without pain.\nIt is a rebirth of the country for the largest number over a few smugglers.\nI never thought I was going to be here as President, but God Almighty has brought me,’’ President Tinubu stated.\nThe President also assured the governors and Nigerians that he will work towards “unity, equity, stability, and prosperity of the country’’."
    },
    {
        "url": "https://nigerianpilot.news/2023/08/17/nec-fg-shares-n185bn-to-36-states-fct-to-cushion-subsidy-removal/",
        "summary": "Zulum said that Nigeria was already having refugees from Niger Republic which he said is affecting the distribution of palliatives.\n“NEC met and expressed serious concerns as regards increasing cost of food items, increasing cost of transportation amongst others as a result of subsidy removal.\nIn order to cushion the effect of subsidy removal, the federal government has released five trucks of rice to each state last week.\n“Furthermore, Council has also noted the package that was announced by the president in order to cushion the effect of subsidy removal, amounting to about N500billion.\nA committee made up of Anambra State governor, NGF Chairman and others have been nominated to interface with labour."
    },
    {
        "url": "https://nigerianpilot.news/2023/08/02/subsidy-removal-beyond-tinubu-kyaris-personal-interests/",
        "summary": "Come to think of it, as critical as fuel subsidy removal is to the turnaround of the economy, successive governments have made brick walls in their attempts to end the subsidy regime.\nIn justifying the subsidy removal, the government said subsidy removal would free up public funds for more meaningful infrastructure and developmental programs that stimulate industrialization, create jobs, economic growth and social prosperity.\nSubsidy removal also enables responsible gasoline consumption, which reduces waste as the prices are more market reflective, and the demand for the product will rebalance itself with the new price realities.\n“For several years, I have consistently maintained the position that the fuel subsidy had to go.\nThis is in spite of palliatives proposed by the federal government to ameliorate the perceived suffering the fuel subsidy removal would throw up."
    },
    {
        "url": "https://nigerianpilot.news/2023/08/01/labour-insists-to-protest-august-2-despite-presidents-assurances/",
        "summary": "Speaking to correspondents, the President of the Nigeria Labour Congress (NLC), Joe Ajaero, said the plan for workers to proceed on a peaceful protest from Wednesday has not changed.\nHe dismissed fears that the peaceful protest could be hijacked by hoodlums, saying that such had never happened in the history of workers protest.\nHowever, he said it is the responsibility of security agencies to provide security for the protest to protect the workers.\nHe said the meeting of the Steering Committee adjourned till 12noon on Tuesday to enable the labour leaders to listen to the president’s national broadcast on Monday.\nRecall that the organised labour stormed out of the meeting on Friday last week, claiming that there was no top government officials to negotiate with them."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/29/group-condemns-proposal-of-exuberant-allowances-made-for-principal-parliamentary-officers/",
        "summary": "According to a press release issued yesterday by the President, SOYD, Comrade Ogwuche Gabriel, stated, “We have been keenly monitoring the steps of the newly inaugurated 10th National Assembly, especially the proposed bullet proof cars and palliative programs for principal officers and other members of the parliament respectively.\n“This is coming at the time when Nigerians are going through irreparable hardship due to the removal of the fuel subsidy with no possible solution yet on sight to address the economy.\n“The Senate immediately on receipt of the petition, suspended plenary session and sent a delegation to promptly address the ugly development after several apologies.\nThis development occur to us as great achievements even without getting the alleged sum.\nIt gives us sense and encouragement to grow to where we are today.”“Consequently, We urge the National Assembly to beware of people’s rebellion by desisting from diverting and wasting public fund in this government."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/28/all-ministerial-nomineesll-face-thorough-screening-senate-leader/",
        "summary": "The Senator representing Ekiti Central Senatorial District, said Senator Godswill Akpabio-led Senate was desirous and keen about ensuring that those holding pivotal positions under Tinubu’s Presidency are those with capacities to deliver.\nThey are expecting us to do a thorough screening.\n“Senator Bamidele is a special breed of politician, who will not pledge what he will not do.\nSenator Bamidele doesn’t belong to that group.\nAll of us can’t be senators or governors, but we can all be children of God,” he further explained."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/14/owukpa-advocacy-forum-congratulates-tinubu-cautions-fg-on-disbursement-of-n8000-palliative/",
        "summary": "A good governance, transparency and rural development advocate group under Owukpa Advocacy Forum (OAF) has cautioned President Bola Tinubu’s administration on the disbursement of planned N8,000 palliative to ‘vulnerable Nigerians’ to cushion effects of fuel subsidy removal on poor Nigerians.\nDavid Abakpa Otobo on Friday, commended President Tinubu on a few economic policies put in place so far since assumption in office as President and Commander-In-Chief of the armed forces.\nRecall that Tinubu had secured approval of the Senate on Thursday to borrow $800 million for N8,000 monthly palliative to 12 million low-income households for six months.\n“However, we are using this medium to advocate and campaign to ensure transparency in the disbursement of the planned N8,000 monthly palliative to 12 million vulnerable Nigerians.\n“We, therefore, call on Mr. President to chair and monitor the selection and the implementation processes by himself to ensure the ‘vulnerable Nigerians’ are not left out of the scheme."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/13/tinubus-palliative-of-n53-per-day-an-avenue-to-divert-public-funds-buy-votes-atikus/",
        "summary": "The Special Assistant on Public Communications to Atiku Abubakar, Mr. Phrank Shaibu, has described President Bola Tinubu’s plan to hand out N8,000 to 12 million households for six months as a brazen attempt to divert public funds.\nSo, with Tinubu’s uninspiring plan, each individual in a household will get N1,600 per month or N53 per day.\nThis must be a joke or a more sinister attempt to divert public funds.\n“The so-called palliatives that Tinubu seeks to share to the poor are just another avenue to divert public funds.\n“The scheme is nothing but a means to use public funds to prosecute political campaigns and objectives."
    },
    {
        "url": "https://nigerianpilot.news/2023/09/04/civil-society-groups-want-organised-labour-to-call-off-industrial-action-meet-in-abuja-over-fuel-subsidy/",
        "summary": "No fewer than 100 civil society groups have called on the Nigeria Labour Congress to call off its proposed strike scheduled for Tuesday and Wednesday.\nThe groups, under the auspices of Project Nigeria, said it came to this conclusion after several meetings with relevant stakeholders and government officials.\nIn a statement signed by its President, Dr. Kolawole Akinmosu, the CSOs said it is in the best interest of the nation for the labour to halt plans of industrial action.\n“The Project Nigeria is a coalition of 100 pro-Nigerian civil society groups.\nOur interest is the nation,” Akinmosu said."
    },
    {
        "url": "https://nigerianpilot.news/2023/09/11/subsidy-palliatives-36-govs-gets-7-day-ultimatum-on-spending-of-n2bn/",
        "summary": "By Kenneth AtavtiThe Socio-Economic Rights and Accountability Project (SERAP) has urged the 36 state governors in the country to “disclose details on spending of the N2 billion palliative recently disbursed to each state by the Federal Government, including the names of beneficiaries and details of the reliefs so far provided with the money.”According to reports, the Federal Government recently disbursed N2 billion out of the N5 billion palliative package for each state of the federation and the federal capital territory (FCT), to address the impact of the removal of fuel subsidy.\nIn the open letter dated 9 September 2023 and signed by SERAP deputy director Kolawole Oluwadare, the organisation said: “It is in the public interest to publish the details on spending of the N2 billion palliative and any subsequent disbursement of funds to your government.”SERAP said: “Nigerians have the right to know how their states are spending the fuel subsidy relief funds.\nIt is part of their legally enforceable human rights.”According to SERAP, “Transparency and accountability in the spending of the N2 billion and any subsequent disbursement to your state would help to reduce the risk of corruption, mismanagement, diversion, or opportunism.”The letter, read in part: “We would be grateful if the recommended measures are taken within seven days of the receipt and/or publication of this letter.\nIf we have not heard from you by then, SERAP shall take all appropriate legal actions to compel you and your state to comply with our request in the public interest.”“The oversight afforded by public access to the details of the spending of the N2 billion palliative and any subsequent disbursement would serve as an important check on the activities of your state and help to prevent abuses of the public trust.”“The constitutional principle of democracy also provides a foundation for Nigerians’ right to know details on spending of the N2 billion fuel subsidy palliative.\nCitizens’ right to know promotes openness, transparency, and accountability that is in turn crucial for the country’s democratic order.”“The effective operation of representative democracy depends on the people being able to scrutinise, discuss and contribute to government decision making, including on the fuel subsidy relief funds.”“SERAP notes that the removal of subsidy on petrol continues to negatively and disproportionately affect the poor and socially and economically vulnerable Nigerians in several states, undermining their right to adequate standard of living.”“The Freedom of Information Act, Section 39 of the Nigerian Constitution, article 9 of the African Charter on Human and Peoples’ Rights and article 19 of the International Covenant on Civil and Political Rights guarantee to everyone the right to information, including about how the N2 billion fuel subsidy relief funds are spent.”“By the combined reading of the provisions of the Constitution of Nigeria, the Freedom of Information Act 2011, and the African Charter on Human and Peoples’ Rights, applicable throughout Nigeria, there are transparency obligations imposed on your state to publish details of spending of the N2 billion fuel subsidy palliative.”“The Nigerian Constitution, Freedom of Information Act, and the country’s anti-corruption and human rights obligations rest on the principle that citizens should have access to information regarding their government’s activities.”“Your state cannot hide under the excuse that the Freedom of Information Act is not applicable to your state to refuse to provide the details”."
    },
    {
        "url": "https://nigerianpilot.news/2023/09/11/palliative-distribution-like-buhari-tinubu-missed-it/",
        "summary": "In many states, what they do is to buy truck loads of indomie, rice, maggi, among other perishable food items.\nInterestingly, like the Buhari administration’s distribution of COVID-19 palliatives and Social Intervention Programme, the Tinubu administration is equally toeing the same path of shameful and chaotic pattern.\nIndeed, we have been proven right by the current controversies that have been trailing the distribution of the palliatives.\nGoing by different reports, before many citizens had heard about it, politicians have already hijacked the money and palliatives.\nWe wonder why the Tinubu administration that condemned the Buhari administration’s mismanagement of the humanitarian programmes would follow similar corrupt pattern that has failed to meet the minimal expectation of Nigerians?"
    },
    {
        "url": "https://nigerianpilot.news/2023/08/03/subsidy-senator-ngwu-lauds-gov-mbah-for-providing-palliatives-others/",
        "summary": "Ngwu said it was highly commendable that in the face of the harsh economic realities of the federal government’s policy on residents of Enugu State, Governor Mbah has demonstrated care and empathy by rolling out palliatives to mitigate the untold hardship being faced by the people.\n“Just when residents of Enugu State felt that their suffering was endless, our amiable governor brought succour.\nThe Palliative Committee has the chairman, Association of Local Governments in Nigeria, ALGON, Enugu State, and chairman of Nkanu East Local Government Area, Hon.\nOkechukwu Sydney Edeh; ALGON Deputy Chairman and Chairman of Uzo Uwani Local Government Area, Hon.\n“It is also quite commendable that since the assumption of office, Governor Mbah has embarked on numerous people-oriented policies, programmes and projects to take the state to the next level of development."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/31/katsina-directs-local-government-councils-to-distribute-palliatives-to-citizens/",
        "summary": "By Faith Awa Maji, KatsinaAs part of efforts to cushion the hardship induced by the removal of fuel subsidy and increase in the pump price of petrol, the Katsina State Governor, Malam Dikko Umaru Radda, has ordered all the 34 local government Chairmen to purchase grains as palliatives for immediate distribution in their areas.\nHe explained that the 34 Local Government Areas will purchase 36,100 bags of maize each using their monthly allocations from the Federation Account.\nRadda said the State Government will also order extra consignments of rice, maize and fertilizer from the Federal Government, for distribution to people and farmers in the State.\nAccording to him, “we are taking this progressive action to assiduously cushion the hardship of our people which was induced by the removal of the subsidy on petroleum products and fuel price hike.\nRadda noted that his administration is determined to better the lot of Katsina people and solicited for the support of all and sundry towards fulfilling his campaign promises."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/28/subsidy-removal-involve-csos-nigerians-in-dialogue-for-palliatives-fg-told/",
        "summary": "She said: “The decision to remove fuel subsidy have had significant implications on the lives of our fellow citizens.\nBefore the elections we engaged the presidential candidates and all of them at one point or the other made a commitment of removing the fuel subsidy but the how was never addressed.\nAccording to him, government should carry out widespread stakeholders and public consultations, engagements and enlightenment for the purpose of developing a plan for the utilisation of the savings from fuel subsidy, and on its strategy for cushioning the impact of subsidy removal.\n“There seems to be a consensus that the fuel subsidy regime failed due to corruption and inefficiencies in its administration.\nWithout a strong signal on fighting corruption, there is no guarantee that the potential savings from subsidy removal would be safe or appropriately utilized."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/25/subsidy-removal-fast-track-work-on-palliatives-for-suffering-masses-tuc-tells-fg/",
        "summary": "“Government should fast track the action and processes to ensure that work was concluded on all discussions on palliative packages,” Osifo told journalists.\nHe said, “As TUC we are ready to meet; even at night or weekend to ensure that the government fast track these processes because the plight of the Nigerian workers is our main concern.\nAnything that affects the Nigerian workers is what we will strive to correct.”He also urged the government to reduce the cost of governance saying Nigerian workers and masses could not continue to adjust their belts while those in government continued to live large.\nHe said: “The government cannot continuously ask workers and the battered Nigerian masses to continuously tie their belts.\n“When they told us about the planned electricity tariff increase we told them to put it on hold."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/17/n500bn-palliative-reps-mobilisation-for-approval-by-abass-kalu-excites-youths/",
        "summary": "Benjamin Kalu, for mobilising lawmakers to consider and approve President Bola Ahmed Tinubu’s subsidy removal palliative.\nThe House of Representatives had at the plenary last week granted approval to President Tinubu’s request for N500billion for fuel subsidy palliative for poor Nigerians.\nThe sudden fuel subsidy removal has left millions of Nigerians terrified, thus causing untold hardship.\nAbass Tajudeen and Deputy Speaker, Rt.\nBenjamin Kalu for mobilising lawmakers to consider and approve President Bola Ahmed Tinubu subsidy removal palliative."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/17/akpabios-leadership-capacity-helps-n500bn-subsidy-palliative-approval-group/",
        "summary": "By Olugbenga SalamiThe 10th National Assembly Legislative Support Group, NLSG, has said that the leadership capacity of President of the Senate, Godswill Akpabio, was the reason for easy consideration and passage of N500billion fuel subsidy palliative proposal by President Bola Ahmed Tinubu.\nThe National Assembly had at the plenary last week granted approval to President Bola Tinubu’s request for N500 billion for fuel subsidy palliative.\n“The President understanding the untold hardship being faced by Nigerians, requested to amend the 2022 Supplementary Appropriation Act so as to extract N500 billion from the budget to be expended on fuel subsidy palliatives.\n“The federal lawmakers gave the request express approval without any rancour as expected of a parliament as diverse as the 10th.\nWe are optimistic that the next four years under his leadership will witness a unified, productive assembly.”"
    },
    {
        "url": "https://nigerianpilot.news/2023/06/09/nigeria-no-longer-father-christmas-to-neighbouring-countries-tinubu/",
        "summary": "*Says he will run an open door policyBy Mathew Dadiya, AbujaPresident Bola Tinubu, Friday in Abuja said Nigeria longer be ‘Father Christmas’ to the neighbouring countries with continuous subsidizing Petroleum Motor Spirit (PMS) hence the need to remove it.\nWhy should we in good heart and sense, feed smugglers and be Father Christmas to neighbouring countries, even though they say not everyday is Christmas?\nTinubu declared that he is ready to work with any elected representative from the National Assembly, stressing that the Nigeria project is of paramount importance to him.\n‘‘Nigeria must survive, Nigeria must develop, Nigeria must make progress,’’ he said.\nThe Ooni of Ife, Oba Enitan Ogunwusi expressed delight that the country has remained united and focused despite the challenges."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/03/ngo-seeks-deactivation-of-petro-dollar-budgetary-economy/",
        "summary": "Ogwuche noted that to worsen the situation was the oil subsidy regime operated by some powerful individuals and its attendant negative consequences on the economy over the years.\nThe abundance of natural resources was a blessing and sources of pride to Nigeria as nation and Nigerians as a people.\n“Today, our economy is at the brink of total collapse due to the burden of consumption expenditures and petro-dollar syndrome without relative savings and investments to cushion the effect.\n“Our independent investigation had shown clearly that the major problem of Nigeria economy is directly traced to poor and fraudulent management of petroleum products and local transaction in dollars.\nIf the institution is strong, the business of governance will be very simple and easy for all of us."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/03/labour-party-faction-asks-peter-obi-to-withdraw-his-petition-against-tinubu/",
        "summary": "*Says Obi wasting Nigerians’ timeBy Michael OcheThe Lamidi Apapa faction of the Labour Party has asked Peter Obi, the presidential candidate of the party to withdraw his petition against the victory of Bola Ahmed Tinubu in the recently concluded 2023 election.\nAddressing journalists in Abuja on Friday, Dr Arabambi Abayomi, National Publicity Secretary of the party, accused Peter Obi of deceiving the OBIdients and giving them false hope that they have something at the tribunal.\nHe said, “Labour Party is thereby calling on him to get step down his selfish ambition and stop messing up the party if he has nothing serious to present to the tribunal.\nHe said the presidential candidate of the party, Peter Obi, who had the backing of the NLC and TUC had publicly supported the removal of fuel subsidy.\nHe said, “In fact our position about removal of fuel subsidy during all our campaign has not changed."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/01/petroleum-price-now-n555-per-litre-says-nnpc/",
        "summary": "The new price is following the President Bola Ahmed Tinubu’s announcement of the removal of fuel subsidy in Nigeria made during his inauguration in Abuja on May 29, 2023.\nThe NNPC Limited also fixed new prices across 36 States of the Federation for the Premium Motor Spirit PMS popularly known as fuel between N488 and N555 per litre.\nThe average price in the North Central zone will be N537 per litre, except in Illorin, where it will sell for N515 per litre.\n“We hold that the “fuel subsidy removal” is purported because it is a veiled cover to hike fuel prices and satisfy the greed of the private oil marketers.\nIt said that the sum of N1.243 trillion being fuel subsidy cost was not included in the nation’s budget for 2023."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/13/tinubu-pledges-to-improve-investment-in-education-as-nans-seek-review-of-loan-act/",
        "summary": "This was even as Speaking with State House correspondents after the meeting with the President, NANS President, Umar Barambu disclosed that they pointed out some gray arears in the Students Loan Act signed on Monday by the President appealing for a review of the Act in line with their demands.\n”I’m glad you understand the reason for the subsidy removal.\nThe Bill, sponsored by former House of Representatives Speaker Femi Gbajabiamila, was signed into law by President Tinubu on Monday, June 12, which is Democracy Day.\nWe want to equally thank you for the Students Loan Bill,” Barambu said.\nToday we are saying ‘yes’ to fuel subsidy removal and we will stand with that decision.”"
    },
    {
        "url": "https://nigerianpilot.news/2023/07/13/president-declares-state-of-emergency-on-food-security/",
        "summary": "By Mathew DadiyaPresident Bola Tinubu has declared a state of emergency on food security with immediate effect in the country.\nPresidential spokesman, Dele Alake, disclosed this while briefing State House Correspondents on Thursday at the Presidential Villa, Abuja.\nAlake said, the President’s action is predicated upon “noticeable rising food cost” across the country as a result of some recent government policies aimed at revamping the economy.\nHe said, among other measures, government would deploy some funds accruing from petrol subsidy removal immediately to the agricultural sector to check the food security challenge.\nMore details later…"
    },
    {
        "url": "https://nigerianpilot.news/2023/07/10/tinubu-akume-and-purpose-driven-leadership/",
        "summary": "Nigerians have to disregard ethnicity, political affiliation, religion, etc, to enable Mr. President and his appointees in positions of authority like Akume to achieve and do more for the country.\nThis is the time for us as Nigerians to put aside anything that could discourage President Tinubu and SGF Akume in transforming the government of the day.\nNow is the time to join forces with Mr. President in moving Nigeria forward.\nLabour Unions, Trade Union Congress and civil servants should also support Mr. President.\nIn a bid to ensure that every segment of the country is carried along, President Tinubu exemplified this in the just concluded appointment of Service Chiefs."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/09/hon-philip-agbese-drums-support-for-president-tinubu-abbas/",
        "summary": "Philip Agbese (APC- Benue), representing Ado/ Okpokwu/ Ogbadibo Federal Constituency, has reassured Nigerians of a renewed hope under President Bola Ahmed Tinubu.\nThe lawmaker also reiterated confidence in the leadership of the 10th House of Representatives under Rt Hon Tajudeen Abbas.\nUnder the Student Loans law, indigent students will no longer drop out of universities on account of their inability to pay school fees.\n“I say this with every sense of sincerity that President Tinubu is a blessing to Nigeria and the best leader for this country at this time.”.\nSpeaking on Rt Hon Abbas, Agbese added: “The Speaker is another God-sent to the nation."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/07/timi-frank-to-tinubu-dont-habour-or-negotiate-with-looters/",
        "summary": "Former Deputy National Publicity Secretary of the All Progressives Congress (APC), Comrade Timi Frank, on Friday, called on President Bola Ahmed Tinubu not to entertain, habour or negotiate soft landing deals with ex-government officials known to have abused their offices by looting the nation’s treasury.\nFrank said: “From all indications, your (Tinubu’s) Government is negotiating with looters and that is the reason why up till now we have not seen any new action against looters after the arrest and detention of Emefiele and Bawa.\n“Most likely, Nigerians will see more known looters rewarded with juicy positions in his cabinet.\n“Since the beginning of this administration, innocent Nigerians are the ones suffering and unfortunately they are being told to be patient in their excruciating miseries by the government.\n“How long would the poor be patient while those who looted their wealth are walking free and enjoying their loot?"
    },
    {
        "url": "https://nigerianpilot.news/2023/07/21/fuel-hike-cupp-a-political-mediocre-tool-toothless-bulldog-group/",
        "summary": "“Fuel subsidy removal in Nigeria is an economic necessity, as the subsidy funds could lead to major development gains.\n“It’s however laughable that the personal interests and frustrations of the promoters of CUPP have beclouded their reasoning.\nThe government is, however, working to mitigate the hardship occasioned by the increment in the fuel pump price.\nThe NNPCL chief has worked tirelessly to promote transparency, accountability, and good governance in the Nigerian oil and gas industry.\n“Today, the NNPC has become a world-class institution capable of competing with the best and brightest in the global energy industry."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/21/tinubu-approves-establishment-of-infrastructure-support-fund-for-states/",
        "summary": "…As FAAC shares N907bn from N1.9trn June revenueBy Mathew DadiyaPresident Bola Tinubu has approved the establishment of Infrastructure Support Fund (ISF) for the 36 States of the Federation as part of measures to cushion the effects of the petrol subsidy removal on the people.\nThe approval was disclosed at the monthly meeting of the Federation Account Allocation Committee (FAAC), on Thursday in Abuja.\nThe Committee also resolved to save a portion of the monthly distributable proceeds to minimize the impact of the increased revenues-occasioned by the subsidy removal and exchange rate unification-on money supply, as well as inflation and the exchange rate.\nThese savings will complement the efforts of the Infrastructure Support Fund (ISF) and other existing and planned fiscal measures, all aimed at ensuring that the subsidy removal translates into tangible improvements in the lives and living standards of Nigerians.\nThe Committee commends President Tinubu for the bold decision to remove the petrol subsidy, and even more importantly, for providing necessary support to the States to cushion the effects of the subsidy removal on Nigerians."
    },
    {
        "url": "https://nigerianpilot.news/2023/08/02/sack-kyari-now-or-take-responsibility-for-his-failure-csos-urge-tinubu/",
        "summary": "To this end, the CSOs with shared common vision of a prosperous Nigeria have have asked the President to relieve Mr. Mele Kyari, the Group Managing Director of NNPCL or take responsibility for his abysmal performance in the management of the sector.\nPresident, during your campaigns, you vowed to alleviate the burden on the poor, promising not to suffocate them.\nHowever, the current socio-economic conditions in the country have left us wondering and questioning the effectiveness of your economic decisions and policies.\nWe therefore demand Kyari’s immediate removal and the commencement of a comprehensive restructuring of the NNPCL”.\nMele Kyari must leave to give room for a thorough and comprehensive audit of the petroleum sector."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/31/there-is-fresh-plot-by-oil-crooks-to-blackmail-smear-kyari-csos/",
        "summary": "A coalition of Civil Society Organizations (CSOs) on Sunday said it has uncovered fresh plot by embittered oil thieves to blackmail, smear and tarnish the image of the group chief executive officer of the Nigerian National Petroleum Company Limited (NNPCL), Mallam Mele Kyari.\nDays after this drama, several unknown and faceless groups flocked the internet clamouring for Kyari’s removel.\n“It’s laughable that they are calling for the removal of a man who has restored the glory of the national oil company.\n“Since Kyari assumed office even as the group managing director of the defunct NNPC, he has operated a very transparent system.\n“Several times, he has made open the books of the oil company for public scrutiny."
    },
    {
        "url": "https://nigerianpilot.news/2023/08/08/coalition-accuses-kyari-of-mismanagement-demands-accountability/",
        "summary": "Mele Kyari, masquerading as the Group Managing Director (GMD) of Nigeria National Petroleum Company Limited (NNPCL) is unarguably the head of that cartel.\nWe can’t fold our hands and watch Mele Kyari and his band of rogues destroy our economy and standard of living.\nThe Coalition stated further that Kyari was aware of massive oil theft long before acknowledging it publicly.\nIt is shameful that NNPCL under Mr. Mele Kyari has listed its achievements through this hired group.\nIt is even a shame for Mele Kyari to boast about declaring those paltry sums as profits, even as the entire claim is in itself unverified."
    },
    {
        "url": "https://nigerianpilot.news/2023/08/25/fg-blasts-edo-gov-for-attacking-tinubus-economic-policy/",
        "summary": "Rather than delving into narratives that do not provide the complete picture, the focus should be on how the Edo State Government will be using available resources to drive impactful projects that genuinely uplift the people of Edo State,” the government spokesman said.\n“We are still at a loss on what could be the trigger for Governor Obaseki to issue such blatantly false accusations against the Federal Government.\nIt would be helpful if Governor Obaseki participated in these meetings to provide insights and align with the collective vision.\nPresident Tinubu is guiding our country through very challenging times.\nAs President Tinubu has admonished the minister said, “the time for politics and politicking is over."
    },
    {
        "url": "https://nigerianpilot.news/2023/08/22/we-mean-well-for-nigerians-in-difficulty-first-lady/",
        "summary": "* Meets with wives of Service Chiefs, IGPBy Mathew DadiyaThe First Lady, Senator Oluremi Tinubu Tuesday assured Nigerians that despite the hardship being experienced by many citizens due to the removal of fuel subsidy, the administration of President Bola Tinubu means well for the country.\nThe Wife of the President urged Nigerians to look beyond the present situation in the country and see the bigger picture which has light at the end of the tunnel.\nShe promised that the RHI would soon be reaching out to vulnerable widows of fallen officers in the military.\nShe said this is importantly so because these are all areas of interest to all the Associations.\nThe First Lady was then decorated as the Grand Matron of the Defence and Police Officers Wives Association, which is as enshrined in the constitution of the various associations."
    },
    {
        "url": "https://nigerianpilot.news/2023/09/05/strike-nlc-conniving-with-opposition-to-inflict-pains-on-citizens-project-nigeria/",
        "summary": "…Says impact worse than subsidy painsA coalition of 100 civil rights groups has accused the Nigeria Labour Congress (NLC) of conniving with the opposition to inflict pain on Nigerians.\nRecall that the NLC today began a two-day strike over the end of the subsidy regime, warning of a “total shutdown” after 14 days.\nDescribing the NLC leaders as greedy, prejudiced, and evil, Akinmosu said they are funded by the opposition to cause chaos.\n“As critical stakeholders in the Nigeria project, we are compelled to react to the two-day warning strike by the NLC.\n“We, therefore, are convinced that the NLC is conniving with the opposition to wreak havoc on the economy and intentionally create tension in the nation."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/02/subsidy-were-not-going-on-protest-today-nlc-clarifies/",
        "summary": "By Michael OcheThe Nigeria Labour Congress (NLC) has said it has no plans to commence industrial action on Friday to protest increase in the prices of premium motor spirit otherwise known as petrol.\nThe NLC in a statement by Benson Upah, its Head of Information and Public Affairs said it was reacting to reports circulating in the social media space claiming that the Congress would commence protest action today against the increase in the pump price of pms.\nHe clarified that in as much as the Congress is outraged by this mindless price increase which is intended to bring untold hardship to ordinary Nigerians, it has no plan to start any action today.\nHe said, “What we do have for now are organ meetings slated for tomorrow, Friday, June 2nd, 2023 to deliberate on the price issue.\n“ We promise to keep Nigerians informed on our next line of action after our meetings."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/01/fuel-subsidy-nlc-tuc-fgs-meeting-deadlocked/",
        "summary": "Organised Labour, comprising the Nigeria Labour Congress (NLC) and the Trade Union Congress of Nigeria (TUC) on Wednesday commenced negotiations with officials of the federal government on the recently announced fuel subsidy removal.\nThe proclamation of an end of the fuel subsidy regime by President Bola Tinubu on Monday during his inaugural speech has sparked hoarding of the product and panic buying.\nThe Organised Labour is led by the President of the NLC, Comrade Joe Ajaero, and his TUC counterpart, Comrade Festus Osifo.\nLabour however demanded that the new subsidy should be reversed before any negotiation commenced.\nHowever, a source said the organ of the Nigeria Labour Congress is expected to meet on Friday to take a decision on its next line of action."
    },
    {
        "url": "https://nigerianpilot.news/2023/05/31/cso-others-hail-tinubus-removal-of-fuel-subsidy/",
        "summary": "He said the sum of N1.243 trillion being fuel subsidy cost was not in the nation’s budget for 2023.\nIt lamented that the pillage of resources in the guise of fuel subsidy has taken too long, thereby making the scam looks like a mystery.\n“As at 2022, the Federal Government of Nigeria pay out N1.243 trillion as fuel subsidy monthly.\n“The so-called fuel subsidy regime has not mitigated the economic woes of the nation, even as consumers buy fuel a high price of N600 per litre,” it stressed.\nTo sustain the policy of subsidy removal, the CSO urged President Tinubu to rejig the nation’s borders and tackle fuel smugglers to the neighbouring countries."
    },
    {
        "url": "https://nigerianpilot.news/2023/05/31/fuel-subsidy-no-nation-can-sustain-n400bn-monthly-to-saboteurs-natives-backs-tinubu/",
        "summary": "…Calls for revocation of licence of saboteurs, fuel hoarders…Wants Tinubu to unite with Atiku, Peter Obi, othersA pro-Democracy and anti-sabotage group, The Natives, has declared support for the removal of fuel subsidy by the administration of President Bola Ahmed Tinubu, saying no Nation can continue to waste about N400 billions to few people monthly.\nThe Natives also demanded immediate revocation of licence of some people in oil sector described as “saboteurs” and those hoarding the fuel across the Nigeria.\nPresident Tinubu in his inaugural speech said there was no provision for a fuel subsidy beyond June 2023, adding that “fuel subsidy is gone.”The declaration has, however, led to fuel scarcity and panic buying.\nPresident, we heard you loud and clear, the budget that you have glimpsed and heard before assuming office makes no room for fuel subsidy, therefore fuel subsidy is gone.\n“We shall engage President Bola Ahmed Tinubu meaningfully to ensure that this country is governed under the rule of law and for the prosperity of all Nigerians."
    },
    {
        "url": "https://nigerianpilot.news/2023/05/31/beneficiaries-of-petrol-subsidy-scam-will-oppose-removal-says-shettima/",
        "summary": "By Mathew DadiyaIn fulfillment of an earlier commitment to hit the ground running, the Vice President, Senator Kashim Shettima, Tuesday resumed work at the Presidential Villa, interacting with the Permanent Secretary, State House, Mr Tijanni Umar, some management staff of the Office of the Vice President and State House Correspondents.\nThe Vice President was accompanied to the Office by his personal aides where he met with the Permanent Secretary and senior civil servants in the Office of Vice President.\nHe is determined, he has the skills set, the temperament, the disposition and the purity of mind and commitment to give service to this nation,” he added.\nThe issue of fuel subsidy will be frontally addressed, the earlier we do so, the better.\nShettima was sworn-in on Monday, May 29, as Nigeria’s number two citizen at a historic ceremony attended by leaders across Africa and beyond, marking the beginning of a new journey tagged “renewed hope”."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/14/with-kyari-as-nnpc-boss-nigeria-will-reap-gains-of-subsidy-removal/",
        "summary": "Stand Up Nigeria, a front line civil society organization has expressed confidence that with Mele Kyari as head of the NNPCL, Nigeria will reap the intended gains of subsidy removal.\n“Under Mele Kyari, challenges which in the past had appeared insurmountable, have been overcome bringing about a turn around in the fortunes of the company.\n“Stand Up Nigeria therefore, urges Nigerians to support the NNPCL under the leadership of Kyari so that the reforms in the sector will succeed to the benefit of the government and people of Nigeria.\n“There’s no doubt that Mele Kyari has brought integrity to the Nigerian oil industry.”Stand Up Nigeria said in assessing the performance of Kyari, it is important to look at his achievements from the perspective of the timing of his appointment.\n“It was a turbulent period characterised by low production, the burgeoning vandalisation of oil pipelines, oil theft on a grand scale, and demoralised staff of the corporation."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/08/tinubu-asks-nec-to-work-on-interventions-for-subsidy-removal/",
        "summary": "* Major oil marketers back President, donate 100 busesBy Mathew Dadiya, AbujaPresident Bola Tinubu has told the National Economic Council (NEC), led by Vice President Kashim Shettima to begin the process of providing interventions to ameliorate the impact of subsidy removal on the people.\nOgun State governor, Dapo Abiodun, said this after leading some major oil marketers on a courtesy call on President Bola Tinubu at the Presidential Villa, on Tuesday in Abuja.\nMeanwhile, the Major Oil Marketers said they have donated 100 mass transit buses worth N10 billion to the federal government to cushion the effect of subsidy removal.\nDame Winifred Akpani, Chairman of DAPPMAN, said the courtesy visit was to express the major oil marketers utmost support to the Federal Government.\nShe said that they were aware of the difficulties the subsidy removal has created in the country, expressing optimism that it was going to reposition the country."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/08/govs-support-subsidy-removal-other-policies-of-tinubus-administration/",
        "summary": "By Mathew Dadiya, AbujaState Governors on Wednesday expressed strong support for President Bola Tinubu’s decision to end fuel subsidy payments in the country and other early policy initiatives of the administration.\nThey congratulated the President for tackling the fuel subsidy behemoth, promising to work with him to ameliorate the short-term impact of the decision.\nThe President advised the political leaders to downplay their differences and jointly focus on alleviating the sufferings and pains of the people.\nWe must work for our people,’’ President Tinubu told the governors, while assuring them that he would maintain an open-door policy.\nThe governors made suggestions highlighting the plight of citizens in their states, assuring the President of their support in proffering solutions through the National Economic Council."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/07/subsidy-develop-functional-partnership-with-organise-labour-lukman-tells-tinubu/",
        "summary": "However, beyond the suspension of the planned strike action, APC and the government of President Tinubu must consider developing functional partnership with organise labour.\n“The partnership must be strategically to facilitate consultations between organised labour, APC as a party and the governments it controls both at federal and state levels.\nWhat exists today as Labour Party is a corrupt representation of the Labour Party envisioned by the NLC in 2002.\nThis is what produced Mr. Peter Obi as the Presidential candidate of the Labour Party in the 2023 elections.\n“Developing a functional partnership relationship with organised labour, and by extension other groups, require deeper political reforms in the country."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/05/fuel-subsidy-fraud/",
        "summary": "What this means according to documents is that landing cost, which the free onboard cost, is equal to the production cost of NNPC, and which if put in higher limit is $30 per barrel.\nSo, all these issues of subsidy putting pressure on the naira causing it to devalue, is not true.\n“All the companies that have collected monies under subsidy in the direct sales, direct purchase arrangement must return the monies, and all these talks about removing the subsidy, is actually a lie.\nAll they just want to do is to increase the pump price of fuel, because, before now there is no subsidy.\nPeople were just being given money; no subsidy."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/05/nlc-boycotts-as-fg-tuc-meet-over-subsidy-removal-in-villa/",
        "summary": "By Mathew Dadiya, AbujaNigerian Labour Congress on Sunday refused to honour a meeting called by Federal Government to resolve the crisis arising from the removal of subsidy on petrol.\nThe FG however met with representatives of the Trade Union Congress (TUC) at the Presidential Villa, Abuja.\nIt would be recalled that the Organised Labour, including the Nigerian Labour Congress (NLC) and the Trade Union Congress (TUC) held a meeting with the government last Wednesday, which was held in a deadlock.\nMeanwhile, NLC President, Comrade Joe Ajaero, who described the recentNNPC pricing template as vexatious and an ambush, added that the dialogue is in danger.\nThere must be flexibility to allow concessions and reasonable accommodation that will produce the best result for Nigerian people."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/03/subsidy-removal-reverse-to-status-quo-tuc-tells-fg/",
        "summary": "Comrade Festus Osifo, TUC President, therefore asked the Federal Government to revert to status quo its decision to remove fuel subsidy, which has seen the retail price jump from N185 per litre to N537 per litre.\nAccording to Osifo, the Congress is unhappy with the unilateral decision of the Federal Government to remove the subsidy.\n“Having noted this, we wish to state that the NEC-in- session resolved that discussions with Federal Government should continue while demanding that the government should revert to the status quo ante.\n“The status quo ante should be maintained while discussions continue as we had a meeting with the government on Wednesday.\n“Once we are done with that meeting then the TUC is going to put its demands forward, it is how they react to those demands that will determine our next line of action, ”he said."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/03/subsidy-removal-well-review-minimum-wage-to-reflect-realitytinubu-assures/",
        "summary": "“This meeting is not strange to me, and the content of the meeting is so valuable.\nThis is the first time you entered the Council Chambers, and it is my first time too for a meeting.\n“Let us rally around the President and not bulge, there are vested interests that may want to resist the subsidy removal.\nThe Progressive Governors’ Forum (PGF), threw its weight behind the federal government on the decision to remove petrol subsidy.\nHowever, the governors also voiced their concern over the sudden hike in petrol prices following the president’s inaugural speech."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/03/nlc-to-begin-indefinite-strike-wednesday-over-subsidy-removal/",
        "summary": "The NLC gave the NNPCL till Wednesday to return to the old price of N194 per litre or it would direct its members to withdraw their services nationwide.\nPresident of NLC, Joe Ajaero said this at the end of meetings with organs of the Congress in Abuja on Friday.\nThe pronouncement has however generated debates, with Labour insisting on the old pump price.\nHe said: “The Nigeria Labour Congress is calling for a thorough probe in the process of subsidy to know those involved and the amount involved.\n“The current attempt to sweep the fraudulent practices in the subsidy regime should not be tolerated by all well-meaning Nigerians.”"
    },
    {
        "url": "https://nigerianpilot.news/2023/06/02/subsidy-cta-knocks-nnpcl-over-sudden-fuel-price-hike/",
        "summary": "By Michael OcheCentre for Transparency Advocacy (CTA) has asked the Nigerian National Petroleum Corporation Limited (NNPCL) to offer an explanation on how it arrived at the current price of Premium Motor Spirit (PMS) popularly known as fuel.\nThe NNPCL had on Tuesday announced a new price regime for fuel, a situation that has seen pump price jump from N185 per litre to N537 per litre.\nHowever, in a statement on Thursday, CTA Executive Director, Faith Nwadishi said Nigerians deserve to understand the methodology and reasoning behind the new pricing structure.\nWith the June 30th deadline for the fuel subsidy removal approaching, it is crucial for citizens to fully grasp the current happenings and the government’s future plans.\nThe CTA will relentlessly advocate for transparency, fairness, and social justice in all sectors affecting the livelihood of Nigerians.”"
    },
    {
        "url": "https://nigerianpilot.news/2023/07/11/fuel-subsidy-senate-probes-buhari/",
        "summary": "*Resolves to probe fuel subsidy from 2015 to May 29, 2023*Frowns at N9.3trn spent on subsidy between 2021 and 2023 under his watch*Seeks living wage for workers, 3 functional refineries for local production to reduce fuel price*That its C’ttee on Petroleum (down/upstream) should carry out holistic probe of subsidy regimeBy Okechukwu JomboThe Senate Tuesday resolved to probe the fuel subsidy under-recovery regime operated by the federal government from 2015 to May 29, 2023 when the subsidy was eventually removed.\nIt specifically frowned at N9.3 trillion expended on the subsidy regime by the federal government from January 2021 to June 2023.\nSenate’s resolutions to this effect were sequel to a motion sponsored by Senator Chiwuba Ndubueze (APC) Imo North).\nMany of the Senators who contributed to debate on the motion, frowned at bogus expenses made on the subsidy regime by NNPCL and supported all the prayers sought for in the motion.\nThe Senate accordingly resolved that its standing committees on Petroleum (Downstream), Petroleum (Upstream) and Finance should, when constituted, carry out holistic investigation on all controversies surrounding subsidy and under recovery regime."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/11/naja-holds-annual-training-capacity-building-workshop-on-alternative-to-subsidy-removal/",
        "summary": "By Onu OkorieThe Nigeria Auto Journalists Association (NAJA), the umbrella body for journalists in the print, electronic and online media platforms reporting the automotive industry in Nigeria, says its annual Training /Capacity Building Workshop for 2023 will be held on August 24 in Lagos.\nChairman of NAJA, Mike Ochonma in a statement said two very critical themes have been chosen for the NAJA Training/Capacity Building workshop because of its crucial importance to Nigeria’s automotive industry.\n“In other to equip our members with the necessary tool, we have as our major theme, Motoring Journalists and Role of New Media in Automotive Reportage.\nAnother crucial theme during the 1-day event is, ‘Natural Gas (CNG, LNG, LPG) as an Alternative amid Fuel Subsidy Removal.\nMr. Ochonma also called on stakeholders in the industry to support this year’s annual event for motoring journalists in Nigeria with a very large market for the automotive market."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/07/subsidy-kefas-declares-free-education/",
        "summary": "Governor Agbu Kefas Kefas Declares Secondary Schools Free in Taraba StateKefas made the declaration at the Ebenezer Primary School in Wukari on Friday.\nAccording to him, starting from the next academic session, primary and secondary education in Taraba State will be free.\nThe governor emphasized that it is the government’s responsibility to bear the expenses and that students should not be subjected to any fees.\nHe said that apart from fulfilling a campaign promise, the hardship occasioned by the removal of the fuel subsidy has made the move imperative."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/30/nass-member-commends-md-rea-on-post-subsidy-removal-initiatives/",
        "summary": "…Says Tinubu Needs More Intelligent Young Nigerians To Renew Our Hopes_Rep Philip Agbese (APC), the lawmaker representing Ado/ Okpokwu/ Ogbadibo Federal Constituency, has applauded the Managing Director (MD), Rural Electrification Agency (REA), Engr Ahmad Salihijo Ahmad, for his post-subsidy removal initiatives.\nAccording to Agbese, the adoption of solar energy has expedited industrial activities, fostered agricultural growth, and bolstered small and medium enterprises.\n“The REA has adopted solar energy as a sustainable and empowering solution for Nigeria as the country grapples with the challenges resulting from the removal of fuel subsidies.\nThese interconnected projects, aimed at improving small businesses for young Nigerians, are timely when youth unemployment stands at 53.40 per cent.\nThe lawmaker, however, urged President Bola Tinubu to appoint more competent young Nigerians like Salihijo to achieve his Renewed Hope agenda."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/29/global-amnesty-watch-salutes-tinubu-for-subsidy-removal-addressing-nigerias-challenges/",
        "summary": "The Global Amnesty Watch (GAW) has commended President Bola Tinubu for taking the bold step to remove fuel subsidy.\n“One of the critical decisions taken by the Bola Tinubu administration was the announcement of the removal of subsidy on Premium Motor Spirit,” the report said.\n“It is a statement of the fact that the decision by President Bola Tinubu is a step that would put the country in good stead economically.\nPresident Bola Tinubu is conversant with the economic implication of nonaction in addressing the economic challenges in the country.\n”The report further hailed President Bola Tinubu for rejigging the security architecture by appointing new service chiefs and the National Security Adviser."
    },
    {
        "url": "https://nigerianpilot.news/2023/06/19/smuggling-of-petrol-drops-drastically-after-subsidy-removal-customs/",
        "summary": "By Padio Phineas, YolaThe Nigeria Customs Service has disclosed that smuggling of Premium Motor Spirit (PMS) into Cameroon has drastically reduced after the removal of fuel subsidy by President Bola Tinubu.\nKazaure noted that smugglers of PMS have since abandoned the illegitimate business of taking the product across the border to Cameroon republic, after the removal of subsidy in the country.\n“The Nigeria Customs Service is one of the agencies saddled with the responsibility of implementing the Federal Government policy on the movement of fertilizer.\nThe Comptroller also frowned at the attitude of some desperate Nigerians who smuggled Cameroonian made bar soaps into Nigeria.\nAccording to him, “if these unpatriotic actions of a few are allowed, it will kill local soap industries.”"
    },
    {
        "url": "https://nigerianpilot.news/2023/06/16/nigerias-inflation-rate-rises-to-22-41-amid-petrol-subsidy-removal/",
        "summary": "The latest figure is the fifth consecutive rise in the country’s inflation rate this year, as Nigerians adjust to the effects of the recent petrol subsidy removal.\nAccording to the NBS report, “in May 2023, the headline inflation rate increased to 22.41 percent relative to April 2023 headline inflation rate which was 22.22 percent”.\n“Looking at the movement, the May 2023 inflation rate showed an increase of 0.19 percentage points when compared to April 2023 headline inflation rate,” NBS said.\n“Similarly, on a year-on-year basis, the headline inflation rate was 4.70 percentage points higher compared to the rate recorded in May 2022, which was (17.71 percent).\nAccording to NBS, the food inflation rate in May 2023 was 24.82 percent on a year-on-year basis."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/31/subsidy-removal-forex-policy-already-yielding-positive-results-fg/",
        "summary": "By Emmanuel ObisueFederal Government has heaped praises on itself on the some of its newly instituted policies, including the removal of fuel subsidy and the new forex regime, which it says are already “yielding positive results”.\nThis position was taken by the Secretary to the Government of the Federation, George Akume over the weekend while he spoke at a Gala and Award Night in commemoration of the 2023 Civil Service Week in Abuja.\nFor this and many other of Tinubu’s policies, the SGF said the current administration “have received the support and commendation of the global community for our courage in introducing these policy shifts”.\nNigerian Pilot had reported that President Tinubu in his inaugural address on May 29, declared that there would no longer be a petroleum subsidy regime as the current 2023 budget does not contain provisions for it.\nThe spiraling effect of his statement has seen the price of premium motor spirit, PMS, now fixed at over N600, amid high cost of living."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/27/subsidy-why-nigerians-should-exercise-patience-with-tinubu-rights-group-warns-nlc-against-strike/",
        "summary": "A Coalition of Civil Society Organisations and Political Parties for Good Governance (COSOSAP) has warned the Nigeria Labour Congress (NLC) against embarking on a nationwide strike or protest, saying such will complicate hardship for Nigerians.\nThe Labour Unions had given the federal government a-week ultimatum to reverse fuel subsidy removal and other policies consider to be anti-people.\n“It suffice therefore to say that, the only way our dear nation Nigeria would not go the way of failed states like Venezuela and Sri Lanka etc., is to obliterate the fuel subsidy regime.\nLet us support this administration so that we can survive the current challenges of the transition from a regulated fuel subsidy based economy, to a fuel subsidy free economy.”The rights group also welcomed and commended the President on the declaration of state of emergency on food security in the country.\n“On this note, we welcome and commend the declaration of the State of Emergency on Food Security by the President."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/27/nationwide-strike-looms-over-subsidy-removal/",
        "summary": "The communiqué issued on Wednesday was signed by NLC president, Comrade Joe Ajaero and General Secretary, Comrade Emmanuel Ugboaja.\nRecalled that on the 29th day of May, 2023, President Tinubu at his inaugural speech announced an increased in the price of Premium Motor Spirit (PMS) from N185 to N500.\nThe CWC said the federal government has shown enormous disdain and contempt for Nigerian people and workers having acted and continued to act without regards to the welfare and cries of the citizenry.\nThe comminute resolved “to give the federal government a Seven – Day ultimatum within which to meet all our demands and to embark on a nation-wide action beginning Wednesday the 2nd of August, 2023 to compel the government to reverse its anti-poor and anti- workers policies.\n“To consequently direct all Affiliates and State Councils to begin immediate mobilization and closely work with associations, individuals and other entities including the ones already on the streets to ensure that the government listens to the people”, the communiqué read."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/26/subsidy-removal-nigerian-youths-laud-kyaris-transparency-drive-call-for-patience/",
        "summary": "Nigerian youths have commended the group chief executive officer of the Nigerian National Petroleum Company Limited (NNPC Ltd), Mallam Mele Kyari, for promoting transparency, probity, accountability, and good governance in the Nigerian oil and gas industry vis-à-vis his handling of the recent fuel subsidy removal initiative.\nThe youths, under the aegis of the Nigerian Youths Alliance (NYA) made this known in a statement co-signed by its national president, Ifeanyi Ogbu, and secretary, Yemisi Oluwadamiro, in Abuja, on Wednesday.\nAccording to the statement, “As Nigerian youths, even in these trying times, we must recognize, commend and encourage the efforts of our patriots who are having sleepless nights to ensure this nation works.\n“Nigerians will attest to the fact that Kyari’s achievements have surpassed all his predecessors for the past 20 years.\n“In barely two months since the government stopped payment of fuel subsidy payment, he delivered a whopping N123 billion to FAAC."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/23/sightsavers-expresses-concern-over-the-impact-of-fuel-subsidy-removal-medical-brain-drain-on-devt-process-in-nigeria/",
        "summary": "The removal of fuel subsidies in Nigeria has far-reaching implications for Sightsavers’ work in remote and marginalized communities.\n“Medical Brain Drain: A Drain on Nigeria’s Healthcare System.\nOur ability to train local healthcare workers and build sustainable eye health systems relies heavily on having a skilled and motivated workforce.\nThis collaborative approach will ensure sustainable eye health systems and effective NTD control strategies.\nStating that, “However, by taking proactive measures to address these issues, we can safeguard the progress made in combating NTDs and promoting eye health."
    },
    {
        "url": "https://nigerianpilot.news/2023/07/21/nnpcl-begins-remittance-into-federation-account-after-exiting-fuel-subsidy-shackles/",
        "summary": "The remittance is coming barely two months after the NNPC exited the fuel subsidy shackle following the removal by President Bola Tinubu.\nDuring the FAAC distribution,which was chaired by the Accountant General of the Federation, Dr. Oluwatoyin Madein, the NNPCL remitted N123bn into the coffers of government.\nFrom the N301.501bn distributable statutory revenue, the Federal Government received N146.710bn, the State Governments received N74.413bn and the Local Government Councils received N57.370bn.\nThe Federal Government received N40.984bn, the State Governments received N136.613bn and the Local Government Councils received N95.629bn from the N273.225bn distributable Value Added Tax (VAT) revenue.\nThe N11.436bn Electronic Money Transfer Levy (EMTL) was shared as follows: the Federal Government received N1.715bn, the State Governments received N5.718bn and the Local Government Councils received N4.003bn."
    },
    {
        "url": "https://nigerianpilot.news/2023/09/15/subsidy-removal-fg-assures-nigerians-on-ease-of-temporary-hardships/",
        "summary": "By Palma IleyePermanent Secretary, Ministry of Budget and Economic Planning, Nebeolisa Anako, has assured Nigerians that Federal Government was working round the clock to ease the current and temporary hardship in the Country as a result of fuel subsidy removal.\nHe said the current hardship, in the wake of economic reforms, which had resulted in the removal of fuel subsidy and the floating of the naira, was temporary.\nHe said that as other medium-term measures unfolded, Nigerians would appreciate the rationale behind these decisions.\nRepresented by his Deputy, Kola Adewusi, the Governor appreciated the programme’s organisers for giving Osun the hosting right.\nHe urged participants to develop immediate measures to mitigate the challenges caused by the present economic reforms through subsidy removal and floating of the Naira."
    },
    {
        "url": "https://nigerianpilot.news/2023/08/19/subsidy-fg-to-establish-presidential-cng-fuel-initiative-for-vehicles-nationwide/",
        "summary": "Under the aegis of the PCNGI, the following strategic objectives will be achieved: The development of new stakeholder-operated Intrastate Mass Transit systems built on CNG.\nSupport for states to onboard new CNG buses as part of their Intrastate Mass Transit network (wholesale conversion, retro-fitting and new purchase).\nThe deployment of CNG buses through existing Private Mass Transit operators, including new financing programmes for operators through an innovative asset finance programme.\nIncentivize investors to invest in CNG processing, distribution and utilization by providing incentives for enhanced investment and partnership.\nThe President’s focus on assembling CNG-enabled vehicles within the country will stimulate economic growth, create employment opportunities, and bolster the nation’s automotive manufacturing capabilities."
    },
    {
        "url": "https://nigerianpilot.news/2023/08/17/subsidy-removal-brought-untold-hardship-in-nigeria/",
        "summary": "By the grace of God the next training shall capture the state chairpersons and secretaries of women committee since the participants for this first phase is for national women commission executives as well as zonal chairpersons and secretaries.\n“The commission urges all participants to make the workshop a businesslike by being attentive and take part in whatever is taught,” she advised.\nPlateau Head of Service, Mrs Rauta Dakok has said that Governor Caleb Mutfwang would appoint more women and youth in his next round of appointments.\nDakok commended AUPCTRE national women commission for the choice of the theme for the education programme “Advancing Women Participation in Trade Unionism at Workplace” and described it as apt and timely.\nThe head of service encouraged the women and indeed civil servants to always update their knowledge saying that education is key to success."
    },
    {
        "url": "https://nigerianpilot.news/2023/08/16/fuel-subsidy-coalition-demands-overhaul-of-nnpcl/",
        "summary": "The group at a press conference in Abuja particularly demanded the sack of the NNPCL Group Managing Director, Engr Mele Kyari over his alleged failure to curtail the abuse of the fuel subsidy regime.\n“Sadly, it appears Mr. President is shying away from the real issues.\n“Therefore we urge you again Mr. President, sack Mr. Mele Kyari now!\nLet us also remind Mr. President that he needs to know exactly what has happened in NNPCL over thelast few years.\nTherefore, he must as a matter of necessity remove Mr. Kyari before he can see clearly, the rot and mess in the NNPCL.”"
    },
    {
        "url": "https://nigerianpilot.news/2023/07/31/subsidy-removal-i-came-to-help-not-to-hurt-people-tinubu/",
        "summary": "Removal of this once helpful device that had transformed into a millstone around the country’s neck had become inevitable.\nMuch is in the balance.”President Tinubu said that the defects in the “economy immensely profited a tiny elite, the elite of the elite you might call them.\nIf there were, I would have taken that route as I came here to help not hurt the people and nation that I love.\nWith the fund, our states will become more competitive and on a stronger financial footing to deliver economic prosperity to Nigerians.\nHe, however, said, “Sadly, there was an unavoidable lag between subsidy removal and these plans coming fully online."
    },
    {
        "url": "https://nigerianpilot.news/2023/03/03/fg-donates-relief-items-to-victims-as-buhari-tours-ruins-of-maiduguri-market/",
        "summary": "The Minister pledged that the Ministry, in collaboration with the Borno State Government, would provide building materials to rebuild the market.\nAcknowledging the support by the Federal Ministry of Humanitarian Affairs, he said the State government has provided an immediate support of N1 billion.\nEarlier at the palace of the Shehu of Borno, President Buhari said he was also in the State to commission projects executed by the Prof Zulum led administration.\n“I am delighted to be here with the Shehu and the good people of Borno State, to commiserate with you on the unfortunate Monday Market fire incident.\n“I like to put on record my deep and sincere appreciation of the love and support of the people of Borno State."
    },
    {
        "url": "https://nigerianpilot.news/2023/02/16/chinese-scientists-generate-turkish-earthquake-relief-analysis-for-un/",
        "summary": "/CFPThe United Nations Satellite Centre (UNOSAT) has activated its emergency mapping service in quake-hit areas in Türkiye to aid relief efforts.\nIn fact, this did not take into account the different disaster resistance capabilities of different areas,” said Li.\n/ChangjiangyunGenerating data via satellitesLi’s team analyzed satellite data, which is updated every day, combining macro and micro observations.\n“The data may help policymakers analyze the disaster situations in different areas and allocate relief resources better,” Li said.\nSince 2012, Li’s team has been engaged in the research field of luminous remote sensing, assessing impact of humanitarian disasters with related data."
    }
]