[
    {
        "url": "https://www.ripplesnigeria.com/ranking-nigerian-governors-august-2023-subsidy-palliatives-sanwo-olu-zulum-again-stand-out/",
        "summary": "Ranking Nigerian Governors, a monthly special publication of Ripples Nigeria, returns for the month of August, 2023, to review the performance or otherwise of Nigerian states chief executive officers.\nThe contrary has, however, remained the reality on ground, as there is a near-total disconnect between the performances of state governors and the expectations of the people, leading to widespread mistrust.\nIn the July 2023 edition of Ranking Nigerian Governors, we focused on response of state governors to the hardships occasioned by the removal of fuel subsidy by the Federal Government, identifying states where responses were less than concrete but mundane and ephemeral.\nFor the month of August 2023, Ranking Nigerian Governors seeks to again, review these responses and what has been done so far.\nThe lacklustre performance of state governors across the country in cushioning the effects of the subsidy removal, we dare say cannot be justified, especially with increased revenue allocation from the FAAC since July 2023."
    },
    {
        "url": "https://www.ripplesnigeria.com/like-reps-senate-denies-recieving-n100m-palliative-from-govt/",
        "summary": "Read also: Reps reply NLC, deny receiving N100m palliatives each from govt“There is no N100 million for a legislator anywhere, from which budget is this coming from,” Adaramodu said.\n“The National Assembly shall not hesitate, henceforth to take constitutional and legal actions against irreverent merchants of rumours and ill wills against legislators.\n“The National Assembly should not be taken as a political scapegoat.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/miyetti-allah-begs-tinubu-for-special-palliatives-for-herdsmen/",
        "summary": "The umbrella body of Fulani people in Nigeria, Miyetti Allah Cattle Breeders Association of Nigeria (MACBAN), has called on President Bola Tinubu and the federal government to give “special palliatives” to Fulani herdsmen to cushion the effect of fuel subsidy removal in the country.\nNational President of the Miyetti Allah, Alhaji Abdullahi Bodejo, who addressed the press conference, said most herders had no bank accounts where they can easily access funds when in need and their major needs now included food and shelter.\nRead also: Miyetti Allah begs Tinubu to appoint its members into govtHe added that a major problem Fulani people face came as a result of not having bank accounts where they save money.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-removal-serap-gives-governors-7-days-to-disclose-spending-of-n2bn-palliative/",
        "summary": "Socio-Economic Rights and Accountability Project (SERAP) has implored the 36 state governors in the country to “disclose details on spending of the N2 billion palliative recently disbursed to each state by the Federal Government, including the names of beneficiaries and details of the reliefs so far provided with the money.”The Federal Government recently disbursed N2 billion to each state of the federation and the federal capital territory (FCT) out of the N5 billion palliative package to alleviate the effects of the removal of fuel subsidies.\nEnforcement) Act.”“SERAP urges you to invite the Economic and Financial Crimes Commission (EFCC) and the Independent Corrupt Practices and Other Related Offences Commission (ICPC) to jointly track and monitor the spending of the N2 billion fuel subsidy palliative and any subsequent disbursement of public funds to your state.”Join the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nAs a media platform, we hold leadership accountable and will not trade the right to press freedom and free speech for a piece of cake.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/nlc-gives-reasons-for-imminent-strike-likens-subsidy-palliatives-to-tokenism/",
        "summary": "The Nigeria Labour Congress (NLC), has once again, criticised the Federal Government’s palliatives following the removal of fuel subsidy.\nWhile the federal government had abolished the commodity’s subsidy several months prior, it nevertheless provided food aid to the state governments for distribution to Nigerians.\nBut hours after launching a two-day statewide strike owing to the implications of fuel subsidy reduction, the NLC President Joe Ajaero, on Friday, said the distribution of food palliatives is inadequate to fight the ramifications of the government’s move.\n“If you share the N5bn, many people, probably within the working class or the poor of the poor, may not get N1,500.\nNow, is that the palliative?”Read Also: NLC declares two-day strike over fuel subsidy removalThe labour chief described the palliatives as “mere tokenism”, maintaining they cannot cushion the impacts of the subsidy removal policy."
    },
    {
        "url": "https://www.ripplesnigeria.com/oyo-apc-accuses-gov-makinde-of-diverting-lg-palliative-funds/",
        "summary": "In an effort to lessen the suffering of the nation’s poor from hunger and economic hardship, Tinubu had promised that his administration would develop palliative measures.\n“It is evident that the orchestrated Palliative Committee set up by Gov.\nMakinde about four weeks ago was just to fool the public as the committee would not have anything to do in the long run.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/ripplesmetrics-what-lawmakers-n110-2bn-palliatives-can-do-for-nigerians/",
        "summary": "Also, the International Trade Administration said that less than five per cent of the Nigerian population is enrolled in the Nigeria Health Insurance Scheme.\nThat is an estimate of 120 million Nigerians lacking health insurance coverage.\nAssuming the allocation is redirected to health, 2.8 million Nigerians would be able to seek healthcare from specialists.\nMeanwhile, the United Nations said that 133 million Nigerians do not have access to potable water.\nSimilarly, with 92 million Nigerians lacking access to electricity, the allocation can provide over 169,566 Meksan Power Transformers 50KVA in several communities."
    },
    {
        "url": "https://www.ripplesnigeria.com/katsina-confirms-receipt-of-n2bn-palliative-from-nigerian-govt/",
        "summary": "The Katsina State government on Wednesday confirmed receipt of N2 billion out of the N5 billion palliative approved to the states by the Federal Government.\nThe state’s Commissioner for Information, Culture and Home Affairs, Dr. Bala Salisu-Zango, made the clarification in a statement in Katsina.\nHe was reacting to insinuation that the federal government had released N5 billion to the state.\nHe warned that the state government would punish anyone found wanting in the palliative distribution exercise.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/benue-pdp-decries-gov-alias-silence-on-palliatives-to-state/",
        "summary": "The Peoples Democratic Party (PDP) in Benue State on Tuesday decried the silence of Governor Hyacinth Alia on the distribution of palliatives released by the Federal Government to cushion the effects of the fuel subsidy removal on Nigerians.\nIn a statement issued in Makurdi, the PDP Publicity Secretary in the state, Bemgba Iortyom, commended the president over the release of palliatives to states following the removal of fuel subsidy.\nHe said the palliatives would provide short-term succour to citizens if handled sincerely and transparently by the states.\nREAD ALSO: Fuel subsidy: Nigerian govt to monitor distribution of palliatives in statesIortyom said: “The palliatives will go a long way in reducing the sufferings occasioned by the subsidy removal.\nThe spokesman also charged Alia to ensure the transparent distribution of the palliatives in the state."
    },
    {
        "url": "https://www.ripplesnigeria.com/oyo-govt-approves-car-loan-for-teachers-as-palliative-against-fuel-subsidy-removal/",
        "summary": "The Oyo State Government has approved the immediate release of car loans for primary school teachers, across all zones in the state.\nThis was made known on Friday in Ibadan by the coordinating Director, Oyo State Universal Basic Education Board, Mr. Jacob Dairo, who stated that the loan was a palliative to teachers in the state.\nHe said the loan which is to be distributed in many tranches is to cushion the effect of the removal of fuel subsidy, on Oyo State primary school teachers.\nREAD ALSO:Fuel subsidy: Nigerian govt to monitor distribution of palliatives in statesAccording to him, the scheme was approved by the Oyo State governor, Seyi Makinde, who had instructed that the loan be provided to all teachers, without any favoritism.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-nigerian-govt-to-monitor-distribution-of-palliatives-in-states/",
        "summary": "The presidency said on Friday the Federal Government would monitor the distribution of palliatives designed to cushion the effects of fuel subsidy on Nigerians at the state level.\nThe president had also approved the release of trucks of fertilizer and grains to states to cushion the effects of the petrol subsidy removal announced in his May 29 inaugural address.\nREAD ALSO: Fuel subsidy: Nigerian govt announces N5bn palliative for each stateThe Special Adviser on Media and Publicity to the President, Ajuri Ngelale, stated this in a Channels Television’s programme, Politics Today.\n“It also explains why we have put in place the palliatives distribution.”Join the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/osun-apc-governor-adeleke-in-war-of-words-over-distribution-of-palliatives/",
        "summary": "“Is Governor Adeleke waiting for the people of the state to die of hunger before he deems it fit to make the palliatives available to serve its purpose at the right time?\n“Federal government approved a total of three thousand bags of rice palliatives to Osun state.\nOut of the five trailers of bags of rice palliative to the state, we are waiting for the completion of the palliative supply before the announcement and distribution.\nThe rice palliatives will be distributed as soon as the last tranche comes into the state by today or tomorrow.\n“We assure the good people of Osun that the government of Ademola Adeleke will not deny them of the rice palliatives, and we urge all to disregard the propaganda of the APC."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-nigerian-govt-announces-n5bn-palliative-for-each-state/",
        "summary": "The Federal Government on Thursday announced a N5 billion palliative for each state in the country and the Federal Capital Territory (FCT) to cushion the effects of the fuel subsidy removal.\nThe Borno State Governor, Babagana Zulum, disclosed this to State House correspondents at the end of the National Economic Council (FEC) meeting presided over by Vice President Kashim Shettima in Abuja.\nThe Federal Government had in June promised to come up with measures to cushion the effects of the fuel subsidy removal announced by President Bola Tinubu in his May 29 inaugural address.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-palliatives-take-centre-stage-as-shettima-presides-over-nec-meeting/",
        "summary": "The Federal Government’s palliatives to cushion the effect of the removal of fuel subsidy is expected to dominate discussions as the Vice President, Kashim Shettima is presiding over the National Economic Council (NEC) at Council Chambers of the Presidential Villa, Abuja.\nThe meeting, which is currently underway, is expected to consider varying issues, including the Federation’s financial status and other general issues.\nHowever, the most critical of the issues before the Council is the deployment of palliatives aimed at cushioning the harsh effects of the fuel subsidy removal.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-akwa-ibom-receives-3000-bags-of-rice-from-fg-inaugurates-palliatives-committee/",
        "summary": "Akwa Ibom State Governor, Pastor Umo Eno, on Wednesday, disclosed that the state has taken delivery of 3000 bags of rice from the Federal Government as part of palliatives to cushion the effect of the removal of fuel subsidy.\nEno disclosed this while inaugurating an 18–man committee to handle the distribution of palliatives to cushion the effects of fuel subsidy removal on the people in the state.\nSpeaking while inaugurating the Committee in Uyo, on Wednesday, Governor Eno charged members of the committee to ensure even and equitable distribution of the materials to all and sundry, especially the vulnerable in the society.\nHe said: “We will continue to ensure that we energize our workforce because that is the engine room of government.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-makinde-sets-up-palliative-committee-in-oyo/",
        "summary": "The Oyo State Governor, Seyi Makinde, has set up a palliative committee to cushion the effects of fuel subsidy removal in the state.\nThe 15-man committee is headed by the Chief of Staff to the governor, Mr. Segun Ogunwuyi, while the State Commissioner for Budget and Economic Planning, Prof. Musibau Babatunde, will serve as its Secretary.\nMr. Ademola Babalola will represent the Nigeria Union of Journalists (NUJ) while Mr. Jide Bamgbose will come from Civil Society Organisations (CSOs).\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/thanks-but-no-thanks-muric-tells-tinubu-says-muslims-will-not-take-govt-offer-of-loans-with-interests-as-palliatives/",
        "summary": "Islamic advocacy group, Muslim Rights Concern (MURIC), has called on the Federal Government to make available non-interest soft loans to Muslims in the country.\nRead also: MURIC accuses Tinubu of sidelining Muslims in appointments“We appreciate the concern of President Bola Ahmed Tinubu for Nigerians particularly in these difficult times.\nThe offer of loans to cushion the effect of the withdrawal of oil subsidy shows that the president cares about the citizenry,” he said.\n“However, Nigerian Muslims cannot and will not take interest loans as the latter is capable of constituting a wedge between Nigerian Muslims and their Creator (Almighty Allah).\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-nigerian-govt-labour-resume-meeting-on-palliatives-nlc-president-absent/",
        "summary": "The meeting between the Federal Government and organized labour resumed on Tuesday with the President of the Nigeria Labour Congress (NLC), Joe Ajaero, conspicuously absent.\nThe two parties on Monday agreed to adjourn the meeting convened to deliberate on the palliative measures for Nigerians.\nREAD ALSO: Labour to go ahead with planned fuel subsidy protestThe meeting is also expected to deliberate on the planned nationwide protest organized by the NLC to press home its demands for the reversal of the fuel subsidy removal by the government.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/nigerian-govt-labour-meet-on-fuel-subsidy-palliatives/",
        "summary": "The Federal Government team met with the organized labour at the State House, Abuja, on Monday.\nThe meeting was a last-minute effort by the federal government to stave off the planned nationwide strike by the Nigeria Labour Congress (NLC).\nThe Congress had already given the federal government a seven-day ultimatum to reverse the decision on fuel subsidy removal or face a nationwide strike from Wednesday.\nThe NLC President, Joe Ajaero, his TUC counterpart, Festus Osifo, NLC General Secretary, Emma Ugbaja, and the former chairman of the Nigerian Electricity Regulatory Commission (NERC), Sam Amadi, were on the side of the labour.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/adamawa-civil-servants-to-receive-n10000-subsidy-palliatives/",
        "summary": "Adamawa Governor Ahmadu Fintiri has approved a palliative of N10,000 per month for civil personnel and retirees for a period of six months to lessen the painful impacts of the elimination of the petrol subsidy.\nDr. Edgar Amos, the chief of staff for the governor, revealed this during a Wednesday Q&A with journalists in Yola.\nHe further said the government would purchase 50 trucks of fertiliser for state civil servants at subsidised rate.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/pensioners-appeal-to-nigerian-govt-to-include-them-in-distribution-of-subsidy-palliatives/",
        "summary": "The Nigeria Union of Pensioners (NUP), on Monday, appealed to the Federal Government to include its members in the distribution of the proposed palliatives to cushion the effects of removal of fuel subsidy.\nThe NUP President, Comrade Godwin Abumisi, who was accompanied by members of the National Executive Council of the union, made the appeal on Monday while briefing journalists in Abuja.\nAccording to Abumisi, the removal of fuel subsidy has further impoverished and pauperized the vulnerable Nigeria pensioners like other vulnerable group of persons who are struggling and battling for survival.\n“There is no gainsaying that the removal of the fuel subsidy has further impoverished and pauperized the vulnerable Nigeria pensioners like other vulnerable group of persons in our society who are always struggling and battling for survival.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-removal-ogun-govt-approves-n10000-cash-palliatives-for-civil-servants-pensioners/",
        "summary": "Governor Dapo Abiodun of Ogun State, on Monday, approved palliatives for the state’s employees and retirees to lessen the consequences of the termination of the fuel subsidy.\nThe regulations will go into effect starting in July, according to a statement by the state government’s secretary, Tokunbo Talabi.\n“He also approved payment of March and April, 2023 leave bonuses for public servants in the state and the immediate cash-backing for the quarterly payment of gratuities to pensioners.\n“Commencement of conversion of State Mass Transit buses to CNG including staff buses and current public transportation buses in circulation to reduce cost of transportation by charging rates comparable to what obtained before deregulation.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/nationwide-strike-looms-as-tuc-gives-nigerian-govt-two-weeks-to-agree-on-post-subsidy-palliatives/",
        "summary": "The Federal Government has been warned to hasten negotiations with the Trade Union Congress (TUC) or face workers’ protests over the hardship in the country.\nAccording to TUC President, Festus Osifor, the government has been dragging its feet with the demands of the workers’ union since negotiation started on June 19.\nRecall that the workers’ union and FG have been in discussions over palliatives to cushion the ripple effect of the removal of subsidy on fuel.\n“As at today we have formed technical committees on cash transfers, on intervention fund, on reduction of cost of governance, on energy and power (developing CNG as alternative to PMS) and fixing of refineries.\n“We also have technical committees on education and health and Mass Transit.”Join the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs."
    },
    {
        "url": "https://www.ripplesnigeria.com/tinubu-orders-review-of-n8000-palliative-to-nigerians/",
        "summary": "President Bola Tinubu on Tuesday ordered the immediate review of the N8000 proposed as a palliative to cushion the effects of subsidy removal on Nigerians.\nThe Federal Government had concluded plans to transfer N8000 for six months to 12 million homes in the country to ameliorate the suffering caused by the fuel subsidy removal.\nPresident Tinubu, according to Alake, vowed to always put Nigerians at the heart of his policy and programme.\nThe statement read: “That the N8,000 conditional cash transfer programme envisaged to bring succour to most vulnerable households be reviewed immediately.\n“That the whole gamut of the palliative package of government be unveiled to Nigerians."
    },
    {
        "url": "https://www.ripplesnigeria.com/actor-lp-member-kenneth-okonkwo-slams-n8000-palliative-plan-calls-it-insult-to-common-sense/",
        "summary": "Kenneth Okonkwo, a renowned actor and frontline member of the Labour Party, LP, has criticised plans by the Federal Government to pay poor Nigerian households N8,000 monthly.\nHe made this call on Monday, through his Twitter page, calling the mandate “an insult to common sense and means to steal government fund in the name of poor Nigerians”.\nRead Also: Actor Kenneth Okonkwo defects to Labour Party after leaving APCThe veteran Nollywood actor claimed that the amount would not be sufficient for poor Nigerians who could barely afford a plate of food.\nWhat can a Nigerian do with N8,000 per month, much less a household of about 6 persons per month.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/tinubus-8000-monthly-palliative-plan-is-a-scam-eedris-abdulkareem/",
        "summary": "Former Remedies band member, Eedris Abdulkareem has taken to social media to react to President Bola Tinubu’s proposed plan to distribute N8,000 to 12 million homes for a period of six months.\nThe ‘Jaga Jaga’ crooner who reacted to the palliative plan by Tinubu in a post on his Instagram page said that the move by the government of the day was nothing but a scam.\nNigerians don’t need HANDOUTS, they need productivity that will lead to PROSPERITY.’’ Eedris Abdulkareem wrote on his Instagram page.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/a-sinister-attempt-to-divert-public-funds-atikus-aide-slams-tinubu-n8000-monthly-palliative-plan/",
        "summary": "So, with Tinubu’s uninspiring plan, each individual in a household will get N1,600 per month or N53 per day.\nThis must be a joke or a more sinister attempt to divert public funds.”Earlier, President Bola Tinubu disclosed a plan by the Federal Government to transfer N8,000 to 12 million poor households in Nigeria for a period of six months.\nAccording to the President, the money transfer to poor households would have a multiplier effect on about 60 million individuals.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/reps-approve-tinubus-n500bn-request-for-subsidy-palliatives-12m-families-to-get-n8k-each/",
        "summary": "In the meantime, President Tinubu said that 12 million families will get N8,000 over the course of six months to lessen the sufferings brought on by the loss of subsidies.\nThe purpose of the letter was to request authorization for increased funding for the National Assembly-scaled national social safety net initiative.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/how-far-can-this-cushion-hardship-organised-labour-slams-tinubus-n500bn-palliative-plan/",
        "summary": "In an interview with newsmen in Abuja on Wednesday, the National Treasurer of the NLC, Hakeem Ambali, questioned the scope of the palliative’s coverage.\nIt read, “I write to the House of Reps to approve the amendment of the 2022 Supplementary Appropriation Act in accordance with the attached.\n“The request has become necessarily important to, among other things, the source for funds necessary to provide palliatives to mitigate the effect of the removal of fuel subsidy on Nigerians.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/tinubu-promises-to-roll-out-palliatives-stable-power-at-meeting-with-class-of-1999-governors/",
        "summary": "President Bola Tinubu on Wednesday promised to come up with palliatives to cushion the effects of the fuel subsidy removal on Nigerians.\nThe president had earlier on Wednesday requested the National Assembly’s approval of N500 billion for palliatives to cushion the effects of the subsidy removal in the country.\nThey expressed their support for the president over some of the policies he initiated since assuming office on May 29.\nNigeria is reborn already with fuel subsidy removal.\nREAD ALSO: Fuel subsidy: Tinubu requests National Assembly’s approval for N500bn palliatives“Please tell the people to be a little patient."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-tinubu-requests-national-assemblys-approval-for-n500bn-palliatives/",
        "summary": "President Bola Tinubu has requested the National Assembly’s approval of N500 billion for palliatives to cushion the effects of fuel subsidy removal on Nigerians.\nThe president requested the parliament’s approval in a letter addressed to the House of Representatives and read by the Speaker, Tajudeen Abbas, at plenary on Wednesday.\nThe letter read: “I write to the House of Representatives to approve the amendment of the 2022 Supplementary Appropriation Act.\n“The request has become necessarily important to among other things source for funds necessary to provide palliative to mitigate the effect of the removal of fuel subsidy on Nigerians.\nThe president had last month promised to put measures in place to cushion the effects of the fuel subsidy removal on Nigerians."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-apc-governors-meet-tinubu-in-lagos-to-complement-nigerian-govt-on-palliatives/",
        "summary": "Governors elected on the platform of the All Progressives Congress (APC) on Friday declared their readiness to complement the Federal Government’s initiatives aimed at providing relief to Nigerians following the removal of fuel subsidy.\nThe Kogi State Governor, Yahaya Bello, stated this in a chat with journalists at the end of a meeting with President Bola Tinubu in Lagos.\nHe said the successful implementation of the measures initiated by the federal government to cushion the effect of the fuel subsidy removal must be matched by all tiers of government.\nAlia said: “The people of Benue, and indeed all Nigerians, can rest assured that a new dawn is coming to Benue.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-nigerian-govt-labour-set-up-committees-to-work-out-palliatives/",
        "summary": "The Federal Government and organized Labour on Monday set up committees to work out measures aimed at cushioning the effects of the fuel subsidy removal on Nigerians.\nHe said the steering and technical committees were set up to help achieve the planned interventions for Nigerians.\n“Work groups were constituted at today’s meeting.\nThere is a steering committee that will serve as a clearing house and there are other committees comprising both parties, government and labour.\nThe duo assured Nigerians that the committees would commence work immediately and complete their assignments within eight weeks."
    },
    {
        "url": "https://www.ripplesnigeria.com/nigerian-govt-labour-resumes-talks-on-subsidy-removal-palliatives-in-abuja/",
        "summary": "The Federal Government on Monday resumed talks with the organised on measures to cushion the effects of the removal of the fuel subsidy on Nigerians.\nThe Nigeria Labour Congress (NLC) had on June 2 threatened to mobilize Nigerians for a nationwide strike following the rise in fuel pump prices occasioned by the removal of fuel subsidy by the government.\nThe Congress, however, suspended the planned strike after a meeting with the federal government’s representatives in Abuja on June 5.\nThe parties had about two weeks ago resolved to meet again today to work out measures that would cushion the effects of the subsidy removal on the citizens.\nThe NLC President, Joe Ajaero and his TUC counterpart, Festus Osifo, led other labour leaders to the meeting."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-removal-be-patient-for-govt-to-work-out-palliatives-gov-mohammed-tells-nigerians/",
        "summary": "Bauchi State Governor, Bala Mohammed, has appealed to Nigerians to be patient as the government works on rolling out palliatives to cushion the hardships brought about by the removal of fuel subsidy.\nHe also said that the committee will also recommend adjustments in workers’ salaries and the introduction of various intervention programmes using the revenue generated from the subsidy removal.\nTwo other stories, and a quote to rememberHe said: “The committee will work for the collective interest of Nigerians.\nAccording to him, Mohammed the NEC and representatives of Organised Labour also acknowledged that the subsidy removal has advantages and challenges.\nHe, therefore, appealed to Nigerians to be patient, saying life will be meaningful when the federal government implements the NEC recommendations."
    },
    {
        "url": "https://www.ripplesnigeria.com/obi-faults-petrol-subsidy-removal-without-palliative-measures/",
        "summary": "The Labour Party presidential candidate, Peter Obi, has expressed concern at the Federal Government’s decision to remove the fuel subsidy without palliatives for Nigerians.\nObi, who addressed journalists on the sidelines of the ongoing hearing of petitions challenging the February 25 presidential election at the presidential election petition tribunal in Abuja, advocated the removal of fuel subsidy without throwing the people into untold hardship.\nHe stressed that no allocation was made for the payment of fuel subsidy in the 2023 budget beyond July.\nI remember when ex-President Goodluck Jonathan was about to remove fuel subsidy that was when they came up with SURE-P as part of the conditions.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-removal-nigerian-govt-gets-800m-world-bank-grant-for-palliatives/",
        "summary": "A $800 million World Bank grant has been announced by the federal government as a part of its palliatives efforts ahead of removal of subsidy on petrol.\nThe minister stated that the palliatives would be given to 10 million homes, or 50 million vulnerable Nigerians to cushion the effect of the subsidy removal.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/2023-atikus-spokesman-bwala-accuses-apc-of-hiding-tinubu-like-palliative/",
        "summary": "The continued failure of the All Progressives Congress (APC) presidential candidate, Bola Ahmed Tinubu, to honour invitations to presidential debates ahead of 2023 elections, has continued to dominate issues in the polity.\nDaniel Bwala, spokesman to the Peoples Democratic Party (PDP) presidential candidate, Atiku Abubakar, on Friday accused the APC Presidential Campaign Council of keeping the former Lagos away from debates like palliative.\nTinubu has come under severe criticism as a result of his inability to attend presidential debates like his counterparts in the opposition have done.\nRead also:Bwala, Atiku’s spokesman, accuses APC campaign council of attacking democrary, free pressThis development had engendered a crisis between APC Campaign Directorates and the media group, with the former accusing the latter of partnering with Peoples Democratic Party (PDP) to smear Tinubu’s image.\nSpeaking on the development in a tweet on Friday, Bwala challenged APC Campaign Council to present its presidential candidate for public scrutiny."
    },
    {
        "url": "https://www.ripplesnigeria.com/senate-to-probe-niger-delta-governors-role-in-nddcs-n6-2bn-palliative-scam/",
        "summary": "The Senate Committee on Ethics, Privileges and Public Petitions, on Tuesday, said it would extend the probe of its N6.2 billion COVID-19 palliative fund to the governors of the nine states under the Niger Delta region, who were said to have collected N100 million each from the Niger Delta Development Commission (NDDC).\nThe Chairman of the panel, Senator Ayo Akinyelure, while briefing journalists on the development said the Akwa led administration had up till Thursday to produce Pondei and his team or risk being arrested.\nThey claimed that N100 million each were given to the governors of the nine states in the Niger Delta region.\n“We will now call the governors to come and account for it because none of the 27 senators from the Niger Delta region is aware of the COVID-19 palliative shared to the governors by the NDDC.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/ipman-protests-as-nnpc-cancels-pre-subsidy-removal-agreement-with-marketers/",
        "summary": "The Independent Petroleum Marketers Association of Nigeria (IPMAN) has revealed that the Nigerian National Petroleum Company (NNPC) Limited has cancelled their pre-subsidy removal agreement.\nAccording to the IPMAN Chairman, Suleja Branch, Yahaya Alhassan, the marketers had outstanding tickets or Premium Motor Spirit (PMS), also known as fuel, which the NNPC didn’t deliver before the subsidy removal.\n“For the outstanding tickets, up till now they have not attended to us.\nAlhassan stated that the bridging claim is money paid to the oil marketers to ensure the price of fuel is similar across all filling stations.\nAny money that any marketers pays, the transport money is there, which we are contributing,” Alhassan explained."
    },
    {
        "url": "https://www.ripplesnigeria.com/politicians-have-ganged-up-against-workers-masses-nlc-rails-against-subsidy-removal/",
        "summary": "The aftermath of the removal of fuel subsidy continues to reverberate across the country as the Nigeria Labour Congress, for the umpteenth time, accused politicians of unleashing misery on Nigerians.\nHe was represented by the Deputy President of Congress and President-General of Maritime Workers Union of Nigeria, MWUN, Prince Adewale Adeyanju, in the programme supported by the American Solidarity Centre.\nPoliticians have ganged up against the workers and the masses without any consequences.\nThe current 2023 budget has provision for the fuel subsidy till June.\nIn November 2021, the federal government announced its plan to remove the fuel subsidy and replace it with a monthly N5,000 transport grant for poor Nigerians."
    },
    {
        "url": "https://www.ripplesnigeria.com/new-stanbic-report-says-employment-went-up-new-businesses-emerged-after-fuel-subsidy-removal/",
        "summary": "The impact of fuel subsidy removal on the cost of operations didn’t stop the increase in employment and new businesses in Nigeria, a new report has shown.\nAccording to the Stanbic IBTC Purchasing Managers’ IndexTM (PMI) report for the month of June, prices skyrocketed in response to the end of subsidies on fuel.\nThe report disclosed that companies mitigated the inflation driven by the removal of subsidies by passing the extra cost of the operation to customers.\nThe PMI further stated that the increased prices didn’t stop orders from rising, although marginally, leading to companies increasing employment modestly as well.\nRating the business environment last month, the PMI said it scored the private sector 53.2, compared to 54.0 in May."
    },
    {
        "url": "https://www.ripplesnigeria.com/serap-asks-tinubu-to-make-public-spending-from-n400bn-subsidy-savings/",
        "summary": "The Socio-Economic Rights and Accountability Project (SERAP) on Sunday challenged President Bola Ahmed Tinubu to publish how the N400 billion saved by the Federal Government following the removal of fuel subsidy was spent.\n“Prevention of corruption in the spending of savings from the removal of subsidy on petrol and preventing and addressing the challenges caused by the removal are serious and legitimate public interests.”Nigerians, according to SERAP, deserved to know how the savings were spent.\nREAD ALSO:SERAP drags Tinubu to court over missing subsidy paymentsIt charged the president to promote transparency, accountability, and reduce the risks of corruption in the spending of the funds by publishing the details on the spending of the savings.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/we-need-to-stop-bleeding-of-our-finances-tinubu-opens-up-on-fuel-subsidy-exchange-rates/",
        "summary": "That’s not why you voted for me.”Tinubu stressed that the decision to unify the exchange rates alongside the fuel subsidy removal was to stop the bleeding of the country’s finances.\nThe president insisted that it was important to end fuel subsidies and unify the multiple foreign exchange rates in the early days of his government.\nREAD ALSO:Why Buhari delayed fuel subsidy removal, forex unification – Garba Shehu“We need to take the steps to stop the bleeding of our finances through speedy action on fuel subsidy.\nTinubu had in his inaugural address on May 29 ended the fuel subsidy regime after several failed attempts by successive governments in the country.\nHe also approved the unification of the naira-to-dollar exchange rates in a bid to stabilize the Nigerian currency."
    },
    {
        "url": "https://www.ripplesnigeria.com/sani-advises-tinubu-against-giving-funds-saved-from-subsidy-removal-to-govs/",
        "summary": "Sani, who said this on Thursday while fielding questions from Journalists at his residence in Kaduna, explained that there was a need to put the subsidy funds on the table to tell Nigerians what is being done with it.\nSani further stated that the present service Chiefs have no excuse but to protect citizens and the territorial integrity of Nigeria.\n“Our country must be salvaged and put on track for sustainable development and peaceful coexistence of our people,” he added.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/apc-chieftain-urges-nigerian-govt-to-invest-fuel-subsidy-funds-in-electric-vehicle/",
        "summary": "A chieftain of the All Progressives Congress (APC), Mustapha Audu, said on Wednesday that President Bola Tinubu’s decision to remove fuel would boost the growth in the electric vehicle market.\nREAD ALSO:Isa Yuguda accuses NNPC of running fuel subsidy scamWith such investments, the APC chieftain predicted that the Nigerian electric vehicle companies would dominate Africa and take over a large market share on the continent.\nAs a media platform, we hold leadership accountable and will not trade the right to press freedom and free speech for a piece of cake.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/why-buhari-delayed-fuel-subsidy-removal-forex-unification-garba-shehu/",
        "summary": "A Senior Special Assistant on Media and Publicity to former President Muhammadu Buhari on Monday explained why his principal refused to remove the fuel subsidy in the months leading to the last general election.\nPresident Bola Tinubu has been commended by many Nigerians for taking the bold decision to remove the highly controversial fuel subsidy after years of failed attempts by successive governments.\n“In terms of the timings of the decisions to remove fuel subsidy and unify the currency, the Tinubu/Shettima administration has done overwhelmingly well.\nThat’s why it’s important to remind ourselves – and all those who have conveniently forgotten – that the Buhari administration had been on this pathway from the very beginning in 2015.\nThe Buhari administration in its last days could not have gone the whole way because the APC had an election to win."
    },
    {
        "url": "https://www.ripplesnigeria.com/isa-yuguda-accuses-nnpc-of-running-fuel-subsidy-scam/",
        "summary": "The Nigerian National Petroleum Company (NNPC) has been accused by a former governor of Bauchi State, Isa Yuguda, of operating a fuel subsidy scam alongside the oil marketers.\nYuguda said NNPC and the stakeholders in the oil industry were receiving subsidies for pipelines that don’t exit.\nHe disclosed this on Monday, during an interview with Channels TV, while discussing the fuel subsidy removal by President Bola Tinubu.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/former-aviation-minister-chidoka-suggests-ways-to-cushion-effects-of-subsidy-removal/",
        "summary": "Chidoka, a PDP leader and supporter of former vice president Atiku Abubakar, spoke on Channels Television’s Sunday Politics.\nWhen he (Tinubu) took a decision to remove subsidy and he removed fuel subsidy and the fuel prices rose by 100 and something naira to 500 and something naira in a day.\nThe four major companies importing fuel to Nigeria have a debt of over $3bn and they haven’t been given enough crude to pay for those debt.\nSo, he (Tinubu) has to pay the backlog of those debts,” Chidoka stated.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/my-friend-benefitting-from-subsidy-scam-said-they-were-tired-of-making-money-ex-gov-yuguda/",
        "summary": "He explained that the perpetrators of the subsidy scam had made so much money from Nigeria, and had brought the nation to its knees financially.\nHe narrated an incident when a friend of his had highlighted the kind of money made from the scam.\nHe called the then president aside and said, ‘Mr President please stop this subsidy, we are tired of making money’”.\nHe also said the former President Muhammadu Buhari must have known of the subsidy scam since he was the president and minister of petroleum.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/dogara-demands-prosecution-of-fuel-subsidy-cabals/",
        "summary": "A former Speaker of the House of Representatives, Yakubu Dogara, on Sunday, urged President Bola Tinubu to go after the oil subsidy cabals and bring them to book.\nYunusa Nmadu, charged the president to recover looted funds from the subsidy cabals.\n“We stand by him on the subsidy removal.\nBut he must be courageous to pursue the subsidy cabals and recover all the stolen monies from them and prosecute them accordingly,” the ex-speaker said.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/how-fuel-subsidy-removal-will-impact-real-estate-sector/",
        "summary": "However, the effects of fuel subsidies extend beyond the energy sector, with potential repercussions on various industries, including real estate.\nThis article explores the impact of fuel subsidy on the real estate market in Nigeria, analyzing both positive and negative implications.\nREAD ALSO:Reasons behind booming demand for flats and apartments in Nigeria’s real estate sector5) POTENTIAL FOR INFRASTRUCTURE DEVELOPMENTOne potential positive impact of fuel subsidy reforms on the real estate sector is the redirection of funds towards infrastructure development.\n8) IMPACT ON COMMERCIAL REAL ESTATEFuel subsidy reforms can have varying impacts on different segments of the real estate market.\nThis can stimulate economic growth, create job opportunities, and contribute to the expansion of the real estate sector in Nigeria."
    },
    {
        "url": "https://www.ripplesnigeria.com/soludo-urges-nigerian-govt-to-invest-fuel-subsidy-savings-into-infrastructure-social-development/",
        "summary": "The Governor of Anambra State, Prof. Charles Soludo, has urged the Federal Government to invest a huge percentage of funds saved from fuel subsidy withdrawal to infrastructure and social development.\nSoludo said this while speaking at the Nigerian Academy of Engineering Annual Lecture with the theme: “Financing Engineering Infrastructure,” on Thursday at the University of Lagos, Akoka, Lagos.\nHe said: “For the federal government to succeed in infrastructure provision, it is necessary to collaborate with state governments who understand the most priority of their needs.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-removal-forex-reforms-will-affect-corruption-in-nigeria-moghalu-defends-tinubu/",
        "summary": "The former Deputy Governor of the Central Bank of Nigeria (CBN), Kingsley Moghalu, has said the foreign exchange (Forex) reforms and fuel subsidy removal by President Bola Tinubu are a significant blow to corruption in both sectors.\nRipples Nigeria reports that the oil sector was completely deregulated by President Tinubu the first week he took over the office by removing subsidy on fuel.\n“I think it’s important for us to understand, these are very difficult necessary decisions that should have been taken years ago, starting with the petrol subsidy, to the forex subsidy.\n“So, the human phase of the reforms needs to be addressed and addressed quickly.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/organised-labour-laments-refusal-of-nigerian-leaders-to-make-sacrifices-in-wake-of-subsidy-removal/",
        "summary": "What is the contribution of the political class to this economic logjam that we are in today as a country?\nThe Organised Labour had on June 5 suspended its planned nationwide strike over the removal of subsidy following the agreement reached with the Federal government.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-nigerian-govt-reveals-six-companies-certified-to-import-fuel-clarifies-situation-with-dangote-refinery/",
        "summary": "The Federal Government, on Monday, disclosed that six new companies have been given permission to import petroleum products into Nigeria as of Monday.\nSeveral enterprises requested for a permit to import petroleum in due time, according to Farouk, in addition to the six that were accepted.\nRead Also: NNPCL says it’ll end fuel importation when Dangote Refinery kicks offAdditionally, Ahmed refuted claims that the Nigerian National Petroleum Corporation Limited (NNPCL) had authorised the Dangote Group to import petroleum, claiming that the company lacked the authority to do so.\nAhmed said, “There are six companies who said they want to import fuel in July.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/court-restates-ruling-stopping-organised-labours-strike-over-fuel-subsidy-removal/",
        "summary": "The dispute was postponed until July 20 for a hearing and the court also ordered that the parties preserve the status quo.\nHe added that he was ready to proceed with his application as the defendants had been served.\nMr Marshall Abubakar, the defendants’ counsel on his part however replied that they had filed an application praying the court to set aside its order granted on June 5, restraining his clients from embarking on strike.\nThe claimant filed the counter-affidavit on June 16 and gave the bailiff instructions not to serve them until Monday in court, he said.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-nigerian-govt-to-consider-recommendation-on-n702bn-allowance-for-workers/",
        "summary": "The National Economic Council (NEC) on Thursday set up a committee to look at the National Salaries, Incomes and Wages Commission (NSIWC) recommendations on palliatives for workers following the removal of the fuel subsidy.\nThe committee which has members from each of the six geo-political zones is headed by the Kebbi State Governor, Nasiru Idris.\nPresident Bola Tinubu had shortly after the announcement on the removal of fuel subsidy directed NEC to work on measures that would reduce the burden of the policy on vulnerable Nigerians.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/nba-group-demands-measures-to-cushion-effect-of-fuel-subsidy-removal/",
        "summary": "The Nigerian Bar Association, Section on Public Interest and Development Law, NBA-SPIDEL, on Monday, called on President Bola Tinubu to immediately come up with measures to cushion the effect of the removal of fuel subsidy.\nUbani who faulted the process of removing subsidy on fuel by the president, said that Nigerians were groaning in pain and hardship.\nRead also: SERAP drags Tinubu to court over missing subsidy payments”The president must be told in clear terms that Nigerians are groaning in pain, especially with the sudden removal of the fuel subsidy.\n“More drastic and well-thought-out economic packages should be put in place to cushion the harsh effects of the new policy.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/bring-back-free-school-shuttle-buses-to-ease-effect-of-subsidy-removal-sdp-tells-akeredolu/",
        "summary": "The Ondo State chapter of the Social Democratic Party {SDP} has called on the state government to reintroduce the free shuttle buses for secondary school students in order to cushion the effect of hike in the price of petrol.\n“No explanation was provided until June 2022 when Special Adviser on Transport to Governor Akeredolu declared that the free school shuttle bus programme had been discontinued because of the COVID-19 pandemic in 2020.\nRead also: Again, SDP tackles Gov Akeredolu over illness, urges him to Handover to deputy to avert constitutional crisis“While they were in service, the free shuttle buses decreased the amount parents spent on their children’s transportation.\n“Indeed, free shuttle buses will limit the time they spend alone and exposed to dangerous students’ influence.\n“Therefore, the scheme is necessary as a social intervention programme designed to free parents and guardians from their daily struggle of meeting their responsibilities to their children."
    },
    {
        "url": "https://www.ripplesnigeria.com/serap-drags-tinubu-to-court-over-missing-subsidy-payments/",
        "summary": "The Socio-Economic Rights and Accountability Project (SERAP) has filed a lawsuit against President Bola Tinubu for his failure to investigate allegation that about USD$2.1 billion and N3.1 trillion of oil revenues budgeted as fuel subsidy payments went missing and unaccounted for between 2016 and 2019.\nThe suit followed allegations documented by the Auditor-General of the Federation in the 2016 and 2019 annual reports that the public funds are missing.\nThis was made known by Kolawole Oluwadare, SERAP Deputy Director in a statement made public on Sunday.\n“Poor and socio-economically vulnerable Nigerians should not be made to continue to pay the price for the stealing of the country’s oil wealth while state and non-state actors pocket public funds.\n“Investigating and prosecuting the allegations, and recovering any missing public funds would serve the public interest, ensure justice and accountability, and end the entrenched impunity of perpetrators”."
    },
    {
        "url": "https://www.ripplesnigeria.com/nlc-tuc-ask-court-to-vacate-order-on-fuel-subsidy-strike/",
        "summary": "The Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC) on Friday asked the National Industrial Court to vacate the order restraining them from embarking on a nationwide strike over the removal of fuel subsidy.\nThe NLC had on June 2 asked the federal government to revert to the old petrol pump price or risk a nationwide strike.\nThe government quickly fought back and approached the court to restrain the unions from calling out workers for industrial action.\nREAD ALSO: NLC suspends planned fuel subsidy strikeThey stressed that the ex parte motion was filed in violation of Section 17 (2) of the Trade Disputes Act.\n“The claimants/applicants’ suit offends the lucid provisions of Order 3 rules 1 and 6 of the national industrial court civil procedure rules, 2017."
    },
    {
        "url": "https://www.ripplesnigeria.com/state-finance-commissioners-asks-fg-to-send-accruals-from-subsidy-removal-to-federation-account/",
        "summary": "The Forum of Commissioners for Finance of Nigeria, on Friday, called on the Federal Government to channel accruals from the removal of fuel subsidy into the Federation Account.\nThe form made the call throught its outgoing Chairman, Mr David Olofu, the immediate past Commissioner of Finance in Benue State at a valedictory session for outgoing State Commissioners for Finance held in Abuja on Friday.\nOlofu, while commending President Bola Tinubu on the removal of subsidy, said, as finance experts, the Forum, like other Nigerians, had long yearned for it.\n“So, I will align myself with the position of the Constitution and recommend that all the accruals go into the federation account and let it be disbursed from the federation account”, Olofu stressed.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/nasarawa-gov-explains-why-governors-supported-subsidy-removal/",
        "summary": "Governor of Nasarawa State, Abdullahi Sule, said governors supported the removal of fuel subsidy thinking it will enable them to have sufficient funds to pay salaries.\nSule made this known on Thursday following a meeting between the Nigerian Governors’ Forum (NGF) and President Bola Tinubu on Wednesday, where they publicly supported the removal of subsidy.\n“Now, if you say governors all support it and now you actually cap it up by saying that some states can’t pay salaries.\nAlthough Sule stated that he has been against subsidy before he entered the public sector, adding that as the managing director of African Petroleum in 2001, he supported the removal of subsidy.\nI have always supported the removal of subsidies as a professional, as my background because I knew there was too much fraud in it,” he noted."
    },
    {
        "url": "https://www.ripplesnigeria.com/nlc-justifies-suspension-of-strike-action-despite-subsidy-removal/",
        "summary": "“All Affiliates and State Councils of Congress are hereby directed to suspend further action and mobilisation until the outcome of the final negotiations.\nThey also consented to review and establish the framework for the completion of the rehabilitation of the nation’s refineries, among others.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/opinion-fuel-subsidy-and-the-god-of-jonathan/",
        "summary": "Indeed, fuel subsidy removal was one of the major issues in the 2023 campaign process.\nOne evening, President Jonathan told me in his library: “Reuben there is no point… after God, it is government and government can do and undo.\nAhead of the announcement of the fuel subsidy removal as it became known, the Jonathan administration also set up a Subsidy Reinvestment Committee and announced palliatives.\nHe was sworn in as President on May 29, and he promptly slammed fuel subsidy removal on the people.\nDr. Ngozi Okonjo-Iweala, Peter Obi and Atedo Peterside have reportedly asked President Tinubu to apologize to President Jonathan."
    },
    {
        "url": "https://www.ripplesnigeria.com/fact-check-did-all-presidential-candidates-promise-to-remove-fuel-subsidy-as-claimed-by-sanwo-olu/",
        "summary": "CLAIM: Governor Babajide Sanwo-Olu, of Lagos State claimed that all presidential candidates during the campaigns for the 2023 elections all promised to remove fuel subsidy when elected.\nWhile negotiations were ongoing between the federal government and leaders of NLC, the Lagos state governor justified the removal of the subsidy on the premise that all presidential candidates had plans to remove subsidy.\nGovernment should not exist for palliatives but concrete leadership to bring about planned development.”Another presidential candidate who did not promise to remove fuel subsidy was Dan Nwanyanwu of the Zenith Labour Party’s (ZLP).\nA number of candidates also did not make any public pledge to remove fuel subsidy.\nCONCLUSIONGovernor Sanwo-Olu’s claim that all presidential candidates pledged to remove fuel subsidy if elected is false."
    },
    {
        "url": "https://www.ripplesnigeria.com/opinion-in-defence-of-fuel-subsidy-in-nigeria/",
        "summary": "There is now a near-unanimous rejection of the petrol subsidy regime in Nigeria.\nThere has been a growing socio-economic inattentional blindness among Nigeria’s ruling and liberal economic intellectual elite regarding the petrol subsidy issue.\n“In Nigeria, petrol subsidy is a purchasing power argument.\nI believe these proposals underestimate the multiplier force of petrol subsidy in Nigeria.\nWhile I can relate with the corruption part of the subsidy regime, I vehemently reject the dismissal of petrol subsidy as a waste."
    },
    {
        "url": "https://www.ripplesnigeria.com/kachikwu-blames-president-buhari-for-confusion-arising-from-subsidy-removal/",
        "summary": "Dumebi Kachikwu, the Action Democratic Congress (ADC) candidate for president in the 2023 elections, claims that by delegating the elimination of the fuel subsidy to his successor, President Bola Tinubu, former President Muhammadu Buhari handed his successor a banana peel.\n“Obviously the President was handed a banana peel by the outgoing President Buhari who failed to provide for subsidy beyond June when he was leaving office.\nPresident Tinubu just informed Nigerians of the situation he was meeting,” Kachikwu said.\nHe asked Tinubu to take immediate action to mitigate the effects of subsidy elimination and encouraged the Federal Government to pursue those misusing the system.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/nlc-suspends-planned-fuel-subsidy-strike/",
        "summary": "The Nigerian Labour Congress (NLC) has suspended the planned nationwide strike slated for Wednesday.\nREAD ALSO: Court stops NLC, TUC fuel subsidy strikeHe said the parties agreed that the NLC must suspend notice of strike immediately to allow further consultations on the matter.\nThe National Industrial Court, Abuja, had earlier on Monday restrained the organised labour from going ahead with the strike.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/nigerian-govt-nlc-meet-to-resolve-dispute-over-fuel-subsidy/",
        "summary": "The Federal Government met with the leadership of the Nigeria Labour Congress (NLC) on Tuesday to address the dispute arising from the removal of petrol subsidy.\nThe NLC had on June 2 given the federal government a five-day ultimatum to revert to the old price of petrol or face a nationwide strike.\nREAD ALSO: Court stops NLC, TUC fuel subsidy strikeThe NLC boycotted Sunday’s meeting between the government and the Trade Union Congress (NUC) meeting in Abuja and vowed to go ahead with the planned strike.\nThe NLC President, Joe Ajaero, led the Congress delegation to the meeting held at the Presidential Villa, Abuja, at about 6:00 p.m.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/court-stops-nlc-tuc-fuel-subsidy-strike/",
        "summary": "Justice Olufunke Anuwe of the National Industrial Court of Nigeria, Abuja, on Monday, restrained the organised labour from embarking on strike over the removal of fuel subsidy.\nThe federal government approached the court to issue an interim injunction restraining the Nigeria Labour Congress (NLC) and Trade Union Congress (TUC) from proceeding with the strike.\nThe NLC had last week given the federal government a five-day ultimatum to revert to the old price of petrol or face a nationwide strike.\nThe National Union of Electricity Employees (NUEE), Judiciary Staff Union of Nigeria (JUSUN) and other unions had directed their workers to join the strike.\nAt the proceeding, the judge ordered the unions to suspend the planned strike pending the hearing and determination of the ex parte motion filed by the federal government."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-kwara-govt-reduces-workdays-for-civil-servants/",
        "summary": "The Kwara State Governor, Abdulrahman Abdulrazaq, has approved the temporary reduction in the workdays for civil servants in the state from five to three per week.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nAs a media platform, we hold leadership accountable and will not trade the right to press freedom and free speech for a piece of cake.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/quickread-tinubus-declaration-on-fuel-subsidy-four-other-stories-we-tracked-and-why-they-matter/",
        "summary": "President Bola Tinubu last week declared that the fuel “subsidy is gone” with the announcement triggering the return of queues at filling stations as well as pushing up fuel prices across the country.\nTinubu’s declaration on subsidyOn May 29, the president took the oath of office and declared that the subsidy regime was over in Nigeria.\nHe added that the government can no longer justify paying for fuel subsidy in the wake of drying resources.\nHe said: “Subsidy can no longer be justified with its ever-increasing costs in the wake of drying resources.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-removal-ndume-urges-nlc-to-embrace-dialogue-before-strike/",
        "summary": "Senator Ali Ndume, the former leader of the Upper legislative Chamber, has called on the Nigeria Labour Congress (NLC) to call off its scheduled Wednesday strike and return to the negotiating table.\nAdditionally, he requested a meeting between the NLC and the President, Bola Tinubu, to discuss the pros and cons of subsidy removal.\nThe Nigeria Labour Congress (NLC) needs to work with the government and see how the effects can be minimized.\nNLC should go to the negotiation table with the Federal Government.”“The NLC should not go on a strike first before negotiation.\nSunday’s meeting comes four days after talks between the government, TUC and Nigerian Labour Congress ended in a deadlock."
    },
    {
        "url": "https://www.ripplesnigeria.com/oshiomhole-speaks-on-subsidy-removal-by-nigerian-govt/",
        "summary": "Adams Oshiomhole, a former governor of Edo State, has expressed optimism that disagreements between the federal government and organised labour over the elimination of fuel subsidies would be speedily handled.\nOshiomhole, a guest on Channels Television’s Sunday Politics, stated that President Bola Tinubu was aware of the effect the removal of the fuel subsidy is having on Nigerians and is committed to acting swiftly to mitigate it.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-nlc-absent-as-nigerian-govt-meets-tuc-tinubu-to-set-up-committee-on-minimum-wage/",
        "summary": "The Federal Government on Sunday met with the Trade Union Congress (TUC) in a bid to resolve the crisis trailing the removal of fuel subsidy in the country.\nThe TUC President, Festus Osifo, led the congress executives to the meeting.\nHowever, the Nigeria Labour Congress (NLC) was not represented at the session.\nAlake also dismissed rumours of disagreement with NLC over its demand for a review of the minimum wage or insistence on the return to the old fuel pump price.\nOn his part, the TUC president urged the government to revert to the old pump price in the interest of Nigerians."
    },
    {
        "url": "https://www.ripplesnigeria.com/sanwo-olu-urges-nlc-to-suspend-fuel-subsidy-strike/",
        "summary": "The Lagos State Governor, Babajide Sanwo-Olu, on Sunday, urged the Nigeria Labour Congress (NLC) to suspend the planned nationwide strike over fuel subsidy removal.\nThe Congress had last weekend given the Federal Government a five-day ultimatum to revert to the old price of petrol and risk a nationwide strike.\nThe NLC vowed to mobilise workers for a nationwide strike if the government fails to address its demand at the end of the ultimatum on Wednesday.\nSanwo-Olu, who addressed journalists after a post-inauguration church thanksgiving service in Lagos, urged the organised labour to join hands with the present administration in its bid to improve the nation’s economy.\nREAD ALSO: Subsidy: NLC writes affiliates to mobilise them for nationwide strikeHe said: ““We are thankful that Mr. President is a product of Lagos."
    },
    {
        "url": "https://www.ripplesnigeria.com/serap-urges-tinubu-to-probe-missing-2-1bn-n3-1trn-subsidy-payments-or-face-lawsuit/",
        "summary": "Socio-Economic Rights and Accountability Project (SERAP) has urged President Bola Tinubu to “set up a presidential panel of enquiry to promptly probe the grim allegations that US$2.1 billion and N3.1 trillion public funds of oil revenues and budgeted as fuel subsidy payments are missing and unaccounted for between 2016 and 2019, as documented by the Auditor-General of the Federation.”In the letter dated 3 June 2023 and signed by SERAP deputy director Kolawole Oluwadare, the organisation said: “There is a legitimate public interest in ensuring justice and accountability for these serious allegations.\nIf we have not heard from you by then, SERAP shall take all appropriate legal actions to compel your government to comply with our request in the public interest.”“The proposed panel should be headed by a retired justice of the Supreme Court or Court of Appeal, and its members should include people with proven professional record, and of the highest integrity that can act impartially, independently, and transparently.”Join the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nAs a media platform, we hold leadership accountable and will not trade the right to press freedom and free speech for a piece of cake.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-nlc-writes-affiliates-to-mobilise-them-for-nationwide-strike/",
        "summary": "The Nigeria Labour Congress {NLC}has written all its 43 affiliate unions to mobilise for the industrial action scheduled to begin on Wednesday, June 7, 2023.\nNLC affiliates include the Academic Staff Union of Universities {ASUU}, Academic Staff Union of Polytechnics {ASUP}, Nigeria Union of Teachers {NUT}, Judicial Staff Union of Nigeria{JUSUN} and the National Association of Nigeria Nurses and Midwives among others.\nREAD ALSO:NLC declares nationwide strike over fuel subsidy removalIn a letter written to the affiliates which was signed by the NLC General Secretary, Emmanuel Ugboaja, the Congress said: “We bring you greetings from the leadership of the Nigeria Labour Congress.\n“Please be informed that the nationwide action will commence on Wednesday, 7th June, 2023.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/wike-defends-tinubu-on-fuel-subsidy-removal/",
        "summary": "Immediate past Rivers State Governor, Nyesom Wike, has thrown his weight behind President Bola Tinubu’s decision to immediately remove fuel subsidy which he says is the only solution to tackling Nigeria’s economic woes.\nRead also: Tinubu meets Wike, Makinde, Ibori in Aso Rock“Yes, we discussed it.\nWe know it’s a tough decision for the people and he needs the support of everybody to see this through,” Wike said when asked if the issue of the subsidy removal was discussed at the meeting.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/tinubu-hints-at-review-of-minimum-wage-in-wake-of-subsidy-removal/",
        "summary": "In order to reflect the nation’s present economic conditions, President Bola Tinubu has pledged to reevaluate the minimum wage of workers.\nHe contended that in addition to strengthening the source and use of the nation’s revenue, the federal and state governments should jointly examine the minimum wage.\nPresident Tinubu revealed this on Friday during a meeting with the Progressive Governors Forum members, who backed the president’s decision to end the subsidy.\nSpeaking when he received members of the Hope Uzodimma-led forum, Tinubu said, “We need to do some arithmetic and soul searching on the minimum wage.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/unsustainable-apc-governors-back-tinubu-on-subsidy-removal/",
        "summary": "The Progressive Governors’ Forum has declared its support for the Federal Government on the removal of fuel subsidy.\nThe Nigeria Labour Congress (NLC) on Friday declared a nationwide strike from Wednesday to protest the removal of the fuel subsidy.\nThe governor insisted that the fuel subsidy regime was not a sustainable system for the nation’s economy.\nHe said: “Firstly, the decision about removing fuel subsidy was what presidential candidates promised Nigerians during their campaigns.\n“The removal of fuel subsidy was what we had decided as members of the economic team during the last administration of President Muhammadu Buhari."
    },
    {
        "url": "https://www.ripplesnigeria.com/11-years-after-fayemi-admits-fuel-subsidy-protest-under-jonathan-was-mere-politics/",
        "summary": "The former Ekiti State Governor, Kayode Fayemi, said on Tuesday the January 2012 protest against the removal of fuel subsidy by former President Goodluck Jonathan’s administration had a political undertone.\nFayemi stated this in a keynote address at a national dialogue organised to mark the 60th birthday of the founding national secretary of the Alliance for Democracy (AD), Udenta Udenta, in Abuja.\nJonathan later reinstated the subsidy and reduced the fuel pump price to N97 per litre after a meeting with the organised labour in Abuja.\nREAD ASLO: Fuel consumption in Nigeria drops by 12.96m after fuel subsidy removalAt the forum, the former governor urged Nigeria to take another look at its political system.\n“All political parties in the country agreed and they even put in their manifesto that subsidy must be removed."
    },
    {
        "url": "https://www.ripplesnigeria.com/nlc-declares-two-day-strike-over-fuel-subsidy-removal/",
        "summary": "The Nigeria Labour Congress (NLC) will begin a two-day warning strike on Tuesday, September 5, 2023, in protest against what it called the government’s inability to appropriately mitigate the impacts of the elimination of subsidies on Premium Motor Spirit, more commonly known as petrol.\nThe NLC President, Joe Ajaero, made the declaration on Friday during a press conference at the Labour House in Abuja, while speaking on resolutions by the NLC National Executive Committee (NEC) meeting the previous day.\nREAD ALSO:NLC warns it will be difficult to feel impact of N5bn subsidyOn May 29, 2023, the subsidy was eliminated, by President Tinubu during his inauguration speech, raising the cost of PMS to N610 per litre.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/feature-fuel-subsidy-removal-what-fate-for-nigerias-refineries/",
        "summary": "But what does this mean for Nigeria’s refineries, which have been operating at a fraction of their capacity for years?\nAccording to the Department of Petroleum Resources (DPR), Nigeria’s refineries processed only 21.6% of their combined capacity in 2022.\n“The subsidy removal will create a level playing field for all players in the downstream sector.\nHowever, not everyone is optimistic about the prospects of Nigeria’s refineries after the subsidy removal.\nThe fuel subsidy removal is a bold and controversial move by the new administration, which hopes to free up funds for public investment and development."
    },
    {
        "url": "https://www.ripplesnigeria.com/nigerian-govt-accuses-edo-gov-obaseki-of-playing-cheap-politics-over-subsidy-removal-comment/",
        "summary": "Idris made this assertion in response to remarks attributed to Edo State governor, Godwin Obaseki.\nThe governor had expressed disbelief that there was no plan in place before the subsidy removal was put into effect.\n“I am shocked that people who campaigned around the country, saying that they will remove subsidies, had no clear plans on what to do after subsidy removal.\n“As President Tinubu has admonished, the time for politics and politicking is over.”Idris said Edo under Obaseki has benefited from subsidy removal in terms of more allocation to the state.\n“Rather than delving into narratives which do not provide the complete picture, the focus should be on how the Edo state government will be using available resources to drive impactful projects that genuinely uplift the people of Edo State,” he said."
    },
    {
        "url": "https://www.ripplesnigeria.com/tinubu-had-no-plans-what-to-do-after-subsidy-removal-obaseki-laments/",
        "summary": "Edo State Governor, Godwin Obaseki, has slammed the President Bola Tinubu administration over the distribution of palliatives to Nigerians to cushion the effects of the removal of fuel subsidy and the attendant hardship placed on Nigerians.\nObaseki who made his feelings known during a press conference in Benin City on Wednesday, said he was both “shocked and scared” of the inability of the federal government to plan and effectively respond to the fuel subsidy removal that has inflicted hardship and suffering on the people.\nRead also: APC claims Obaseki inciting Edo people against Tinubu, to hide his ‘incompetence“I am shocked that people who campaigned around the country, saying that they will remove subsidies, had no clear plans on what to do after subsidy removal.\nThey don’t know what to do and how to support those who will be victims of subsidy removal.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-removal-delta-approves-three-working-days-for-civil-servants/",
        "summary": "The Delta State government has approved a three-day working week for civil servants in a bid to cushion the effect of fuel subsidy removal by President Bola Tinubu.\n“Working days for workers on grade levels 15 and above are to be worked out by the various MDAs as suitable to them,” he stated.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-consumption-in-nigeria-drops-by-12-96m-after-fuel-subsidy-removal/",
        "summary": "Petrol consumption in Nigeria dropped in July by 19.95 per cent month-on-month, following the removal of fuel subsidy by President Bola Tinubu.\nThis is contrasted with the 64.96 million litres per day recorded in June of the same year, indicating a decline of 12.96 million within one month.\nThe 19.95 per cent decline occurred after President Tinubu removed fuel subsidy, which he said is not benefiting the poor in Nigeria compared to neighbouring countries.\nThe total petrol stock stood at 1.725 billion litres, compared to 1.968 billion litres recorded on July 1, 2023, when the land-based stock was 1.059 billion litres, Marine stock stood at 826.447 million litres and the dead stock was put at 83.095 million litres.\nHowever, at the end of July, the share of petrol showed that DAPPMAN took the largest share of 765.16 million litres, NNPCL received 377.68 million litres and MOMAN had 60.973 million litres."
    },
    {
        "url": "https://www.ripplesnigeria.com/nlc-warns-it-will-be-difficult-to-feel-impact-of-n5bn-subsidy/",
        "summary": "Citing data from the National Bureau of Statistics, he claimed that N185 billion could not possibly make a difference for the 133 million multifacetedly impoverished Nigerians.\n“You start to wonder about the impact of N185bn to 133 million people by their admittance, who are multi-dimensionally poor.\nEarlier, the Presidency said the Federal Government is on standby to monitor the distribution of palliatives – meant to cushion the impact of subsidy removal – to Nigerians at the state level.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/tinubu-needs-to-take-bolder-steps-okupe-weighs-in-on-subsidy-removal-forex-policy/",
        "summary": "According to Okupe, President Tinubu has demonstrated “much determination and courage” in his role.\n“President Bola Tinubu actually hit the ground sprinting; showing much determination, zeal, commitment and courage,” Okupe, a chieftain of the Labour Party (LP), said in the thread.\n“He has taken two extraordinarily bold steps by abolishing fuel subsidy and equalising foreign exchange.\nOkupe claimed that Nigeria may lower its oil selling price outside of OPEC while simultaneously increasing its daily shipments to three million barrels and above.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-tinubu-approves-cng-initiative-to-reduce-burden-on-nigerians/",
        "summary": "President Bola Tinubu has approved the establishment of the Presidential Compressed Natural Gas Initiative (PCNGI).\nThe Special Adviser on Media and Publicity to the President, Ajuri Ngelale, who confirmed the development in a statement on Friday in Abuja, said the establishment of the PCNGI was a demonstration of the president’s readiness to ease the pain caused by the removal of fuel subsidy on Nigerians.\nThe president had in his national broadcast last month said the Federal Government would roll out 3000 units of CNG-fuelled buses to cushion the effects of the fuel subsidy removal on Nigerians.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/pains-caused-by-fuel-subsidy-removal-are-for-a-better-tomorrow-tinubu-assures-nigerians/",
        "summary": "President Bola Tinubu on Thursday assured Nigerians of a better future despite the present challenges occasioned by the removal of the petrol subsidy.\nThe president assured that the government had started to put in place palliatives to cushion the effects of the fuel subsidy removal on citizens.\nREAD ALSO: Shehu Sani knocks Tinubu’ ministerial appointmentsHe said: “These pains are pains of birth, the birth of a new nation.\n“I know the removal of fuel subsidy has created some things.\nWhat we’re going through today is for a better tomorrow."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-ui-staff-to-commence-three-day-workweek-due-to-increased-living-costs/",
        "summary": "Staff members at the University of Ibadan in Oyo State are required to work three days each week.\nThe decision, according to the statement, was made in light of the recent removal of Premium Motor Spirit subsidies.\n“Accordingly, members of staff are now expected to work on-site for three (3) days in rotation per week, with effect from Monday, 14 August 2023.\nMeanwhile, members of staff are to maintain commitment, open communication, and cooperation towards ensuring free workflow, including working from home where and when necessary.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/subsidy-bus-transportation-up-by-98-nbs-reports/",
        "summary": "A report by the National Bureau of Statistics (NBS) has revealed that the average cost of bus transportation within Nigerian cities rose from N649.59 in May 2023 to N1,285.41 in June 2023.\nThis indicates that the cost of intra-city bus transportation rose by 98 per cent or N636 within one month.\nThis is contained in the Transport Fare Watch report of the NBS for June 2023.\nAccording to the NBS, this included the breakdown of bus journeys within the cities per drop constant route; bus journey intercity (state route) charge per person amongst other means of transportation.\nOn a year-on-year basis, the report revealed that bus fares rose by 120.63 per cent from N582.61 paid by commuters in June 2022."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-senate-labour-meet-in-abuja/",
        "summary": "The Senate on Tuesday met with the organized labour at the National Assembly complex in Abuja.\nThe meeting was attended by the Senate President, Godwill Akpabio and other principal officers of the Red Chamber.\nThe President of the Nigeria Labour Congress (NLC) president Comrade Joe Ajaero and his Trade Union Congress (TUC) counterpart, Festus Osifo, led leaders of the organized labour to the meeting.\nThe NLC had last Wednesday Nigerians out on a nationwide rally to protest the removal of fuel subsidy and policy initiatives of the current administration.\nREAD ALSO: Tinubu meets NLC, TUC leaders amidst fuel subsidy protestThe labour unions are demanding the reduction in the pump price of fuel following the removal of subsidy and increase in minimum wage among others."
    },
    {
        "url": "https://www.ripplesnigeria.com/electricity-subsidy-costs-nigerian-govt-n36bn-in-three-months-nerc/",
        "summary": "The Federal Government paid a total of N36 billion to subsidise electricity consumption in the country in the first quarter of 2023, the Nigerian Electricity Regulation Commission (NERC) has said.\nNERC stated this in its quarterly report, adding that the money amounted to the payment of N12bn monthly which was paid to the Nigerian Bulk Electricity Trading (NBET).\nRead also: Top 10 stories from across Nigerian Newspapers, Monday, August 7, 2023A breakdown showed that Abuja DisCo paid N20bn from the N32.8bn it was billed, while Benin DisCo paid N14.4bn from the N17.8bn, Eko Disco paid N19.4bn from the N22.8bn it was charged and Enugu DisCo paid N15.72bn from its N20bn.\nIbadan Disco paid N17.5bn from its invoice of N24.5 billion, Ikeja DisCo paid N29.6bn from the N35.9bn given to it, Jos Disco paid N7.bn from the 8.8bn it was billed, Kaduna DisCo paid N1.8bn from the N15.3 bn.\ngiven to it, Kano paid N6.1 from its N15.bn with Port Harcourt DisCo paying 8.5bn from its N14.5bn and Yola Disco paid N899m from the N1bn it was billed."
    },
    {
        "url": "https://www.ripplesnigeria.com/serap-drags-tinubu-to-court-wants-spending-details-of-n400bn-subsidy-savings-published/",
        "summary": "The suit followed reports that the Federal Government had saved N400bn within the four weeks following the implementation of the removal of subsidy on petrol policy.\n“The Nigerian Constitution, 1999 [as amended], Freedom of Information Act, and the country’s anti-corruption and human rights obligations rest on the principle that citizens should have access to information regarding their government’s activities.\n“Prevention of corruption in the spending of savings from the removal of subsidy on petrol and preventing and addressing the challenges caused by the removal are serious and legitimate public interests.\n“Unless the government is compelled and directed to publish the spending details of the savings from the removal of subsidy on petrol, the removal will continue to undermine the rights of Nigerians, and increase their vulnerability to poverty.\n“The removal of subsidy on petrol continues to negatively and disproportionately affect poor Nigerians, undermining their right to adequate standard of living."
    },
    {
        "url": "https://www.ripplesnigeria.com/aso-rock-watch-on-tinubus-n1-trillion-subsidy-savings-one-other-talking-point/",
        "summary": "On July 31, President Bola Tinubu disclosed that his administration had saved over N1 trillion since he made the announcement on fuel subsidy on May 29.\nOne other top story from the Aso Rock villa was analysed within the week under review.\nOn N1 trillion subsidy savings claimTinubu had on Monday during a nationwide broadcast revealed that over N1 trillion had been saved in two months following the removal of fuel subsidy.\n“In a little over two months, we have saved over a trillion naira that would have been squandered on the unproductive fuel subsidy which only benefitted smugglers and fraudsters.\nTinubu’s pronouncement calls to question the hidden issues surrounding the payment of fuel subsidy by past administrations."
    },
    {
        "url": "https://www.ripplesnigeria.com/tinubu-meets-nlc-tuc-leaders-amidst-fuel-subsidy-protest/",
        "summary": "Leaders of the Nigeria Labour Congress (NLC) and the Trade Union Congress (TUC) on Wednesday met with President Bola Tinubu at the Presidential Villa, Abuja.\nThe meeting took place a few hours after the organized labour led out Nigerians to protest the removal of the fuel subsidy and other policy initiatives of the current administration.\nREAD ALSO: Fuel subsidy: Senate to meet organized labour on demandsHowever, issues discussed at the meeting have not been made public.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/nigerian-govts-response-will-determine-duration-of-fuel-subsidy-protest-nlc/",
        "summary": "The President of the Nigeria Labour Congress (NLC), Joe Ajaero, said on Wednesday the Federal Government’s response to the labour’s demand would determine the duration of the ongoing protest.\nThe NLC had last week given the federal government a seven-day ultimatum to reverse the decision on fuel subsidy removal or risk a total shutdown of the economy from Wednesday (today).\nREAD ALSO: Labour to go ahead with planned fuel subsidy protestAjaero, who addressed journalists at the Unity Fountain in Abuja, warned the government against the use of force to quell the protest.\n“It is not by using forces to stop people from expressing their views.”Join the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-senate-to-meet-organized-labour-on-demands/",
        "summary": "The Senate on Wednesday resolved to meet with the organized labour on its demands for the reversal of the fuel subsidy removal and other policies initiated by the current administration.\nThe Senate President, Godswill Akpabio, immediately went into a closed-door session with the lawmakers to deliberate on the crisis trailing the removal of the fuel subsidy by President Bola Tinubu in his May 29 inaugural address.\nHe added that the Red Chamber had also set up a three-man committee to meet with the protesters at the National Assembly.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/tuc-mobilises-members-for-fuel-subsidy-protest/",
        "summary": "The Trade Union Congress of Nigeria (TUC) has directed all its affiliates and state councils to mobilise their members for Wednesday’s nationwide protest against the removal of fuel subsidy by the Federal Government.\nThe TUC President, Mr. Festus Osifo, gave the directive in a statement on Tuesday night in Abuja.\nThe union said that the protest was against the Federal Government’s unfavourable policies.\nREAD ALSO: NLC dismisses rumours on suspension of fuel subsidy protest“Such measures include fixing of the refineries and possibly building more; functional transportation system, living wage, good medical facilities and employment.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/nlc-dismisses-rumours-on-suspension-of-fuel-subsidy-protest/",
        "summary": "The Nigeria Labour Congress (NLC) on Tuesday night dismissed rumours on the suspension of the nationwide protest slated to hold on Wednesday.\nThe Chief of Staff to the President, Femi Gbajabiamila, also expressed optimism that the labour would shelve the strike.\nHe said the NLC and Trade Union Congress (TUC) had the accepted the proposal for palliatives to cushion the effect of the fuel subsidy removal as announced by the president.\nThe statement read: “Ignore fake rumours, NLC is never divided.\nThe protest rally will be held Tomorrow (Wednesday) nationwide.”Join the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs."
    },
    {
        "url": "https://www.ripplesnigeria.com/nigerian-govt-upbeat-labour-will-shelve-planned-subsidy-strike/",
        "summary": "The Federal Government has expressed confidence that the labour unions would shift their proposed strike slated to begin on Wednesday.\nHe said: ‘’We appealed to labour to call off the strike tomorrow.\nREAD ALSO: Fuel subsidy: Nigerian govt, labour resumes meeting on palliatives, NLC president absentHe said the unions were informed by government representatives that the various palliatives proposed by the president were just the baseline and that more palliatives will be coming.\n‘’Now, as part of the principle of negotiation, when anything is put on the table, you’ll accept but you’ll push for more.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/labour-to-go-ahead-with-planned-fuel-subsidy-protest/",
        "summary": "The organized labour will go ahead with the planned nationwide protest slated for Wednesday.\nThe Nigeria Labour Congress (NLC) had last week given the federal government a seven-day ultimatum to reverse the decision on the removal of fuel subsidy or face a nationwide strike at the end of the ultimatum.\nHe also dismissed fear that the peaceful protest against the fuel subsidy would be hijacked by hoodlums.\nAjaero said: “We just adjourned to go and listen to Mr. President’s speech and to continue with our conversation tomorrow.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/nigerian-govt-saved-n1tr-from-fuel-subsidy-in-two-months-tinubu/",
        "summary": "President Bola Tinubu said on Monday the Federal Government saved N1 trillion that would have been used for the payment of fuel subsidies in just two months.\nHe said: “In a little over two months, we have saved over a trillion naira that would have been squandered on the unproductive fuel subsidy which only benefitted smugglers and fraudsters.\nThe decision was met with rise in price of fuel from N165 to N617 per litre in the last two months.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-senate-to-meet-nigerian-govt-nlc-over-planned-strike/",
        "summary": "The Senate on Monday resolved to meet with the Federal Government and the Nigeria Labour Congress (NLC) to stave off the impending nationwide strike.\nThe NLC had last week gave the federal government a seven-day ultimatum to reverse the decision on fuel subsidy removal or face a nationwide strike beginning from August 2.\nREAD ALSO: NLC, TUC ask court to vacate order on fuel subsidy strikeOther lawmakers including Senators Seriake Dickson and Olamilekan Adeola asked for calm and appealed to NLC to shelve the strike in the interest of Nigerians.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/nigeria-on-the-brink-of-collapse-catholic-bishops-rue-subsidy-removal/",
        "summary": "The Catholic Bishops Conference of Nigeria (CBCN), on Sunday, raised the alarm that the removal of fuel subsidy without provision of palliatives to cushion the effects has put the country on the brink of collapse.\nOur growing economic crisis became exacerbated with the recent withdrawal of petrol subsidy by the Federal Government.\nI am sure those running the nation’s affairs at all levels know that palliative measures can never be a cure for any economic or health challenge.\nSo, I ask: Why waste resources on palliative measures, instead of attacking the problems frontally?\nThis is not fair to all concerned.”Join the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs."
    },
    {
        "url": "https://www.ripplesnigeria.com/actress-eniola-badmus-berates-critics-of-removal-of-fuel-subsidy/",
        "summary": "Chubby Nollywood actress Eniola Badmus has taken a swipe at those who are criticising the removal of fuel subsidy ordered by President Bola Ahmed Tinubu.\nThe thespian who berated those who criticised the removal of fuel subsidy during a recent interview with popular media personality Daddy Freeze said that Nigeria is still the country with the cheapest fuel pump price in the world.\nREAD ALSO:Actress Eniola Badmus vows to drag Tiktoker to court over ‘pimp’ claimShe said, “A lot of these keypad warriors do not even have an idea of what subsidy is.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    },
    {
        "url": "https://www.ripplesnigeria.com/fuel-subsidy-climate-change-the-future-of-electric-vehicles-in-the-mobility-industry/",
        "summary": "CNG-Powered Mobility vs. Electric Options: A Glimpse into the FutureThe remarks made by the VP shed light on the ongoing debate over the choice between CNG-powered vehicles and electric alternatives.\nIt is undeniable that electric vehicles represent a significant leap towards a sustainable and environmentally friendly future.\nReviewing the Mobility Industry: The Long-Term Triumph of Electric VehiclesIn the face of mounting environmental concerns and increasingly stringent emission regulations, the mobility industry is at a critical juncture.\nThe signs indicate that electric vehicles are destined to be the long-term winners in this race.\nAs a result, the electric vehicle ecosystem has become a dynamic and robust landscape, well-positioned to revolutionize the mobility industry."
    },
    {
        "url": "https://www.ripplesnigeria.com/nulge-wants-300-salary-increase-due-to-fuel-subsidy-removal/",
        "summary": "To cushion the effect of inflation caused by the removal of the fuel subsidy, the Nigeria Union of Local Government Employees (NULGE), on Thursday, called for 300 per cent increment in the minimum wage for workers across all sectors.\nAccording to the union, the 300 per cent rise was imperative considering the inflation necessitated by the removal of fuel subsidy on local government staff.\nThe union further stated that the proposed fund should be able to carter for projects and programmes in conjunction with local government.\n“It is the conviction of the union that autonomy for local governments remains the best way to return the country to the part of development and growth.\n“This will translate to the direct funding of local governments without which no genuine national development can be achieved,” the union said."
    },
    {
        "url": "https://www.ripplesnigeria.com/bayelsa-gov-diri-unveils-106-vehicles-to-ease-pains-of-subsidy-removal/",
        "summary": "Bayelsa State governor, Douye Diri has unveiled 100 taxis and six luxury buses for a new transport scheme in the state as part of measures to alleviate the suffering of commuters in the state in the aftermath of the removal of fuel subsidy.\nInaugurating 100 taxis and six luxury buses at the DSP Alamieyeseigha Banquet Hall premises in Yenagoa, on Wednesday, Governor Diri said the initiative was his administration’s palliative to boost the transportation sector.\nA statement by the governor’s Chief Press Secretary, Daniel Alabrah, quoted him as acknowledging the hardship on Bayelsans due to the removal of the subsidy on petrol.\nHe said: “This is another historic day as we launch this fleet of transport vehicles to alleviate the suffering of our people.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/sgf-akume-urges-nigerians-to-bear-pains-of-subsidy-removal/",
        "summary": "George Akume, the Secretary to the Government of the Federation, on Monday, urged Nigerians to continue to endure the pain brought on by the elimination of the subsidy.\nHe gave Nigerians the reassurance that the suffering would soon end and that living conditions would improve.\nAkume pointed out that Bola Tinubu, the president, had good intentions for the nation and had promised Nigerians that he wouldn’t let them down.\n“I urge Nigerians to bear the pains of the removal of subsidy on petrol and its negative impact on the cost of living.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause."
    },
    {
        "url": "https://www.ripplesnigeria.com/petrol-subsidy-was-a-failure-cislac-declares/",
        "summary": "The Civil Society Legislative Advocacy Centre CISLAC, on Friday, described the subsidy policy on petrol in Nigeria as a failure and was unable to meet the reason for which it was set up in the first place.\n“Lastly, the need for wider stakeholder consultations cannot be over-emphasized as it is crucial to public trust and acceptability.\nJoin the conversationOpinionsSupport Ripples Nigeria, hold up solutions journalismBalanced, fearless journalism driven by data comes at huge financial costs.\nIf you like what we do, and are ready to uphold solutions journalism, kindly donate to the Ripples Nigeria cause.\nYour support would help to ensure that citizens and institutions continue to have free access to credible and reliable information for societal development."
    }
]